     H*****************************************************
     H*    PROGRAM NAME AM0080R CODED BY N.KANEDA         *
     H*                         CODED ON 20.03.12         *
     H*    äeë„óùìXéÛíçì¸óÕÅ@ïWèÄïi¥◊∞≈º                *
     H*****************************************************
     H            Y                                     1
     F*<í˜êÿéûçè>
     FDTR9900 IF  E           K        DISK                               TR0150
     FDMR0010 IF  E           K        DISK
     FDMR0030 IF  E           K        DISK
     FDMR0040 IF  E           K        DISK
     FDTR0010 UF  E           K        DISK
     FDTR0020 UF  E           K        DISK                      A
     FDTR0030 UF  E           K        DISK
     FDTR0040 IF  E           K        DISK                      A
     FDTR0120 UF  E           K        DISK                      A
     FDTR2060XIF  E           K        DISK
     F            RDTR2060X                         KRENAMERDTR2060
     FDTR5170 IF  E           K        DISK
     FDTR5200 UF  E           K        DISK
     FDTR5230 IF  E           K        DISK                      A
     F*ML0010 IF  E           K        DISK
     FAML0081 UF  E           K        DISK
     F            RAML0080                          KRENAMERAML0081
     FAML0080 IF  E           K        DISK
     FDTR0050 IF  E           K        DISK                      A
     FDTR0060 UF  E           K        DISK
     FNPR0100 IF  E           K        DISK
     F*<ç≤êÏâcã∆èäé~Çﬂ>
     FDMR0330 IF  E           K        DISK
     F*<ÉgÉãÉNÉZÉbÉgíl>
     FDKK0380 UF  E           K        DISK                      A
     FDTP1110 IF  E           K        DISK
     FDTP1111 IF  E           K        DISK
     F            RDTP1110                          KRENAMERDTP1111
     FAGM0060 IF  E           K        DISK
     F*<ÇªÇÃëºïiñ⁄>
     FDMR0340 IF  E           K        DISK
     FDTR0540 IF  E           K        DISK                      A
     FNPD1910 UF  E           K        DISK
     FQSYSPRT O   F     198     OF    LPRINTER
     LQSYSPRT  50FL 50OL
     E                    WK1        30  1
     E                    WK2        30  1
     E                    WK3        11  1
     E                    WK4        11  1
     E*
     E                    WT1         7  1
     E                    WT2         7  1
     E                    WT3         7  1
     E                    WT4         7  1
     E*------------------------------------------------------------
     E                    TBL01   1   3 50
     E*------------------------------------------------------------
     IRDMR0010
     I              ZZ0001                          ZZ001E
     I              ACREC                           ACRECE
     I              CUSNR                           CUSNRE
     I              CUSNM                           CUSNME
     I              SHPNR                           SHPNRE
     I              AREAD                           AREADE
     I              CUSA1                           CUSA1E
     I              CUSA2                           CUSA2E
     I              AREAC                           AREACE
     I              PHONE                           PHONEE
     I              SLNR1                           SLNR1E
     I              SLBR1                           SLBR1E
     I              SLNR2                           SLNR2E
     I              SLBR2                           SLBR2E
     I              SLNR3                           SLNR3E
     I              SLBR3                           SLBR3E
     I              CRLAM                           CRLAME
     I              DCODE                           DCODEE
     I              CLSCD                           CLSCDE
     I              SIHCD                           SIHCDE
     I              TESIT                           TESITE
     I              SMTCD                           SMTCDE
     I              KEITS                           KEITSE
     I              TATEA                           TATEAE
     I              TATES                           TATESE
     I              SIMUA                           SIMUAE
     I              SIMUS                           SIMUSE
     I              KESAI                           KESAIE
     I              USDAY                           USDAYE
     I              USANS                           USANSE
     I              OTSUA                           OTSUAE
     I              OTSUS                           OTSUSE
     I              TELEX                           TELEXE
     I              BANNM                           BANNME
     I              BAAR1                           BAAR1E
     I              BAAR2                           BAAR2E
     I              BAYCD                           BAYCDE
     I              OPPNO                           OPPNOE
     I              INSNM                           INSNME
     I              INAR1                           INAR1E
     I              INAR2                           INAR2E
     I              NOTPT                           NOTPTE
     I              NOAR1                           NOAR1E
     I              NOAR2                           NOAR2E
     I              INTER                           INTERE
     I              ZZ0671                          ZZ671E
     I              MATIM                           MATIME
     I              MADAY                           MADAYE
     I              SHPNMB                          SHPNBE
     I              SHIP1B                          SHI1BE
     I              SHIP2B                          SHI2BE
     I              AREASB                          AREABE
     I              EWECD                           EWECDE
     I              UPDID                           UPDIDE
     I              UPDDD                           UPDDDE
     I              UPDTD                           UPDTDE
     I              CRTD1                           CRTD1E
     I              CRTT1                           CRTT1E
     I              USID1                           USID1E
     I              JBID1                           JBID1E
     I              PGID1                           PGID1E
     IRDMR0030
     I              ZZ0001                          ZZ001F
     I              ACREC                           ACRECF
     I              SHPNR                           SHPNRF
     I              SHPNM                           SHPNMF
     I              SHIP1                           SHIP1F
     I              SHIP2                           SHIP2F
     I              AREAS                           AREASF
     I              ZZ0134                          ZZ134F
     I              MATIM                           MATIMF
     I              MADAY                           MADAYF
     I              SHPNMB                          SHPNBF
     I              SHIP1B                          SHP1BF
     I              SHIP2B                          SHP2BF
     I              AREASB                          AREABK
     I              SHTELB                          SHTEBK
     IRDMR0040
     I              ZZ0001                          ZZ001K
     I              ACREC                           ACRECK
     I              ITNBR                           ITNBRK
     I              ITDSC                           ITDSCK
     I              ITCOD                           ITCODK
     I              LSTPC                           LSTPCK
     I              UPD01                           UPD01K
     I              UPD02                           UPD02K
     I              UPD03                           UPD03K
     I              UPD04                           UPD04K
     I              UPD05                           UPD05K
     I              UPD06                           UPD06K
     I              UPD07                           UPD07K
     I              UPD08                           UPD08K
     I              UPD09                           UPD09K
     I              UPD10                           UPD10K
     I              LENGT                           LENGTK
     I              LENGH                           LENGHK
     I              WEIGH                           WEIGHK
     I              SIKOM                           SIKOMK
     I              PRIBL                           PRIBLK
     I              LPOST                           LPOSTK
     I              UPD11                           UPD11K
     I              UPD12                           UPD12K
     I              UPD13                           UPD13K
     I              UPD14                           UPD14K
     I              UPD15                           UPD15K
     I              UPD16                           UPD16K
     I              UPD17                           UPD17K
     I              ZZ0178                          ZZ178K
     I              MATIM                           MATIMK
     I              MADAY                           MADAYK
     I              GENCD                           GENCDK
     I              CRTD10                          CRTD1K
     I              CRTT10                          CRTT1K
     I              USID10                          USID1K
     I              JBID10                          JBID1K
     I              PGID10                          PGID1K
     I              ELECD                           ELECDK
     I              REJET                           REJETK
     IRDTR0010
     I              ZZ0001                          ZZ001T
     I              ACREC                           ACRECT
     I              A1                              A1T
     I              A2                              A2T
     I              A3                              A3T
     I              A4                              A4T
     I              A5                              A5T
     I              A6                              A6T
     I              A7                              A7T
     I              A8                              A8T
     I              A9                              A9T
     I              A10                             A10T
     I              A11                             A11T
     I              A12                             A12T
     I              A13                             A13T
     I              A14                             A14T
     I              QTYOO                           QTYOOT
     I              QTYOH                           QTYOHT
     I              QTYRS                           QTYRST
     I              QTYRD                           QTYRDT
     I              QTYRR                           QTYRRT
     I              QTYRM                           QTYRMT
     I              QTYRT                           QTYRTT
     I              QTYOB                           QTYOBT
     I              QTYOR                           QTYORT
     I              QTYOM                           QTYOMT
     I              QTYOT                           QTYOTT
     I              QTSOS                           QTSOST
     I              NOSTK                           NOSTKT
     I              YOSTK                           YOSTKT
     I              HIKIW                           HIKIWT
     I              MINOW                           MONOWT
     I              ZZ0082                          ZZ082T
     I              ITNBR                           ITNBRT
     IRDTR0040
     I              ZZ0001                          ZZ0014
     I              ACREC                           ACREC4
     I              JUTNO                           JUTNO4
     I              SEQNO                           SEQNO4
     I              ITCOD                           ITCOD4
     I              JUTKC                           JUTKC4
     I              QUANT1                          QUANT4
     I              QTYRS                           QTYRS4
     I              QTYOB                           QTYOB4
     I              DELCD                           DELCD4
     I              DOJNO                           DOJNO4
     I              BUNYN                           BUNYN4
     I              HIKNB                           HIKNB4
     IRDTR2060
     I              ZZ0001                          ZZ001S
     I              ACREC                           ACRECS
     I              ITNBR                           ITNBRS
     IRDTR5170
     I              ZZ0001                          ZZ001B
     I              ACREC                           ACRECB
     I              ITCOD                           ITCODB
     I              ITDSE                           ITDSEB
     I              ITDSJ                           ITDSJB
     I              KYUCD                           KYUCDB
     I              DESNO                           DESNOB
     I              UNPCS                           UNPCSB
     I              PACOD                           PACODB
     I              UNPRI                           UNPRIB
     I              SMOLA                           SMOLAB
     I              STACO                           STACOB
     I              LANKU                           LANKUB
     I              BIKOU                           BIKOUB
     I              IMAXQ                           IMAXQB
     I              OPQU1                           OPQU2B
     I              OPQU2                           OPQU2B
     I              M0MIN                           M0MINB
     I              PLNUM                           PLNUMB
     I              PLACE                           PLACEB
     I              ZZ0165                          ZZ165B
     IRDTR5200
     I              ZZ0001                          ZZ001Q
     I              ACREC                           ACRECQ
     I              ITCOD                           ITCODQ
     I              QTYOO                           QTYOOQ
     I              QTYOH                           QTYOHQ
     I              QTYRS                           QTYRSQ
     I              QTYRD                           QTYRDQ
     I              QTYRR                           QTYRRQ
     I              QTYRM                           QTYRMQ
     I              QTYRT                           QTYRTQ
     I              QTYOB                           QTYOBQ
     I              QTYOR                           QTYORQ
     I              QTYOM                           QTYOMQ
     I              QTYOT                           QTYOTQ
     I              QTSOS                           QTSOSQ
     I              ZZ0066                          ZZ066Q
     I              KOMIY                           KOMIYQ
     I              TAKU                            TAKUQ
     I              ZZ0104                          ZZ104Q
     IRDTR5230
     I              ZZ0001                          ZZ001R
     I              ACREC                           ACRECR
     I              JUTNO                           JUTNOR
     I              SEQNO                           SEQNOR
     I              ITCOD                           ITCODR
     I              JUTKC                           JUTKCR
     I              QUANT                           QUANTR
     I              QTYRS                           QTYRSR
     I              QTYOB                           QTYOBR
     I              DELCD                           DELCDR
     I              DOJNO                           DOJNOR
     I              BUNYN                           BUNYNR
     I              FILLR                           FILLRR
     IRDTR0050
     I              ZZ0001                          ZZ0005
     I              QUANT                           QUANT5
     I              TANKA                           TANKA5
     I              KINGA                           KINGA5
     IRDTR0540
     I              RECCD4                          RECCDX
     I              ACREC4                          ACRECX
     I              DOJNO4                          DOJNOX
     I              JUTNO4                          JUTNOX
     I              SEQNO4                          SEQNOX
     I              CUSNR4                          CUSNRX
     IRDTR0030
     I              ZZ0001                          ZZ0003
     IRDTR0060
     I              ZZ0001                          ZZ0006
     IRDTP1110
     I              ZZ0001                          ZZ001X
     IRDTP1111
     I              ZZ0001                          ZZ001Z
     IRAML0081
     I              CUSNRA                          CUSNRA
     I              ITNBRA                          ITNBRA
     I              ORDQUA                          ORDQUA
     I              ORDNOA                          ORDNOA
     I              TANKAA                          TANKAA
     I              KINGAA                          KINGAA
     I              A1A                             A1A
     I              SLSNRA                          SLSNRA
     I              MFROMA                          MFROMA
     I              JUTNOA                          JUTNOA
     I              SEQNOA                          SEQNOA
     I              BIKO1A                          BIKO1A
     I              BIKO2A                          BIKO2A
0381 IRDKK0380                                                            TR0150
     I              ZZ0001                          RECCDZ
     I              ACREC                           ACRECZ
     I              JUSEN                           JUSENZ
     I              TOKSE                           TOKSEZ
     I              TOTAM                           TOTAMZ
     I              TOKSS                           TOKSSZ
0381 IRNPD1910                                                            TR0150
     I              KEYX                            KEYX9
     IDS1         DS
     I                                        1   80GJUTN2
     I                                        1   60GJUTNA
     I                                        7   80GJUTNB
     IDS2         DS
     I                                        1  14 WITCOD
     I                                        1   10W1
     I                                        2   20W2
     I                                        3   30W3
     I                                        4   40W4
     I                                        5   50W5
     I                                        6   60W6
     I                                        7   70W7
     I                                        8   80W8
     I                                        9   90W9
     I                                       10  100W10
     I                                       11  110W11
     I                                       12  120W12
     I                                       13  130W13
     I                                       14  140W14
     IDS3         DS
     I                                        1   6 WJUTKC
     I                                        1   1 A1
     I                                        2   20A2
     I                                        3   30A3
     I                                        4   40A4
     I                                        5   50A5
     I                                        6   60A6
     IDS4         DS
     I                                        1  30 ITNBRA
     I                                        1   5 WITNB5
     I                                        1  14 WITNB1
     I                                       16  16 W#ITN1
     I                                       17  30 W#ITN2
     I                                        1  25 ITNB25
     I                                       26  30 ITNB26
     IDS5         DS
     I                                        1   80WJUTNO
     I                                        1   60WCNT
     I                                        7   80WSEQNO
     IDS6         DS
     I                                        1  30 ITDSC
     I                                        1  25 ITDS25
     I                                       26  26 ITDS26
     I                                       26  30 ITDS23
     I                                       27  30 ITDS27
     I                                       26  28 ITDS28
     I                                       27  30 ITDS30
     IDS7         DS
     I                                        1  25 W#KAT3
     I                                        5   8 W#QU1
     I                                       13  16 W#QU2
     IDS8         DS
     I                                        1   5 CUSNRE
     I                                        1   1 W#CUS1
     IDS9         DS
     I                                        1   5 CUSNRA
     I                                        1   1 W#CUSA
     IDS10        DS
     I                                        1   80JUSENA
     I                                        1   60JUTNOA
     I                                        7   80SEQNOA
     IDS11        DS
     I                                        1   8 ZZ0172
     I                                        4   4 TRACE
     IDS12        DS
     I                                        1  15 HNAME
     I                                        1   1 TANA1T
     I                                       15  15 BIKO1T
     IDS13        DS
     I                                        1   2 TRESAA
     I                                        1   1 W#TRE1
     I                                        2   2 W#TRE2
     I*< SDS >
     I           SDS
     I                                        1  10 S#PGID
     I                                      244 253 S#JOB
     I                                      254 263 S#USR
     I*< ºΩ√—ì˙ït>
     I            DS
     I                                        1  140W#SYST
     I                                        1   60W#SHMS
     I                                        7  140W#SYMD
     C*-----------------------------------------------------
     C                     TIME           W#SYST
     C                     MOVELS#JOB     W#JOB   5
     C*----------------------------------------------------
     C           PAR200    PLIST
     C                     PARM           P#JUTN  80
     C*----------------------------------------------------
     C           PAR050    PLIST
     C                     PARM           P#KOSN  1
     C                     PARM           P#SBTP  1
     C                     PARM           P#KEY1 10
     C                     PARM           P#KEY2 14
     C                     PARM           P#KEY3 10
     C                     PARM           P#KEY4 10
     C                     PARM           P#ITCD 14
     C                     PARM           P#MFIQ 110
     C                     PARM           P#JUTN  80
     C                     PARM           P#IDSC 30
     C                     PARM           P#ITNO 25
     C                     PARM           P#RTCD  2
     C*<îrëºêßå‰èàóù: @SB030R >
     C           PAR060    PLIST
     C                     PARM           P#SYOK  1        èàóùãÊï™
     C                     PARM           P#OBJF 10         Ãß≤ŸID
     C                     PARM           P#OBJ1 15         KEY1
     C                     PARM           P#OBJ2 15         KEY2
     C                     PARM           P#OBJ3 15         KEY3
     C                     PARM           P#OBJ4 15         KEY4
     C                     PARM           P#OBJ5 15         KEY5
     C                     PARM           P#CRTP 10         Ãﬂ€∏ﬁ◊—ID
     C                     PARM           P#USID 10         ’∞ªﬁ∞ID
     C                     PARM           P#JBID 10         ºﬁÆÃﬁID
     C                     PARM           P#RTN2  2         ÿ¿∞›∫∞ƒﬁ
     C*------------------------------------------------------------
     C           PAR070    PLIST
     C                     PARM           P#SKBN  1
     C                     PARM           P#LENG  30
     C                     PARM           P#MOJ1256
     C                     PARM           P#MOJ2256
     C                     PARM           P#MOJ3256
     C                     PARM           P#RETN  1
     C*------------------------------------------------------------
     C           PAR080    PLIST
     C                     PARM           P#DAY1  80
     C                     PARM           P#DATE  40
     C                     PARM           P#DAY2  80
     C*--------------------------------------------------------
     C           PAR090    PLIST
     C                     PARM           P#JUTN  80
     C*--------------------------------------------------------
     C           PAR100    PLIST
     C                     PARM           P#SELE  10       ë„óùìX
     C                     PARM           P#CUSN  5        ë„óùìX
     C                     PARM           P#ORDN 15        íçï∂î‘çÜ
     C                     PARM           P#OFNA 60        ÉtÉ@ÉCÉãñº
     C                     PARM           P#POST  1        èoâ◊çHèÍ
     C*
     C                     PARM           P#JUT2  60       éÛíçî‘çÜñº
     C                     PARM           P#SEQ2  20       ÉtÉ@ÉCÉãñº
     C                     PARM           P#QUA2  70       ÉgÉåÉTêîó 
     C                     PARM           P#TRES  2        ÉgÉåÉTéÌóﬁ
     C                     PARM           P#ITDS 25        ïiñº
     C           G0010     KLIST
     C                     KFLD           GJUTNA
     C                     KFLD           GJUTNB
     C*-----------------------------------------------------
     C           D0010     KLIST
     C                     KFLD           W1
     C                     KFLD           W2
     C                     KFLD           W3
     C                     KFLD           W4
     C                     KFLD           W5
     C                     KFLD           W6
     C                     KFLD           W7
     C                     KFLD           W8
     C                     KFLD           W9
     C                     KFLD           W10
     C                     KFLD           W11
     C                     KFLD           W12
     C                     KFLD           W13
     C                     KFLD           W14
     C*-----------------------------------------------------
     C           D0020     KLIST
     C                     KFLD           WCNT
     C                     KFLD           WSEQNO
     C*-----------------------------------------------------
     C           D002E     KLIST
     C                     KFLD           WCNT
     C                     KFLD           WKSEQ
     C*-----------------------------------------------------
     C           D0540     KLIST
     C                     KFLD           WDOJNO
     C                     KFLD           JUTNOA
     C                     KFLD           SEQNOA
     C*-----------------------------------------------------
     C           D0541     KLIST
     C                     KFLD           JUTNOA
     C                     KFLD           SEQNOA
     C*-----------------------------------------------------
     C           PAR010    PLIST
     C                     PARM           P#DELC  1
     C                     PARM           P#SELC  10
     C                     PARM           P#KOSN  1
     C                     PARM           P#JUT4  60
     C                     PARM           P#SEQ4  20
     C                     PARM           P#NBNB  6
     C                     PARM           P#NB11  6
     C                     PARM           P#NB21  6
     C                     PARM           P#NB31  6
     C                     PARM           P#NB41  6
     C                     PARM           P#NB51  6
     C                     PARM           P#DE11  60
     C                     PARM           P#DE21  60
     C                     PARM           P#DE31  60
     C                     PARM           P#DE41  60
     C                     PARM           P#DE51  60
     C                     PARM           P#RECD  2
     C*-----------------------------------------------------
     C           D0050     KLIST
     C                     KFLD           WAA1
     C                     KFLD           WAA2
     C                     KFLD           WECNTE
     C*-----------------------------------------------------
     C           D002A     KLIST
     C                     KFLD           JUTNOA
     C                     KFLD           SEQNOA
     C*----------------------------------------------------
     C           D004A     KLIST
     C                     KFLD           JUTNOA
     C                     KFLD           SEQNOA
     C*START------------------------------------------------
     C                     TIME           CLOCK   60
     C*
     C                     SETOF                     90
     C           'TSS'     CHAINDTR9900              90
     C           *IN90     IFEQ '0'
     C                     Z-ADDETIMEX    WKTIME  60
     C                     ENDIF
     C*
     C                     Z-ADD0         FLAG01  10
     C                     Z-ADD0         FLAG02  10
     C                     Z-ADD0         FLAG10  10
     C                     Z-ADD0         FLAG20  10
     C                     Z-ADD0         FLAG30  10
     C*
     C                     Z-ADD0         WKCNT   20
     C                     Z-ADD0         WKSEQ   20
     C                     Z-ADD0         W#FLAG  10
     C*
     C                     Z-ADD0         FLAG30  10
     C           FLAG30    DOWEQ0
     C                     SETOF                     75
     C                     READ RAML0081                 75
     C           *IN75     IFEQ '1'
     C                     Z-ADD1         FLAG30
     C                     ELSE
     C           A1A       IFNE ' '
     C                     EXSR #CNT
     C                     Z-ADD1         FLAG30
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*
     C           *LOVAL    SETLLAML0081
     C*
     C           FLAG02    DOWEQ0
     C                     SETOF                     70
     C                     READ RAML0081                 70
     C           *IN70     IFEQ '1'
     C           W#FLAG    IFEQ 1
     C                     EXSR #UPD01
     C                     ENDIF
     C                     Z-ADD1         FLAG02
     C                     ELSE
     C*
     C           A1A       IFNE ' '
     C*
     C                     Z-ADD1         W#FLAG  10
     C*
     C           CUSNRA    IFEQ W#CUSN
     C           ORDNOA    ANDEQW#ORDN
     C*
     C           A1A       IFEQ 'A'
     C           A1A       OREQ 'B'
     C           A1A       OREQ 'E'
     C           A1A       OREQ 'X'
     C*
     C                     SETOF                     95
     C           CUSNRA    CHAINDMR0010              95
     C           *IN95     IFEQ '0'
     C                     Z-ADDDCODEE    WDCODE  20
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*
     C           WKCNT     IFGT 6
     C                     EXSR #UPD01
     C                     Z-ADD0         WKCNT
     C                     EXSR #CNT
     C                     EXSR #RTN1
     C                     ELSE
     C                     EXSR #RTN1
     C                     ENDIF
     C*
     C                     ELSE
     C                     ENDIF
     C*
     C                     ELSE
     C*
     C                     EXSR #UPD01
     C*
     C                     Z-ADD0         WKCNT
     C*----------------------------------------------------
     C*
     C                     EXSR #TYOK
     C*
     C*-----------------------------------------------------
     C                     EXSR #CNT
     C*
     C           A1A       IFEQ 'A'
     C           A1A       OREQ 'B'
     C           A1A       OREQ 'E'
     C           A1A       OREQ 'X'
     C*
     C                     SETOF                     95
     C           CUSNRA    CHAINDMR0010              95
     C           *IN95     IFEQ '0'
     C                     Z-ADDDCODEE    WDCODE  20
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*
     C           WKCNT     IFGT 6
     C                     EXSR #UPD01
     C                     Z-ADD0         WKCNT
     C                     EXSR #CNT
     C                     EXSR #RTN1
     C                     ELSE
     C                     EXSR #RTN1
     C                     ENDIF
     C*
     C                     ELSE
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* èIóπ
     C           FLAG20    IFEQ 0
     C*åèêîämîF
     C                     EXSR #DOJ2                      ìØéûî[ì¸
     C*ÇQåèà»è„
     C           W#CNT1    IFGE 2
     C                     EXSR #DOJ1                      ìØéûî[ì¸
     C*ÉgÉåÉTàƒì‡ÉfÅ[É^çÏê¨
     C                     EXSR #SHKA                      ÉgÉåÉT
     C                     ELSE
     C*ìØéûî[ì¸ÉNÉäÉA
     C                     EXSR #DOJ3                      ìØéûî[ì¸
     C                     ENDIF
     C*
     C                     EXSR #PRT01                     AML0080
     C                     ENDIF
     C*
     C***                  ELSE
     C***                  ENDIF
     C*------------------------------------------------------------
     C                     SETON                     LR
     C                     RETRN
     C*------------------------------------------------------------
     C           #RTN1     BEGSR
     C                     SELEC
     C           A1A       WHEQ 'A'
     C                     EXSR #HYOZ
     C           WKCNT     ADD  1         WKCNT
     C           A1A       WHEQ 'E'
     C                     EXSR #PART
     C           WKCNT     ADD  1         WKCNT
     C           A1A       WHEQ 'B'
     C*---------
     C*
     C           W#CUSA    IFEQ '0'
     C                     MOVEL'P'       WAA1    1
     C                     MOVEL'B'       WAA2    1
     C                     ELSE
     C                     MOVEL'P'       WAA1
     C                     MOVEL'E'       WAA2
     C                     ENDIF
     C*---------
     C*
     C                     SETOF                     95
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0
     C*DTR0060 UPDATE
     C                     SETOF                     91
     C           2         CHAINDTR0060              91
     C           *IN91     IFEQ '0'
     C*
     C           BCNTE     IFEQ 0
     C           BCNTE     ADD  1         BCNTE
     C                     ENDIF
     C*
     C                     Z-ADDBCNTE     WECNTE  40
     C           BCNTE     ADD  1         BCNTE
     C                     UPDATRDTR0060
     C                     ENDIF
     C*
     C           D0050     CHAINDTR0050              95
     C           *IN95     IFEQ '1'
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C                     ENDIF
     C*
     C                     ENDDO
     C*-----------------------------------------------------
     C                     EXSR #PAR2
     C           WKCNT     ADD  1         WKCNT
     C*
     C*ÇªÇÃëº
     C           A1A       WHEQ 'X'
     C                     EXSR #EXTR
     C           WKCNT     ADD  1         WKCNT
     C*
     C                     ENDSL
     C                     ENDSR
     C*------------------------------------------------------------
     C           #HYOZ     BEGSR
     C                     MOVEL*BLANK    WITDSC 30
     C*
     C                     SETOF                     919293
     C           ITNB25    CHAINDMR0040              91
     C           *IN91     IFEQ '0'
     C                     MOVELITCODK    WITCOD 14
     C*
     C           TANKAA    IFEQ 0
     C                     EXSR #TANKA
     C                     ELSE
     C                     Z-ADDTANKAA    WTANKA
     C                     ENDIF
     C*
     C                     MOVELITNBRK    WITDSC 30
     C                     MOVE ITNB26    WITDSC           ÉgÉbÉJ
     C                     MOVELELECDK    WELECD  1
     C*
     C                     Z-ADD0         WA5     10
     C                     Z-ADD0         WHIKI   50
     C                     Z-ADD0         WMINO   50
     C           D0010     CHAINDTR0010              92
     C           *IN92     IFEQ '0'
     C           QTYOHT    IFGE ORDQUA                     ëSäÆ
     C           QTYOHT    SUB  ORDQUA    QTYOHT
     C           QTYRST    ADD  ORDQUA    QTYRST
     C           QTYRTT    ADD  ORDQUA    QTYRTT
     C                     Z-ADDORDQUA    WHIKI
     C                     Z-ADD1         WA5
     C                     ELSE
     C           QTYOBT    ADD  ORDQUA    QTYOBT           ñ¢î[
     C           QTYOTT    ADD  ORDQUA    QTYOTT
     C                     Z-ADD2         WA5
     C                     Z-ADDORDQUA    WMINO
     C                     ENDIF
     C                     UPDATRDTR0010
     C* éÛíçÇe
     C                     Z-ADDWKCNT     WSEQNO
     C           D0020     CHAINDTR0020              95
     C           *IN95     IFEQ '1'
     C                     EXSR #MOV2
     C                     WRITERDTR0020
     C                     ENDIF
     C* à¯ìñÇe
     C           D0020     CHAINDTR0040              96
     C           *IN96     IFEQ '1'
     C                     EXSR #MOV3
     C                     WRITERDTR0040
     C                     ENDIF
     C* ÉgÉãÉNÉZÉbÉg
     C           TOKSSA    IFNE *BLANK
     C***                  EXSR #RTN5
     C                     MOVELWCNT      W#JUTN  80
     C                     MOVE WSEQNO    W#JUTN
     C*
     C                     SETOF                     92
     C           W#JUTN    CHAINDKK0380              92
     C           *IN92     IFEQ '1'
     C                     MOVEL'N1'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDW#JUTN    JUSENZ
     C                     Z-ADD0         TOKSEZ
     C*
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C*--ÉgÉãÉNílêîéö
     C                     Z-ADDTOKSEA    TOKSEZ
     C*--ÉgÉãÉNílêîéö
     C***                  Z-ADDW#TOK5    TOKSEZ
     C                     MOVELWTOTAM    TOTAMZ
     C*
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C                     ELSE
     C                     MOVEL'N1'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDW#JUTN    JUSENZ
     C                     Z-ADD0         TOKSEZ
     C*
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C*--ÉgÉãÉNílêîéö
     C                     Z-ADDTOKSEA    TOKSEZ
     C*--ÉgÉãÉNílêîéö
     C***                  Z-ADDW#TOK5    TOKSEZ
     C*
     C                     MOVELWTOTAM    TOTAMZ
     C*
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     EXSR #TR010                     ç›å…à¯ìñé©ìÆ
     C*
     C*DTR0120 WRITE
     C                     SETOF                     95
     C           ITNB25    CHAINDTR2060X             95
     C           *IN95     IFEQ '0'
     C           SEBAS     IFEQ ' '
     C                     MOVEL'O'       SHOCDV
     C                     ELSE
     C                     MOVELSEBAS     SHOCDV
     C                     ENDIF
     C                     EXSR #D120
     C                     ELSE
     C                     SETON                     H7
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETON                     H3
     C                     ENDIF
     C                     ELSE
     C                     SETON                     H4
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #CNT      BEGSR
     C           A1A       IFNE ' '
     C*
     C           FLAG10    IFEQ 0
     C*----------------------------------------------------
     C*íºëóêÊ
     C                     EXSR #TYOK
     C*
     C*----------------------------------------------------
     C                     Z-ADD1         FLAG10
     C                     ENDIF
     C*
     C                     SETOF                     95
     C           CUSNRA    CHAINDMR0010              95
     C           *IN95     IFEQ '0'
     C                     Z-ADDDCODEE    WDCODE  20
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*
     C                     Z-ADD0         FLAG11  10
     C           FLAG11    DOWEQ0
     C*
     C                     EXSR #HAIT1
     C*
     C           P#RTN2    IFEQ *BLANK
     C*
     C           1         CHAINDTR0030              93
     C           *IN93     IFEQ '0'
     C                     Z-ADDJCCNT     WCNT    60
     C           1         ADD  JCCNT     JCCNT
     C                     UPDATRDTR0030
     C*
     C                     EXSR #HAIT2
     C                     Z-ADD1         FLAG11
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDDO
     C*
     C                     SETOF                     949596
     C                     Z-ADD0         WSEQNO  20
     C           D0020     CHAINDTR0020              94
     C           *IN94     IFEQ '1'
     C                     EXSR #MOV1
     C                     WRITERDTR0020
     C                     ENDIF
     C*
     C           WKCNT     ADD  1         WKCNT
     C*
     C                     ENDIF
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C*íºëóêÊèZèä
     C           #TYOK     BEGSR
     C                     MOVELCUSNRA    W#CUSN  5
     C                     MOVELORDNOA    W#ORDN 15
     C*
     C                     MOVELYUBINA    W#YUBI 10
     C                     MOVELSHPNMA    W#SHP1 50
     C*ï∂éöóÒëÄçÏÅièZèäÇPÅj
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD60        P#LENG
     C                     MOVELSHIP1A    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#SHI1 60
     C***
     C*ï∂éöóÒëÄçÏÅièZèäÇQÅj
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD60        P#LENG
     C                     MOVELSHIP2A    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#SHI2 60
     C***
     C                     MOVELSHTELA    W#SHTL 15
     C*ï∂éöóÒëÄçÏÅiïîèêÅj
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD62        P#LENG
     C                     MOVELBUSYOA    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#BUSY 62
     C***
     C*ï∂éöóÒëÄçÏÅiîıçlÇPÅj
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD62        P#LENG
     C                     MOVELBIKO1A    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#BIK1 62
     C*
     C*ï∂éöóÒëÄçÏÅiîıçlÇQÅj
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD62        P#LENG
     C                     MOVELBIKO2A    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#BIK2 62
     C*
     C                     Z-ADDDUEDYA    W#DUEY  80
     C                     Z-ADDSAGCDA    W#SAGY  50
     C                     ENDSR
     C*-----------------------------------------------------
     C           #UPD01    BEGSR
     C                     SETOF                     90
     C           D002E     CHAINDTR0020              90
     C           *IN90     IFEQ '0'
     C                     Z-ADDWKCNT     DETCN
     C                     UPDATRDTR0020
     C                     ENDIF
     C                     ENDSR
     C*------------------------------------------------------------
     C*
     C           #PART     BEGSR
     C                     MOVEL*BLANK    WELECD
     C                     SETOF                     919293
     C           WITNB1    CHAINDTR5170              91
     C           *IN91     IFEQ '0'
     C                     MOVEL*BLANK    WITCOD 14
     C                     Z-ADDUNPRIB    WTANKA  90
     C*
     C                     EXSR #RTN3                       ﬂ∞¬À›“≤
     C*
     C                     Z-ADD0         WA5     10
     C                     Z-ADD0         WHIKI   50
     C                     Z-ADD0         WMINO   50
     C           WITNB1    CHAINDTR5200              92
     C           *IN92     IFEQ '0'
     C           QTYOHQ    IFGE ORDQUA                     ëSäÆ
     C           QTYOHQ    SUB  ORDQUA    QTYOHQ
     C           QTYRSQ    ADD  ORDQUA    QTYRSQ
     C           QTYRTQ    ADD  ORDQUA    QTYRTQ
     C                     Z-ADDORDQUA    WHIKI
     C                     Z-ADD1         WA5
     C                     ELSE
     C           QTYOBQ    ADD  ORDQUA    QTYOBQ
     C           QTYOTQ    ADD  ORDQUA    QTYOTQ
     C                     Z-ADD2         WA5
     C                     Z-ADDORDQUA    WMINO
     C                     ENDIF
     C                     UPDATRDTR5200
     C*
     C                     Z-ADDWKCNT     WSEQNO
     C           D0020     CHAINDTR0020              95
     C           *IN95     IFEQ '1'
     C                     EXSR #MOV2
     C                     MOVEL'E'       A1
     C                     MOVEL'**'      NBNBR
     C                     MOVEL*BLANK    ITDSC
     C                     MOVELWITDSC    ITDSC
     C                     MOVELWITNB1    ITCOD
     C                     WRITERDTR0020
     C                     ENDIF
     C*
     C           D0020     CHAINDTR5230              96
     C           *IN96     IFEQ '1'
     C                     EXSR #MOV5
     C                     WRITERDTR5230
     C                     ENDIF
     C*DTR0120 WRITE
     C                     SETOF                     95
     C           WJUTNO    CHAINDTR0120              95
     C           *IN95     IFEQ '1'
     C*
     C           PLACEB    IFEQ ' '
     C                     MOVEL'O'       SHOCDV
     C                     ELSE
     C                     MOVELPLACEB    SHOCDV
     C                     ENDIF
     C*
     C                     EXSR #D120
     C                     ELSE
     C                     SETON                     H8
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETON                     H5
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETON                     H6
     C                     ENDIF
     C*
     C                     ENDSR
     C*------------------------------------------------------------
     C           #PAR2     BEGSR
     C                     MOVEL*BLANK    WITDSC 30
     C                     MOVEL*BLANK    WITDS2 30
     C                     MOVEL*BLANK    WITDSJ 30
     C*
     C                     Z-ADD0         WTANKA  90
     C                     SETOF                     96
     C           WITNB1    CHAINDTR5170              96
     C           *IN96     IFEQ '0'
     C                     MOVELITDSJB    WITDSJ
     C                     MOVELITDSEB    WITDSC
     C                     Z-ADDUNPRIB    WTANKA  90
     C                     ENDIF
     C                     EXSR #RTN3
     C*
     C                     Z-ADDWKCNT     WSEQNO
     C           D0020     CHAINDTR0020              95
     C           *IN95     IFEQ '1'
     C*
     C                     EXSR #MOV2
     C                     MOVEL'E'       A1
     C                     Z-ADD0         A2
     C                     Z-ADD0         A3
     C                     Z-ADD0         A4
     C                     Z-ADD0         A5
     C                     Z-ADD1         A6
     C                     MOVEL*BLANK    ITCOD
     C                     MOVELDESNOB    ITCOD
     C           W#CUSA    IFEQ '0'
     C                     MOVEL'PB'      NBNBR
     C                     ELSE
     C                     MOVEL'PE'      NBNBR
     C                     ENDIF
     C                     MOVE WECNTE    NBNBR
     C                     WRITERDTR0020
     C                     ENDIF
     C*éËîzêîåvéZ
     C                     MOVEL*BLANK    W#KAT3 25
     C                     MOVEL*BLANK    WKATA4 14
     C                     Z-ADD0         WQUAN4  50
     C           UNPCSB    IFNE 1
     C                     MOVEL'∫ﬁ≥π≤'   WKATA4
     C           UNPCSB    MULT ORDQUA    WQUAN4
     C*
     C                     MOVELTBL01,2   W#KAT3
     C*
     C                     MOVE UNPCSB    W#QU1
     C                     SELEC
     C           UNPCSB    WHLE 9
     C                     MOVEL'   '     W#QU1
     C           UNPCSB    WHLE 99
     C                     MOVEL'  '      W#QU1
     C           UNPCSB    WHLE 999
     C                     MOVEL' '       W#QU1
     C           UNPCSB    WHLE 9999
     C                     ENDSL
     C*
     C                     MOVE ORDQUA    W#QU2
     C                     SELEC
     C           ORDQUA    WHLE 9
     C                     MOVEL'   '     W#QU2
     C           ORDQUA    WHLE 99
     C                     MOVEL'  '      W#QU2
     C           ORDQUA    WHLE 999
     C                     MOVEL' '       W#QU2
     C           ORDQUA    WHLE 9999
     C                     ENDSL
     C*
     C                     MOVE WQUAN4    WAA     5
     C           WQUAN4    IFLE 9
     C                     MOVEL'    '    WAA
     C                     ELSE
     C           WQUAN4    IFLE 99
     C                     MOVEL'   '     WAA
     C                     ELSE
     C           WQUAN4    IFLE 999
     C                     MOVEL'  '      WAA
     C                     ELSE
     C           WQUAN4    IFLE 9999
     C                     MOVEL' '       WAA
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVELWAA       WBB     9
     C                     MOVE '∫√ ≤'    WBB
     C                     MOVE WBB       WKATA4
     C                     ENDIF
     C*DTR0050 WRITE
     C*
     C                     EXSR #DELDY
     C*
     C           W#CUSA    IFEQ '0'
     C                     MOVEL'P'       WAA1    1
     C                     MOVEL'B'       WAA2    1
     C                     ELSE
     C                     MOVEL'P'       WAA1
     C                     MOVEL'E'       WAA2
     C                     ENDIF
     C*
     C                     SETOF                     92
     C           D0050     CHAINDTR0050              92
     C           *IN92     IFEQ '1'
     C                     MOVEL'SF'      ZZ0005
     C                     MOVEL*BLANK    ACREC
     C           W#CUSA    IFEQ '0'
     C                     MOVEL'P'       AA1
     C                     MOVEL'B'       AA2
     C                     ELSE
     C                     MOVEL'P'       AA1
     C                     MOVEL'E'       AA2
     C                     ENDIF
     C*-----------------------------------------------------
     C                     Z-ADDWECNTE    AA4
     C                     MOVEL*BLANK    ITDSC
     C                     MOVELWITDSC    ITDSC
     C                     Z-ADDORDQUA    QUANT5
     C                     Z-ADDUNPRIB    TANKA5
     C           QUANT5    MULT UNPRIB    KINGA5
     C                     Z-ADDWJUTNO    JUSEN
     C                     MOVELCUSNRA    CUSNR
     C                     Z-ADD0         SIKYN
     C                     MOVEL'E'       A1
     C                     Z-ADD0         A2
     C                     Z-ADD0         A3
     C                     Z-ADD0         A4
     C                     Z-ADD0         A5
     C                     Z-ADD1         A6
     C                     Z-ADD0         DETCN
     C                     Z-ADD0         SISAC
     C                     MOVE WDELDY    DELEV
     C                     Z-ADD0         MITSU
     C                     Z-ADD0         ZUMEN
     C                     Z-ADD0         SIYTE
     C                     Z-ADD0         TORSI
     C                     MOVEL*BLANK    TORQU
     C                     Z-ADD0         KENSA
     C                     Z-ADD0         ZAISI
     C                     Z-ADD0         HOSIK
     C                     MOVELDESNOB    KATA1
     C                     Z-ADD0         QUAN1
     C                     MOVEL*BLANK    KIBA1
     C*∂¿º∑
     C                     MOVEL*BLANK    KATA2
     C                     SETOF                     96
     C           DESNOB    CHAINNPR0100              96
     C           *IN96     IFEQ '0'
     C                     MOVELITDSC1    KATA2
     C                     ELSE
     C                     MOVELWITDSJ    KATA2
     C                     ENDIF
     C*
     C                     Z-ADD0         QUAN2
     C                     MOVEL*BLANK    KIBA2
     C                     MOVELW#KAT3    KATA3
     C                     Z-ADD0         QUAN3
     C                     MOVEL*BLANK    KIBA3
     C                     MOVELWKATA4    KATA4
     C                     Z-ADD0         QUAN4
     C                     MOVEL*BLANK    KIBA4
     C                     MOVEL'PE.∫›Œﬂ≥'KATA5
     C                     Z-ADD0         QUAN5
     C                     MOVEL*BLANK    KIBA5
     C                     Z-ADDUNPRIB    BAIKA
     C*
     C                     SELEC
     C           PLACEB    WHEQ 'O'
     C                     MOVELLOCAO1    USERN
     C           PLACEB    WHEQ 'K'
     C                     MOVELLOCAK1    USERN
     C           PLACEB    WHEQ 'T'
     C                     MOVELLOCAT1    USERN
     C                     ENDSL
     C*
     C                     MOVEL*BLANK    SEFIN
     C                     MOVEL' '       SECAN
     C                     Z-ADD0         SEHAD
     C                     Z-ADD0         NSEQN
     C                     Z-ADD0         OUTQU
     C                     Z-ADD0         OWQUA
     C                     Z-ADD0         FIQUA
     C                     MOVEL*BLANK    FNAIY
     C                     Z-ADD0         BUNNO
     C                     Z-ADD0         FIDAY
     C                     MOVEL' '       SIDEC
     C                     MOVEL*BLANK    ZZ0348
     C                     Z-ADD0         MADEL
     C                     Z-ADDUNPRIB    STPRI
     C                     MOVEL*BLANK    ZZ0371
     C                     Z-ADDWDELDY    DELEV8
     C                     Z-ADD0         SEHAD8
     C                     Z-ADD0         FIDAY8
     C                     WRITERDTR0050
     C                     ENDIF
     C*
     C                     EXSR #SPD
     C*DTR0120
     C                     EXSR #D120X
     C                     ENDSR
     C*------------------------------------------------------------
     C*ÇªÇÃëºïiñ⁄
     C           #EXTR     BEGSR
     C*
     C                     Z-ADDWKCNT     WSEQNO
     C           D0020     CHAINDTR0020              95
     C           *IN95     IFEQ '1'
     C*
     C                     MOVEL*BLANK    WELECD
     C                     SETOF                     919293
     C           WITNB5    CHAINDMR0340              91
     C           *IN92     IFEQ '0'
     C*
     C                     MOVEL'JF'      ZZ0001
     C                     MOVEL' '       ACREC
     C                     Z-ADDWCNT      JUTNO
     C                     Z-ADDWSEQNO    SEQNO
     C                     MOVELCUSNRA    CUSNR
     C                     MOVELW#SHPN    SHPNR
     C*
     C* íSìñé“
     C           ESLSNA    IFNE 0
     C                     Z-ADDESLSNA    SLSNR
     C                     ELSE
     C*
     C           SLSNR4    IFEQ 0
     C                     Z-ADDSLSNRA    SLSNR
     C                     ELSE
     C                     Z-ADDSLSNR4    SLSNR
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVELORDNOA    ORDNO
     C*
     C                     MOVE *DATE     JUTDY
     C                     Z-ADD0         DETCN
     C                     Z-ADD0         DELCD
     C                     Z-ADD0         W#DELC
     C*
     C                     SETOF                     91
     C           WITNB5    CHAINDMR0340              91
     C           *IN91     IFEQ '0'
     C*
     C*î[ä˙
     C           DELDYA    IFEQ 0
     C                     SELEC
     C           WITNB5    WHEQ '¡Æ∏ø≥'
     C*
     C***                  Z-ADD999999    DELDY
     C***                  Z-ADD99999999  DELDY8
     C*
     C           CLOCK     IFLE WKTIME
     C                     Z-ADDUDATE     DELDY
     C                     Z-ADD*DATE     DELDY8
     C                     ELSE
     C*
     C                     EXSR #DELD2
     C                     Z-ADDWDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C*
     C                     ENDIF
     C*
     C*ìØéûî[ì¸Ç∆ÉgÉåÉTÇ≈Ç»Ç¢èÍçá
     C                     OTHER
     C           TYKCDA    IFEQ *BLANK
     C           W#TRE1    ANDEQ*BLANK
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     ELSE
     C*
     C           CLOCK     IFLE WKTIME
     C                     Z-ADDUDATE     DELDY
     C                     Z-ADD*DATE     DELDY8
     C                     ELSE
     C*
     C                     EXSR #DELD2
     C                     Z-ADDWDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDSL
     C*î[ä˙éwíË
     C                     ELSE
     C                     Z-ADDDELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD1         DELCD            î[ä˙éwíË
     C                     Z-ADD1         W#DELC  10
     C                     ENDIF
     C*
     C                     MOVELA14       A1
     C                     Z-ADDA24       A2
     C                     Z-ADDA34       A3
     C                     Z-ADDA44       A4
     C                     Z-ADDA54       A5
     C                     Z-ADDA64       A6
     C                     ENDIF
     C*
     C                     Z-ADDORDQUA    QUANT
     C                     Z-ADDTANKAA    TANKA1
     C           TANKA1    MULT ORDQUA    KINGA
     C*
     C                     MOVEL*BLANK    ITDSC
     C                     MOVELITNBRA    ITDSC
     C*
     C                     MOVEL'00000000'ITCOD
     C                     MOVE '00000000'ITCOD
     C                     MOVEL*BLANK    DOJNO
     C*
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYN
     C                     ELSE
     C                     Z-ADD1         BUNYN
     C                     ENDIF
     C*
     C                     Z-ADD0         INVNO
     C                     MOVEL*BLANK    NBNBR
     C                     Z-ADD0         BUMOR
     C                     MOVEL*BLANK    BUNDT
     C                     Z-ADD0         BQUAN
     C                     Z-ADD0         HJQTY
     C                     Z-ADD0         BUNSU
     C                     MOVEL*BLANK    REJUK
     C                     MOVEL*BLANK    SLSND
     C                     Z-ADD0         TKING
     C                     MOVEL*BLANK    SSHUF
     C                     Z-ADD0         HIKIQ
     C                     MOVEL*BLANK    NOFIL
     C* ÉgÉåÉTïtÇ´
     C***        W#TRE1    IFGE '1'
     C***        W#TRE1    ANDLE'9'
     C           TRESAA    IFGE '1'
     C           TRESAA    ANDLE'99'
     C                     MOVEL'*'       TRACE
     C                     ELSE
     C                     MOVEL*BLANK    ZZ0172
     C                     ENDIF
     C*
     C                     MOVEL*BLANK    SHPCD
     C                     Z-ADD0         SHUDY
     C                     MOVE *DATE     REDAY
     C                     MOVE *DATE     JUTDY8
     C                     Z-ADD0         SHUDY8
     C                     MOVE *DATE     REDAY8
     C                     Z-ADD0         CODED
     C                     MOVEL*BLANK    CUSID
     C                     MOVEL*BLANK    SHICD
     C                     Z-ADDW#SYMD    CRTD2
     C                     Z-ADDW#SHMS    CRTT2
     C                     MOVELS#USR     USID2
     C                     MOVELS#JOB     JBID2
     C                     MOVELS#PGID    PGID2
     C*
     C                     MOVEL*BLANK    LCLA2
     C                     MOVEL*BLANK    MCLA2
     C                     MOVEL*BLANK    SCLA2
     C*
     C           SEQNO     IFNE 0
     C                     SETOF                     90
     C           ITDS25    CHAINDMR0040              90
     C           *IN90     IFEQ '0'
     C                     MOVELLCLAS     LCLA2
     C                     MOVELMCLAS     MCLA2
     C                     MOVELSCLAS     SCLA2
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ELSE
     C                     ENDIF
     C*
     C                     WRITERDTR0020
     C*
     C                     EXSR #D120Z
     C*
     C                     Z-ADDWCNT      JUTNOA
     C                     Z-ADDWSEQNO    SEQNOA
     C                     UPDATRAML0081
     C*
     C                     ELSE
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------
     C           #D120X    BEGSR
     C*DTR0120 WRITE
     C                     SETOF                     95
     C           WJUTNO    CHAINDTR0120              95
     C           *IN95     IFEQ '1'
     C*
     C           PLACEB    IFEQ ' '
     C                     MOVEL'O'       SHOCDV
     C                     ELSE
     C                     MOVELPLACEB    SHOCDV
     C                     ENDIF
     C*
     C                     EXSR #D120
     C                     ELSE
     C                     SETON                     H8
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------
     C           #D120Z    BEGSR
     C*DTR0120 WRITE
     C                     SETOF                     95
     C           WJUTNO    CHAINDTR0120              95
     C           *IN95     IFEQ '1'
     C*
     C                     MOVEL'C'       SHOCDV
     C*
     C                     EXSR #D120
     C                     ELSE
     C                     SETON                     H8
     C                     ENDIF
     C                     ENDSR
     C*-------------------------------------------------------
     C           #SPD      BEGSR
     C                     MOVEL' '       P#KOSN
     C                     MOVEL'7'       P#SBTP
     C                     MOVELAA1       P#KEY1
     C                     MOVELAA2       P#KEY2
     C                     MOVE AA4       P#KEY3
     C                     MOVEL*BLANK    P#KEY4
     C                     MOVEL*BLANK    P#ITCD
     C                     Z-ADDQUANT5    P#MFIQ
     C                     MOVE JUSEN     P#JUTN
     C                     MOVELITDSC     P#IDSC
     C                     MOVEL' '       P#ITNO
     C                     MOVEL*BLANK    P#RTCD                           *  +
     C                     CALL 'CT5000R' PAR050
     C                     ENDSR
     C*----------------------------------------------------------
     C           #MOV1     BEGSR
     C                     MOVEL'JF'      ZZ0001
     C                     MOVEL' '       ACREC
     C                     Z-ADDWCNT      JUTNO
     C                     Z-ADDWSEQNO    SEQNO
     C                     MOVELCUSNRA    CUSNR
     C                     MOVELW#SHPN    SHPNR
     C*
     C           ESLSNA    IFNE 0
     C                     Z-ADDESLSNA    SLSNR
     C                     ELSE
     C                     Z-ADDSLSNRA    SLSNR
     C                     ENDIF
     C*
     C                     MOVELORDNOA    ORDNO
     C                     MOVE *DATE     JUTDY
     C                     Z-ADD0         DELCD
     C                     Z-ADD0         W#DELC  10
     C* äCäO
     C           W#CUS1    IFNE '0'
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     ELSE
     C* çëì‡
     C           DELDYA    IFEQ 0
     C*
     C           CLOCK     IFLE WKTIME
     C                     Z-ADDUDATE     DELDY
     C                     Z-ADD*DATE     DELDY8
     C                     ELSE
     C*
     C                     EXSR #DELD2
     C                     Z-ADDWDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C*
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVE DELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD1         DELCD            î[ä˙éwíË
     C                     Z-ADD1         W#DELC  10
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVEL*BLANK    A1
     C                     Z-ADD0         A2
     C                     Z-ADD0         A3
     C                     Z-ADD0         A4
     C                     Z-ADD0         A5
     C                     Z-ADD0         A6
     C                     Z-ADD0         QUANT
     C                     Z-ADD0         TANKA1
     C                     Z-ADD0         KINGA
     C                     MOVEL*BLANK    ITDSC
     C                     MOVE '0000000' ITCOD
     C                     MOVEL'0000000' ITCOD
     C                     MOVEL*BLANK    DOJNO
     C*
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYN
     C                     ELSE
     C                     Z-ADD1         BUNYN
     C                     ENDIF
     C*
     C                     Z-ADD0         INVNO
     C                     MOVEL*BLANK    NBNBR
     C                     Z-ADD0         BUMOR
     C                     MOVEL*BLANK    BUNDT
     C                     Z-ADD0         BQUAN
     C                     Z-ADD0         HJQTY
     C                     Z-ADD0         BUNSU
     C                     MOVEL*BLANK    REJUK
     C                     MOVEL*BLANK    SLSND
     C                     Z-ADD0         TKING
     C                     MOVEL*BLANK    SSHUF
     C                     Z-ADD0         HIKIQ
     C                     MOVEL*BLANK    NOFIL
     C                     MOVEL' '       ZZ0172
     C                     MOVEL*BLANK    SHPCD
     C                     Z-ADD0         SHUDY
     C                     MOVE *DATE     REDAY
     C                     MOVE *DATE     JUTDY8
     C                     Z-ADD0         SHUDY8
     C                     MOVE *DATE     REDAY8
     C                     Z-ADD0         CODED
     C                     MOVEL*BLANK    CUSID
     C                     MOVEL*BLANK    SHICD
     C*
     C                     Z-ADDW#SYMD    CRTD2
     C                     Z-ADDW#SHMS    CRTT2
     C                     MOVELS#USR     USID2
     C                     MOVELS#JOB     JBID2
     C                     MOVELS#PGID    PGID2
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MOV2     BEGSR
     C                     MOVEL'JF'      ZZ0001
     C                     MOVEL' '       ACREC
     C                     Z-ADDWCNT      JUTNO
     C                     Z-ADDWSEQNO    SEQNO
     C                     MOVELCUSNRA    CUSNR
     C                     MOVELW#SHPN    CUSNR
     C*
     C*íSìñâcã∆
     C           ESLSNA    IFNE 0
     C                     Z-ADDESLSNA    SLSNR
     C                     ELSE
     C                     Z-ADDSLSNRA    SLSNR
     C                     ENDIF
     C*
     C                     MOVELORDNOA    ORDNO
     C*
     C                     MOVE *DATE     JUTDY
     C                     Z-ADD0         DETCN
     C                     Z-ADD0         DELCD
     C                     Z-ADD0         W#DELC
     C* äCäO
     C           W#CUS1    IFNE '0'
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     ELSE
     C* çëì‡
     C           DELDYA    IFEQ 0
     C*
     C***        CLOCK     IFLE WKTIME
     C***                  Z-ADDUDATE     DELDY
     C***                  Z-ADD*DATE     DELDY8
     C***                  ELSE
     C*
     C                     EXSR #DELD2
     C                     Z-ADDWDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C*
     C***                  ENDIF
     C*
     C                     ELSE
     C                     MOVE DELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD1         DELCD            î[ä˙éwíË
     C                     Z-ADD1         W#DELC           î[ä˙éwíË
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVEL'A'       A1
     C                     Z-ADD0         A2
     C                     Z-ADD0         A3
     C                     Z-ADD0         A4
     C                     Z-ADDWA5       A5
     C                     Z-ADD0         A6
     C                     Z-ADDORDQUA    QUANT
     C                     Z-ADDWTANKA    TANKA1
     C           TANKA1    MULT QUANT     KINGA
     C*
     C                     MOVEL*BLANK    ITDSC
     C                     MOVELWITDSC    ITDSC
     C*
     C           WELECD    IFNE ' '
     C                     MOVELWELECD    ITDS26
     C                     ELSE
     C*
     C           TOKSSA    IFNE *BLANK
     C                     MOVEL'T'       ITDS26
     C                     MOVELTOKSSA    ITDS30
     C                     ENDIF
     C*ÇrÇdÇsïi
     C           W#TRE1    IFEQ 'S'
     C           W#TRE2    OREQ 'S'
     C                     MOVEL'SET'     ITDS28
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     MOVELWITCOD    ITCOD
     C                     MOVEL*BLANK    DOJNO
     C*
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYN
     C                     ELSE
     C                     Z-ADD1         BUNYN
     C                     ENDIF
     C*
     C***        W#TRE1    IFGE '1'
     C***        W#TRE1    ANDLE'9'
     C           TRESAA    IFGE '1'
     C           TRESAA    ANDLE'99'
     C                     MOVEL'*'       TRACE
     C*
     C           ITDS26    IFEQ 'T'
     C                     ELSE
     C*ÇrÇdÇsïi
     C           W#TRE1    IFEQ 'S'
     C           W#TRE2    OREQ 'S'
     C                     MOVEL'SET'     ITDS28
     C                     ELSE
     C           ITDS26    IFNE '#'
     C           ITDS26    ANDNE'@'
     C                     MOVEL'ƒ⁄ª¬∑'   ITDS23
     C                     ELSE
     C                     MOVEL'ƒ⁄ª¬'    ITDS27
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEL*BLANK    TRACE
     C                     ENDIF
     C*
     C                     Z-ADD0         INVNO
     C                     MOVEL*BLANK    NBNBR
     C                     Z-ADD0         BUMOR
     C                     MOVEL*BLANK    BUNDT
     C                     Z-ADD0         BQUAN
     C                     Z-ADD0         HJQTY
     C                     Z-ADD0         BUNSU
     C                     MOVEL*BLANK    REJUK
     C                     MOVEL*BLANK    SLSND
     C                     Z-ADD0         TKING
     C                     MOVEL*BLANK    SSHUF
     C                     Z-ADD0         HIKIQ
     C                     MOVEL*BLANK    NOFIL
     C                     MOVEL*BLANK    SHPCD
     C                     Z-ADD0         SHUDY
     C                     MOVE *DATE     REDAY
     C                     MOVE *DATE     JUTDY8
     C                     Z-ADD0         SHUDY8
     C                     MOVE *DATE     REDAY8
     C                     Z-ADD0         CODED
     C                     MOVEL*BLANK    CUSID
     C                     MOVEL*BLANK    SHICD
     C*
     C                     Z-ADDW#SYMD    CRTD2
     C                     Z-ADDW#SHMS    CRTT2
     C                     MOVELS#USR     USID2
     C                     MOVELS#JOB     JBID2
     C                     MOVELS#PGID    PGID2
     C*
     C                     MOVEL*BLANK    LCLA2
     C                     MOVEL*BLANK    MCLA2
     C                     MOVEL*BLANK    SCLA2
     C           SEQNO     IFNE 0
     C                     SETOF                     90
     C           ITDS25    CHAINDMR0040              90
     C           *IN90     IFEQ '0'
     C                     MOVELLCLAS     LCLA2
     C                     MOVELMCLAS     MCLA2
     C                     MOVELSCLAS     SCLA2
     C                     ENDIF
     C                     ENDIF
     C*
     C***                  Z-ADDWTANKA    TANKAA
     C***        TANKA1    MULT QUANT     KINGAA
     C*
     C                     Z-ADDWCNT      JUTNOA
     C                     Z-ADDWSEQNO    SEQNOA
     C                     UPDATRAML0081
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MOV3     BEGSR
     C                     MOVEL'ZM'      ZZ0014
     C                     MOVEL' '       ACREC4
     C                     Z-ADDWCNT      JUTNO4
     C                     Z-ADDWSEQNO    SEQNO4
     C                     MOVELWITCOD    ITCOD4
     C                     MOVELWJUTKC    JUTKC4
     C                     Z-ADDQUANT     QUANT4
     C                     Z-ADDWHIKI     QTYRS4
     C                     Z-ADDWMINO     QTYOB4
     C                     Z-ADDW#DELC    DELCD4
     C                     Z-ADD0         DOJNO4
     C*
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYN4
     C                     ELSE
     C                     Z-ADD1         BUNYN4
     C                     ENDIF
     C*
     C                     MOVEL*BLANK    ZZ0044
     C                     MOVEL*BLANK    HIKNB4
     C*
     C                     Z-ADDW#SYMD    CRTD4
     C                     Z-ADDW#SHMS    CRTT4
     C                     MOVELS#USR     USID4
     C                     MOVELS#JOB     JBID4
     C                     MOVELS#PGID    PGID4
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MOV5     BEGSR
     C                     MOVEL'ZM'      ZZ001R
     C                     MOVEL' '       ACRECR
     C                     Z-ADDWCNT      JUTNOR
     C                     Z-ADDWSEQNO    SEQNOR
     C                     MOVELWITNB1    ITCODR
     C                     MOVELWJUTKC    JUTKCR
     C                     Z-ADDQUANT     QUANTR
     C                     Z-ADDWHIKI     QTYRSR
     C                     Z-ADDWMINO     QTYOBR
     C                     Z-ADDW#DELC    DELCDR
     C                     Z-ADD0         DOJNOR
     C*
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYNR
     C                     ELSE
     C                     Z-ADD1         BUNYNR
     C                     ENDIF
     C*
     C                     MOVEL*BLANK    FILLRR
     C                     ENDSR
     C*-------------------------------------------------------
     C           #TR010    BEGSR
     C                     MOVEL*BLANK    P#DELC
     C                     Z-ADD1         P#SELC
     C                     MOVEL*BLANK    P#KOSN
     C                     Z-ADDWCNT      P#JUT4
     C                     Z-ADDWSEQNO    P#SEQ4
     C                     MOVEL*BLANK    P#NBNB
     C                     MOVEL*BLANK    P#NB11
     C                     MOVEL*BLANK    P#NB21
     C                     MOVEL*BLANK    P#NB31
     C                     MOVEL*BLANK    P#NB41
     C                     MOVEL*BLANK    P#NB51
     C                     Z-ADD0         P#DE11
     C                     Z-ADD0         P#DE21
     C                     Z-ADD0         P#DE31
     C                     Z-ADD0         P#DE41
     C                     Z-ADD0         P#DE51
     C                     MOVEL*BLANK    P#RECD
     C                     CALL '@TR0010' PAR010
     C                     ENDSR
     C*-----------------------------------------------------
     C           #D120     BEGSR
     C*
     C                     SETOF                     95
     C           WJUTNO    CHAINDTR0120              95
     C           *IN95     IFEQ '1'
     C*
     C                     MOVEL*BLANK    ACRECV
     C                     Z-ADDWJUTNO    JUTNOV
     C*
     C                     MOVELWJUTNO    JUTN2V
     C                     MOVE WJUTNO    SEQN2V
     C*
     C                     MOVELW#SHPN    SHPNRV           èoâ◊êÊÉRÅ[Éh
     C*
     C                     SETOF                     96
     C           SHPNRV    CHAINDMR0030              96
     C           *IN96     IFEQ '0'
     C                     SELEC
     C           W#CUS1    WHNE '0'
     C                     MOVELAREABK    YUBINV
     C                     MOVELSHPNMF    SHPNMV
     C                     MOVELSHIP1F    SHIP1V
     C                     MOVELSHIP2F    SHIP2V
     C                     MOVELSHTEBK    SHTELV
     C                     MOVEL*BLANK    BUSYOV
     C                     MOVEL*BLANK    BIKO1V
     C                     MOVEL*BLANK    BIKO2V
     C                     Z-ADD0         DUEDYV           ìûíÖó\íËì˙
     C                     Z-ADD0         SAGCDV           ç≤êÏÉRÅ[Éh
     C                     OTHER
     C*
     C* í èÌèoâ◊êÊ
     C* ç≤êÏÉRÅ[ÉhÉuÉâÉìÉN
     C           W#YUBI    IFEQ *BLANK
     C           W#SAGY    ANDEQ0
     C                     MOVELAREABK    YUBINV           óXï÷î‘çÜ
     C                     MOVELSHPNBF    SHPNMV           èoâ◊êÊñº
     C                     MOVELSHP1BF    SHIP1V           èZèäÇP
     C                     MOVELSHP2BF    SHIP2V           èZèäÇQ
     C                     MOVELSHTEBK    SHTELV           ìdòb
     C                     MOVEL*BLANK    BUSYOV           ïîèê
     C                     MOVEL*BLANK    BIKO1V           îıçlÇP
     C                     MOVEL*BLANK    BIKO2V           îıçlÇQ
     C                     Z-ADD0         DUEDYV           ìûíÖó\íËì˙
     C                     Z-ADD0         SAGCDV           ç≤êÏÉRÅ[Éh
     C                     ELSE
     C*
     C                     MOVEL*BLANK    SHPNRV           èoâ◊êÊÉRÅ[Éh
     C*
     C*íºëóèoâ◊êÊ
     C*
     C           W#SAGY    IFEQ 0
     C                     MOVELW#YUBI    YUBINV           óXï÷î‘çÜ
     C                     MOVELW#SHP1    SHPNMV           èoâ◊êÊñº
     C                     MOVELW#SHI1    SHIP1V           èZèäÇP
     C                     MOVELW#SHI2    SHIP2V           èZèäÇQ
     C                     MOVELW#SHTL    SHTELV           ìdòb
     C                     MOVELW#BUSY    BUSYOV           ïîèê
     C                     MOVELW#BIK1    BIKO1V           îıçlÇP
     C                     MOVELW#BIK2    BIKO2V           îıçlÇQ
     C                     Z-ADDW#DUEY    DUEDYV           ìûíÖó\íËì˙
     C                     Z-ADD0         SAGCDV           ç≤êÏÉRÅ[Éh
     C                     ELSE
     C*ç≤êÏâcã∆èäé~Çﬂ
     C*
     C                     SETOF                     90
     C           W#SAGY    CHAINDMR0330              90
     C           *IN90     IFEQ '0'
     C                     MOVELZIPCD3    YUBINV           óXï÷î‘çÜ
     C                     MOVELW#SHP1    SHPNMV           èoâ◊êÊñº
     C                     MOVELW#SHI1    SHIP1V           èZèäÇP
     C                     MOVELW#SHI2    SHIP2V           èZèäÇQ
     C                     MOVELW#SHTL    SHTELV           ìdòb
     C                     MOVELW#BUSY    BUSYOV           ïîèê
     C                     MOVELW#BIK1    BIKO1V           îıçlÇP
     C                     MOVELW#BIK2    BIKO2V           îıçlÇQ
     C                     Z-ADDW#DUEY    DUEDYV           ìûíÖó\íËì˙
     C                     Z-ADDW#SAGY    SAGCDV           ç≤êÏÉRÅ[Éh
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDSL
     C                     ENDIF
     C*
     C                     Z-ADD0         SHKD8V
     C                     Z-ADD0         REDA8V
     C                     Z-ADD0         SHUD8V
     C*
     C                     Z-ADD0         TIMCDV
     C*
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C*
     C*ìdòbî‘çÜâ∫ÇSåÖ---------------------------------
     C                     Z-ADDJUTNOV    P#JUTN
     C                     CALL '@SS4120' PAR200
     C*-------------------------------------------------
     C*
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #TANKA    BEGSR
     C                     Z-ADD0         WTANKA  90
     C                     SELEC
     C           WDCODE    WHEQ 0
     C                     Z-ADDLSTPCK    WTANKA
     C           WDCODE    WHEQ 1
     C                     Z-ADDUPD01K    WTANKA
     C           WDCODE    WHEQ 2
     C                     Z-ADDUPD02K    WTANKA
     C           WDCODE    WHEQ 3
     C                     Z-ADDUPD03K    WTANKA
     C           WDCODE    WHEQ 4
     C                     Z-ADDUPD04K    WTANKA
     C           WDCODE    WHEQ 5
     C                     Z-ADDUPD05K    WTANKA
     C           WDCODE    WHEQ 6
     C                     Z-ADDUPD06K    WTANKA
     C           WDCODE    WHEQ 7
     C                     Z-ADDUPD07K    WTANKA
     C           WDCODE    WHEQ 8
     C                     Z-ADDUPD08K    WTANKA
     C           WDCODE    WHEQ 9
     C                     Z-ADDUPD09K    WTANKA
     C           WDCODE    WHEQ 10
     C                     Z-ADDUPD10K    WTANKA
     C           WDCODE    WHEQ 11
     C                     Z-ADDUPD11K    WTANKA
     C           WDCODE    WHEQ 12
     C                     Z-ADDUPD12K    WTANKA
     C           WDCODE    WHEQ 13
     C                     Z-ADDUPD13K    WTANKA
     C           WDCODE    WHEQ 14
     C                     Z-ADDUPD14K    WTANKA
     C           WDCODE    WHEQ 15
     C                     Z-ADDUPD15K    WTANKA
     C           WDCODE    WHEQ 16
     C                     Z-ADDUPD16K    WTANKA
     C           WDCODE    WHEQ 17
     C                     Z-ADDUPD17K    WTANKA
     C                     ENDSL
     C                     ENDSR
     C*----------------------------------------------------------
     C           #RTN3     BEGSR
     C                     SETOF                     90
     C*
     C***        A1        IFEQ 'E'
     C*
     C                     MOVEA*BLANK    WK1
     C                     MOVEA*BLANK    WK2
     C                     MOVEL'00000000'L      14
     C                     MOVE '000000'  L
     C***        ITDS14    CHAINDTR5170              90
     C***        WWWITN    CHAINDTR5170              90
     C***        *IN90     IFEQ '0'
     C                     MOVEAWITNB1    WK1
     C                     MOVELDESNOB    L
     C***                  MOVEAITDSEB    WK2
     C                     MOVEAITDSJB    WK2
     C***                  ENDIF
     C*
     C                     Z-ADD1         Y       20
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C                     MOVE WK1,Y     WKITD1  1                    +
     C           WKITD1    IFEQ *BLANK                     *********   +
     C                     Z-ADD1         Z       20                   +
     C           Y         ADD  1         Y                            +
     C*                                                                +
     C                     Z-ADD0         FLAG11  10                   +
     C           FLAG11    DOWEQ0                          +++++++     +
     C           Y         IFLE 30                         ***** +     +
     C                     MOVE WK2,Z     WK1,Y                * +     +
     C           Y         ADD  1         Y                    * +     +
     C           Z         ADD  1         Z                    * +     +
     C                     ELSE                            ----* +     +
     C                     MOVEAWK1       WITDSC               * +     +
     C                     Z-ADD0         Z                    * +     +
     C                     Z-ADD0         Y                    * +     +
     C                     Z-ADD1         FLAG11               * +     +
     C                     Z-ADD1         FLAG10               * +     +
     C                     ENDIF                           ***** +     +
     C*                                                          +     +
     C                     ENDDO                           +++++++     +
     C*                                                            *   +
     C                     ELSE                            --------*   +
     C           Y         ADD  1         Y                        *   +
     C                     ENDIF                           *********   +
     C*                                                                +
     C                     ENDDO                           +++++++++++++
     C*
     C                     ENDSR
     C*------------------------------------------------------------
     C*èoâ◊çHèÍê›íË
     C           #SHKA     BEGSR
     C*
     C           *LOVAL    SETLLAML0081
     C                     Z-ADD0         FLAG15  10
     C           FLAG15    DOWEQ0
     C                     SETOF                     70
     C                     READ RAML0081                 70
     C           *IN70     IFEQ '1'
     C                     Z-ADD1         FLAG15
     C                     ELSE
     C*
     C           A1A       IFEQ 'X'
     C***        W#TRE1    IFGE '1'
     C***        W#TRE1    ANDLE'9'
     C           TRESAA    IFGE '1'
     C           TRESAA    ANDLE'99'
     C*
     C*èoâ◊çHèÍåüçı
     C*
     C                     MOVEL*BLANK    W#POST  1
     C*
     C                     Z-ADD1         P#SELE
     C                     MOVELCUSNRA    P#CUSN
     C                     MOVELORDNOA    P#ORDN
     C                     MOVEL*BLANK    P#OFNA
     C                     MOVEL*BLANK    P#POST
     C                     Z-ADD0         P#JUT2
     C                     Z-ADD0         P#SEQ2
     C                     Z-ADD0         P#QUA2
     C                     MOVELTRESAA    P#TRES
     C                     MOVEL*BLANK    P#ITDS
     C                     CALL '@AM0240' PAR100
     C*
     C                     MOVELP#POST    W#POST  1
     C*
     C*ÉgÉåÉTàƒì‡ÉfÅ[É^çÏê¨
     C                     Z-ADD2         P#SELE
     C                     MOVELCUSNRA    P#CUSN
     C                     MOVELORDNOA    P#ORDN
     C                     MOVEL*BLANK    P#OFNA
     C                     MOVEL*BLANK    P#POST
     C                     Z-ADDJUTNOA    P#JUT2
     C                     Z-ADDSEQNOA    P#SEQ2
     C                     Z-ADDORDQUA    P#QUA2
     C                     MOVELTRESAA    P#TRES
     C                     MOVEL*BLANK    P#ITDS
     C                     CALL '@AM0240' PAR100
     C*
     C           W#POST    IFNE *BLANK
     C                     SETOF                     91
     C           JUSENA    CHAINDTR0120              91
     C           *IN91     IFEQ '0'
     C                     MOVELW#POST    SHOCDV
     C                     UPDATRDTR0120
     C                     ENDIF
     C                     ENDIF
     C*
     C           P#ITDS    IFNE *BLANK
     C*ï∂éöóÒëÄçÏÅiïiñºÅj
     C                     MOVEL*BLANK    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL'2'       P#SKBN
     C                     Z-ADD30        P#LENG
     C                     MOVELITNBRA    P#MOJ1
     C                     MOVEL'('       P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ3    ITNBRA
     C*
     C*ï∂éöóÒëÄçÏÅiïiñºÅj
     C                     MOVEL*BLANK    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL'2'       P#SKBN
     C                     Z-ADD30        P#LENG
     C                     MOVELITNBRA    P#MOJ1
     C                     MOVELP#ITDS    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ3    ITNBRA
     C*
     C*ï∂éöóÒëÄçÏÅiïiñºÅj
     C                     MOVEL*BLANK    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL'2'       P#SKBN
     C                     Z-ADD30        P#LENG
     C                     MOVELITNBRA    P#MOJ1
     C                     MOVEL')'       P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ3    ITNBRA
     C*
     C                     UPDATRAML0081
     C*
     C*
     C                     MOVEL*BLANK    WKITDS 25
     C                     MOVELITNBRA    WKITDS
     C                     SETOF                     91
     C           D002A     CHAINDTR0020              91
     C           *IN91     IFEQ '0'
     C***                  MOVELWKITDS    ITDSC
     C                     MOVELITNBRA    ITDSC
     C                     UPDATRDTR0020
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDDO
     C                     ENDSR
     C*------------------------------------------------------------
     C*DTR0540 ìØéûî[ì¸
     C           #DOJ2     BEGSR
     C*
     C                     Z-ADD0         FLAG20  10
     C                     Z-ADD0         W#CNT1  20
     C*
     C           *LOVAL    SETLLAML0081
     C                     Z-ADD0         FLAG15  10
     C           FLAG15    DOWEQ0
     C                     SETOF                     70
     C                     READ RAML0081                 70
     C           *IN70     IFEQ '1'
     C                     Z-ADD1         FLAG15
     C                     ELSE
     C*
     C           A1A       IFNE ' '
     C*
     C           TYKCDA    IFEQ '*'
     C***        W#TRE1    ORGE '1'
     C***        W#TRE1    ANDLE'9'
     C           TRESAA    ORGE '1'
     C           TRESAA    ANDLE'99'
     C           JUTNOA    ANDNE0
     C           W#CNT1    ADD  1         W#CNT1
     C                     ELSE
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDDO
     C                     ENDSR
     C*------------------------------------------------------------
     C*DTR0540 ìØéûî[ì¸ÉNÉäÉA
     C           #DOJ3     BEGSR
     C*
     C                     Z-ADD0         FLAG20  10
     C                     Z-ADD0         W#CNT1  20
     C*
     C           *LOVAL    SETLLAML0081
     C                     Z-ADD0         FLAG15  10
     C           FLAG15    DOWEQ0
     C                     SETOF                     70
     C                     READ RAML0081                 70
     C           *IN70     IFEQ '1'
     C                     Z-ADD1         FLAG15
     C                     ELSE
     C*
     C                     MOVEL*BLANK    TYKCDA
     C                     UPDATRAML0081
     C*
     C*
     C***        W#TRE1    IFGE '1'
     C***        W#TRE1    ANDLE'9'
     C           TRESAA    IFGE '1'
     C           TRESAA    ANDLE'99'
     C           JUTNOA    ANDNE0
     C                     SETOF                     90
     C           D0541     CHAINDTR0020              90
     C           *IN90     IFEQ '0'
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     UPDATRDTR0020
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDDO
     C                     ENDSR
     C*------------------------------------------------------------
     C*DTR0540 ìØéûî[ì¸
     C           #DOJ1     BEGSR
     C*
     C                     Z-ADD0         FLAG20  10
     C*
     C           *LOVAL    SETLLAML0081
     C                     Z-ADD0         FLAG15  10
     C           FLAG15    DOWEQ0
     C                     SETOF                     70
     C                     READ RAML0081                 70
     C*
     C           *IN70     IFEQ '1'
     C                     Z-ADD1         FLAG15
     C                     ELSE
     C*
     C           TYKCDA    IFEQ '*'
     C           JUTNOA    ANDNE0
     C***        W#TRE1    ORGE '1'
     C***        W#TRE1    ANDLE'9'
     C           TRESAA    ORGE '1'
     C           TRESAA    ANDLE'99'
     C           JUTNOA    ANDNE0
     C*
     C*ìØéûî[ì¸NOçÃî‘--
     C           FLAG20    IFEQ 0
     C                     SETOF                     93
     C           2         CHAINNPD1910              93
     C           *IN93     IFEQ '1'
     C                     SETON                     H1
     C                     ELSE
     C                     Z-ADDORDNOX    WDOJNO 100
     C           ORDNOX    ADD  1         ORDNOX
     C                     UPDATRNPD1910
     C                     ENDIF
     C*NOÉ`ÉFÉbÉN
     C           D0540     SETLLDTR0540
     C                     Z-ADD0         FLAG06  10
     C           FLAG06    DOWEQ0
     C                     SETOF                     73
     C                     READ DTR0540                  73
     C           *IN73     IFEQ '1'
     C                     Z-ADD1         FLAG06
     C                     ELSE
     C           DOJNO4    IFEQ WDOJNO
     C                     SETON                     H3
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*
     C                     Z-ADD1         FLAG20
     C                     ENDIF
     C*--
     C                     EXSR #D540
     C*--
     C                     ELSE
     C*
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
     C*----------------------------------------------------------
     C           #D540     BEGSR
     C                     SETOF                     9495
     C           D0540     CHAINDTR0540              94
     C           *IN94     IFEQ '0'
     C                     SETON                     H2
     C                     ELSE
     C*
     C                     MOVEL*BLANK    RECCDX
     C                     MOVEL*BLANK    ACRECX
     C                     Z-ADDWDOJNO    DOJNOX
     C                     Z-ADDJUTNOA    JUTNOX
     C                     Z-ADDSEQNOA    SEQNOX
     C                     MOVELCUSNRA    CUSNRX
     C                     MOVE *DATE     MAKDY4
     C                     MOVE S#USR     W#USR   3
     C                     MOVELW#USR     JOBID4
     C                     MOVEL*BLANK    JOBUP4
     C                     TIME           CRTT14
     C                     MOVELS#PGID    PGID14
     C*
     C                     Z-ADD0         CRTDX4
     C                     Z-ADD0         CRTTX4
     C                     MOVEL*BLANK    USIDX4
     C                     MOVEL*BLANK    JBIDX4
     C                     MOVEL*BLANK    PGIDX4
     C*
     C                     WRITERDTR0540
     C*
     C           D0541     CHAINDTR0020              95
     C           *IN95     IFEQ '0'
     C                     MOVEL'*'       DOJNO
     C*LOG
     C                     Z-ADDW#SYMD    CRTD2
     C                     Z-ADDW#SHMS    CRTT2
     C                     MOVELS#USR     USID2
     C                     MOVELS#JOB     JBID2
     C                     MOVELS#PGID    PGID2
     C*
     C                     UPDATRDTR0020
     C                     ELSE
     C                     SETON                     H9
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #PRT01    BEGSR
     C                     Z-ADD0         MDS     10
     C                     Z-ADD0         FLAG10
     C****                 MOVELTBL01,1   WMAIL  40
     C****       *LOVAL    SETLLAML0041
     C*LIST
     C                     Z-ADD0         FLAG98  10
     C                     MOVEL*BLANK    WKSHI1 60
     C                     MOVEL*BLANK    WKBUSY 62
     C           FLAG98    DOWEQ0
     C                     SETOF                     725051
     C                     SETOF                     525354
     C                     READ RAML0080                 72
     C           *IN72     IFEQ '1'
     C                     Z-ADD1         FLAG98
     C                     ELSE
     C*
     C                     MOVEL*BLANK    WKSHCD  1
     C                     MOVEL*BLANK    W#SNSN  3
     C                     MOVELSLSNRA    W#SNSN
     C                     SETOF                     90
     C           W#SNSN    CHAINAGM0060              90
     C           *IN90     IFEQ '0'
     C                     MOVELMAIL6     WMAIL  40
     C                     ENDIF
     C*
     C           A1A       IFEQ ' '
     C*
     C*ÉGÉâÅ[ÉRÅ[Éh
     C                     SELEC
     C           ERRCDA    WHEQ '01'
     C                     SETON                     50    ë„óùìX
     C           ERRCDA    WHEQ '02'
     C                     SETON                     51    å^éÆ
     C           ERRCDA    WHEQ '03'
     C                     SETON                     52    êîó 
     C           ERRCDA    WHEQ '04'
     C                     SETON                     53    íPâø
     C           ERRCDA    WHEQ '05'
     C                     SETON                     54    ÉgÉãÉNíl
     C                     ENDSL
     C*
     C                     ENDIF
     C                     MOVELMFROMA    WMFROM 30
     C*
     C           MDS       IFEQ 0
     C                     MOVELCUSNRA    W#CUSN
     C                     MOVELORDNOA    W#ORDN
     C*-------------
     C*ë„óùìXñº
     C                     SETOF                     9055
     C           CUSNRA    CHAINDMR0010              90
     C           *IN90     IFEQ '0'
     C                     MOVELSHPNBE    W#SHPM 80
     C                     ELSE
     C                     MOVEL*BLANK    W#SHPM
     C                     ENDIF
     C*
     C                     EXSR #DS120                     èoâ◊êÊ
     C*
     C                     SETON                     55
     C                     EXCPTMIDASI
     C                     SETOF                     55
     C                     Z-ADD1         MDS
     C                     ENDIF
     C*
     C                     EXSR #DR120                     èoâ◊êÊ
     C*------------
     C           WKCUSN    IFEQ W#CUSN
     C           WKSHI1    ANDEQW#SHI1
     C           WKBUSY    ANDEQW#BUSY
     C*
     C   OF                EXCPTMIDASI
     C   OF                SETOF                     OF
     C*
     C                     MOVEL*BLANK    W#NBNB  6
     C                     Z-ADD0         WKQTYR  50
     C                     Z-ADD0         WKQTOB  50
     C                     Z-ADD0         WDELDY
     C                     SETOF                     90
     C           D002A     CHAINDTR0020              90
     C           *IN90     IFEQ '0'
     C                     MOVELNBNBR     W#NBNB
     C                     Z-ADDDELDY8    WDELDY
     C                     MOVELITDSC     W#ITDS
     C*
     C                     EXSR #HIKI
     C*
     C                     EXCPTMEI01
     C                     ELSE
     C*DTR0020Ç…ë∂ç›ÇµÇ»Ç¢
     C                     MOVEL*BLANK    W#NBNB
     C                     Z-ADD0         WDELDY
     C                     MOVELITNBRA    W#ITDS
     C*
     C                     EXCPTMEI01
     C                     ENDIF
     C*
     C                     ELSE
     C*
     C                     MOVELCUSNRA    W#CUSN  5
     C                     MOVELORDNOA    W#ORDN 15
     C*
     C                     EXSR #DS120
     C*-------------
     C                     SETOF                     90
     C           CUSNRA    CHAINDMR0010              90
     C           *IN90     IFEQ '0'
     C                     MOVELSHPNBE    W#SHPM
     C                     ELSE
     C                     MOVEL*BLANK    W#SHPM
     C                     ENDIF
     C*-------------
     C                     EXCPTMIDASI
     C*
     C                     MOVEL*BLANK    W#ITDS 30
     C                     MOVEL*BLANK    W#NBNB  6
     C                     Z-ADD0         WKQTYR  50
     C                     Z-ADD0         WKQTOB  50
     C                     Z-ADD0         WDELDY
     C                     SETOF                     90
     C           D002A     CHAINDTR0020              90
     C           *IN90     IFEQ '0'
     C                     MOVELITDSC     W#ITDS
     C                     MOVELNBNBR     W#NBNB
     C                     Z-ADDDELDY8    WDELDY
     C*
     C                     EXSR #HIKI
     C*
     C                     EXCPTMEI01
     C                     ELSE
     C*
     C                     MOVELITNBRA    W#ITDS
     C                     MOVEL*BLANK    W#NBNB
     C                     Z-ADD0         WDELDY
     C*
     C                     EXCPTMEI01
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*DELETE
     C***        *LOVAL    SETLLAML0041
     C***                  Z-ADD0         FLAG98  10
     C***        FLAG98    DOWEQ0
     C***                  SETOF                     72
     C***                  READ RAML0041                 72
     C***        *IN72     IFEQ '1'
     C***                  Z-ADD1         FLAG98
     C***                  ELSE
     C***                  DELETRAML0041
     C***                  ENDIF
     C***                  ENDDO
     C                     ENDSR
     C*
     C*----------------------------------------------------------
     C           #DR120    BEGSR
     C           CUSNRA    IFNE *BLANK
     C                     SETOF                     91
     C           JUSENA    CHAINDTR0120              91
     C           *IN91     IFEQ '0'
     C                     MOVELCUSNRA    WKCUSN  5
     C                     MOVELSHIP1V    WKSHI1 60
     C                     MOVELBUSYOV    WKBUSY 62
     C                     MOVELSHOCDV    WKSHCD
     C                     ELSE
     C                     MOVELCUSNRA    WKCUSN  5
     C                     MOVELSHIP1A    WKSHI1 60
     C                     MOVELBUSYOA    WKBUSY 62
     C                     MOVEL*BLANK    WKSHCD
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DS120    BEGSR
     C           CUSNRA    IFNE *BLANK
     C                     SETOF                     91
     C           JUSENA    CHAINDTR0120              91
     C           *IN91     IFEQ '0'
     C                     MOVELCUSNRA    WKCUSN
     C                     MOVELSHIP1V    W#SHI1 60
     C                     MOVELBUSYOV    W#BUSY 62
     C                     MOVELSHOCDV    WKSHCD
     C                     ELSE
     C                     MOVELCUSNRA    WKCUSN
     C                     MOVELSHIP1A    W#SHI1 60
     C                     MOVELBUSYOA    W#BUSY 62
     C                     MOVEL*BLANK    WKSHCD
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #HIKI     BEGSR
     C*
     C                     SETOF                     91
     C           D004A     CHAINDTR0040              91
     C           *IN91     IFEQ '0'
     C                     Z-ADDQTYRS4    WKQTYR  50
     C                     Z-ADDQTYOB4    WKQTOB  50
     C                     ELSE
     C                     ENDIF
     C*
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DELDY    BEGSR                           î[ä˙
     C                     Z-ADD0         WDELDY  80
     C                     Z-ADD0         WRRNNO
     C                     SETOF                     90
     C           *DATE     CHAINDTP1110              90
     C           *IN90     IFEQ '0'
     C                     Z-ADDRRNNO     WRRNNO  40
     C                     ENDIF
     C*
     C                     Z-ADD0         CNT1    40
     C           WRRNNO    SETLLDTP1111
     C                     Z-ADD0         FLAG03  10
     C           FLAG03    DOWEQ0
     C                     SETOF                     70
     C                     READ DTP1111                  70
     C           *IN70     IFEQ '1'
     C                     Z-ADD1         FLAG03
     C                     ELSE
     C           THOLID    IFEQ ' '
     C                     ADD  1         CNT1
     C           CNT1      IFEQ 11
     C                     Z-ADDY2YMD     WDELDY  80
     C                     Z-ADD1         FLAG03
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DELD2    BEGSR                           î[ä˙
     C*
     C                     SETOF                     90
     C           W#SYMD    CHAINDTP1110              90
     C           *IN90     IFEQ '0'
     C*
     C*éûçèÅÉÅÅéÛíçí˜êÿéûçè
     C                     TIME           CLOCK   60
     C           CLOCK     IFLE WKTIME
     C*
     C           BIKO1T    IFEQ '*'
     C*---------------------------------------------
     C*óÇì˙âcã∆ì˙
     C                     Z-ADDW#SYMD    P#DAY1
     C                     Z-ADD1         P#DATE
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR080
     C*
     C                     MOVE P#DAY2    WDELDY
     C*---------------------------------------------
     C                     ELSE
     C*íIâµÇµì˙
     C           TANA1T    IFEQ '*'
     C*âcã∆ì˙
     C                     Z-ADDW#SYMD    P#DAY1
     C                     Z-ADD0         P#DATE
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR080
     C*
     C                     MOVE P#DAY2    WDELDY
     C*
     C                     ELSE
     C                     Z-ADD*DATE     WDELDY
     C                     ENDIF
     C                     ENDIF
     C*
     C*éûçèÅÑÅÅí˜êÿéûçè
     C                     ELSE
     C*---------------------------------------------
     C*âcã∆ì˙
     C                     Z-ADDW#SYMD    P#DAY1
     C*íIâµÇµì˙
     C           TANA1T    IFEQ '*'
     C                     Z-ADD0         P#DATE
     C                     ELSE
     C                     Z-ADD1         P#DATE
     C                     ENDIF
     C*
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR080
     C*
     C                     MOVE P#DAY2    WDELDY
     C*
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDSR
     C*------------------------------------------------------------
     C           #HAIT1    BEGSR
     C*<<îrëºêßå‰ÅiâèúÅj>>
     C                     MOVEL'L'       P#SYOK           èàóùãÊï™
     C                     MOVEL'DTR0030' P#OBJF            Ãß≤ŸID
     C                     MOVEL'1'       P#OBJ1            KEY1
     C                     MOVEL*BLANK    P#OBJ2            KEY2
     C                     MOVEL*BLANK    P#OBJ3            KEY3
     C                     MOVEL*BLANK    P#OBJ4            KEY4
     C                     MOVEL*BLANK    P#OBJ5            KEY5
     C                     MOVELS#PGID    P#CRTP            Ãﬂ€∏ﬁ◊—ID
     C                     MOVELS#USR     P#USID            ’∞ªﬁ∞ID
     C                     MOVELS#JOB     P#JBID            ºﬁÆÃﬁID
     C                     MOVEL*BLANK    P#RTN2            ÿ¿∞›∫∞ƒﬁ
     C                     CALL '@SB030R' PAR060
     C                     ENDSR
     C*-----------------------------------------------------
     C           #HAIT2    BEGSR
     C*<<îrëºêßå‰ÅiâèúÅj>>
     C                     MOVEL'U'       P#SYOK           èàóùãÊï™
     C                     MOVEL'DTR0030' P#OBJF            Ãß≤ŸID
     C                     MOVEL'1'       P#OBJ1            KEY1
     C                     MOVEL*BLANK    P#OBJ2            KEY2
     C                     MOVEL*BLANK    P#OBJ3            KEY3
     C                     MOVEL*BLANK    P#OBJ4            KEY4
     C                     MOVEL*BLANK    P#OBJ5            KEY5
     C                     MOVELS#PGID    P#CRTP            Ãﬂ€∏ﬁ◊—ID
     C                     MOVELS#USR     P#USID            ’∞ªﬁ∞ID
     C                     MOVELS#JOB     P#JBID            ºﬁÆÃﬁID
     C                     MOVEL*BLANK    P#RTN2            ÿ¿∞›∫∞ƒﬁ
     C                     CALL '@SB030R' PAR060
     C                     ENDSR
     C*-----------------------------------------------------
     C* ƒŸ∏æØƒ
     C           #RTN4     BEGSR
     C                     MOVELTOKSSA    WTOKSS 11
     C                     MOVELTOTAMA    WTOTAM  1
     C           TOKSSA    IFNE *BLANK
     C                     SETOF                     90
     C*
     C                     MOVEA*BLANK    WK3
     C                     MOVEA*BLANK    WK4
     C                     MOVEATOKSSA    WK3
     C*
     C           WK3,1     IFEQ *BLANK
     C                     MOVEAWK3       WK4
     C                     ELSE
     C*
     C                     Z-ADD1         Y
     C                     Z-ADD1         Z
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C           WK3,Y     IFEQ *BLANK                     *********   +
     C           Y         ORGT 11                         *********   +
     C           Y         SUB  1         Y
     C           12        SUB  Y         Z
     C*
     C           Z         IFEQ 0
     C                     Z-ADD1         Z
     C                     ENDIF
     C*
     C                     MOVEAWK3       WK4,Z
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C           Y         ADD  1         Y
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEA*BLANK    WK3
     C                     MOVEA*BLANK    WK4
     C                     ENDIF
     C                     ENDSR
     C* ƒŸ∏æØƒ
     C***        #RTN5     BEGSR
     C***                  MOVEL*BLANK    W#TOK1  6
     C**                   MOVEL*BLANK    W#TOK2  6
     C***                  Z-ADD0         W#TOK3  90
     C***                  Z-ADD0         W#TOK4  90
     C***                  Z-ADD0         W#TOK5  93
     C***                  Z-ADD0         W#TOK6  93
     C***        TOKSSA    IFNE *BLANK
     C***                  SETOF                     90
     C*
     C***                  MOVEA*BLANK    WT1
     C***                  MOVEA*BLANK    WT2              êÆêî
     C***                  MOVEA*BLANK    WT3
     C***                  MOVEA*BLANK    WT4              è¨êî
     C*
     C***                  MOVEATOKSSA    WT1
     C*
     C***        '.'       SCAN WTOKSS    W       10
     C*
     C***        WT1,1     IFEQ *BLANK
     C***                  MOVEAWT1       WK4
     C***                  ELSE
     C*
     C***                  Z-ADD1         Y
     C***                  Z-ADD1         Z
     C***                  Z-ADD0         FLAG10  10
     C***        FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C***        WT1,Y     IFEQ *BLANK                     *********   +
     C***        WT1,Y     OREQ '.'                        *********   +
     C***        Y         ORGT 6                          *********   +
     C***        Y         SUB  1         Y
     C***        7         SUB  Y         Z
     C*
     C***        Z         IFEQ 0
     C***                  Z-ADD1         Z
     C***                  ENDIF
     C*
     C***                  MOVEAWT1       WT2,Z
     C***                  Z-ADD1         FLAG10
     C***                  ELSE
     C***        Y         ADD  1         Y
     C***                  ENDIF
     C***                  ENDDO
     C*
     C***                  ENDIF
     C*
     C***        W         IFNE 0
     C*
     C***        W         ADD  1         Y
     C***                  Z-ADD1         Z
     C***                  Z-ADD0         FLAG10  10
     C***        FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C***        WT1,Y     IFEQ *BLANK                     *********   +
     C*
     C***        Z         IFEQ 0
     C***                  Z-ADD1         Z
     C***                  ENDIF
     C*
     C***                  Z-ADD1         FLAG10
     C***                  ELSE
     C***                  MOVEAWT1,Y     WT3,Z
     C***        Y         ADD  1         Y
     C***        Z         ADD  1         Z
     C***                  ENDIF
     C***                  ENDDO
     C*--------------------------------
     C***                  Z-ADD1         Y
     C***                  Z-ADD1         Z
     C***                  Z-ADD0         FLAG10  10
     C***        FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C***        WT3,Y     IFEQ *BLANK                     *********   +
     C***        WT1,Y     OREQ '.'                        *********   +
     C***        Y         ORGT 6                          *********   +
     C***        Y         SUB  1         Y
     C***        7         SUB  Y         Z
     C*
     C***        Z         IFEQ 0
     C***                  Z-ADD1         Z
     C***                  ENDIF
     C*
     C***                  MOVEAWT3       WT4,Z
     C***                  Z-ADD1         FLAG10
     C***                  ELSE
     C***        Y         ADD  1         Y
     C***                  ENDIF
     C***                  ENDDO
     C*
     C***                  ENDIF
     C*
     C***                  MOVEAWT2       W#TOK1
     C***                  MOVEAWT4       W#TOK2
     C***                  MOVE W#TOK1    W#TOK3
     C***                  MOVE W#TOK2    W#TOK4
     C*
     C**                   SELEC
     C**         W#TOK4    WHGE 1
     C**         W#TOK4    ANDLT10
     C**         W#TOK4    DIV  10        W#TOK6
     C**         W#TOK4    WHGE 10
     C**         W#TOK4    ANDLT100
     C**         W#TOK4    DIV  100       W#TOK6
     C**         W#TOK4    WHGE 100
     C**         W#TOK4    ANDLT1000
     C**         W#TOK4    DIV  1000      W#TOK6
     C**                   ENDSL
     C*
     C**         W#TOK3    ADD  W#TOK6    W#TOK5
     C*
     C**                   ELSE
     C**                   MOVEA*BLANK    WT1
     C**                   MOVEA*BLANK    WT2
     C**                   MOVEA*BLANK    WT3
     C**                   MOVEA*BLANK    WT4
     C**                   ENDIF
     C**                   ENDSR
     C*-----------------------------------------------------
     OQSYSPRT E  101           MIDASI
     O                 55      WMAIL     40
     O***                      WMFROM    71
     O                         UDATE     80
     O                         CLOCK     86
     O                                  123 'ÉGÉâÅ[ï\ãLà”ñ°'
     O        E  1             MIDASI
     O                         CUSNRA     5
     O                         W#SHPM    85
     O                         UDATE Y   90
     O                         CLOCK    100 '  :  :  '
     O                                  115 'C:å⁄ãq'
     O                                  124 'P:å^éÆ'
     O                                  133 'Q:êîó '
     O                                  142 'K:íPâø'
     O                                  149 'T:ƒŸ∏'
     O        E  1             MIDASI
     O                         SHPNMA    60
     O                         YUBINA    72
     O                         SHIP1A   144
     O        E  1             MIDASI
     O                         SHIP2A    70
     O                         BUSYOA   144
     O                         SHTELA   160
     O        E  1             MIDASI
     O                         BIKO1A    72
     O                         BIKO2A   146
     O                         DUEDYA   158 '    /  /  '
     O                         SAGCDA4  164
     O        E  1             MIDASI
     O                                    8 'éÛíç'
     O                                   17 'íçï∂NO '
     O                                   31 'å^éÆ'
     O                                   63 'êîó '
     O                                   72 'íPâø'
     O                                   82 'ã‡äz'
     O                                   89 'à¯'
     O                                   96 'ñ¢'
     O                                  122 'ÉgÉãÉNíl'
     O                                  129 'íPà '
     O                                  138 'âcã∆'
     O                                  144 'ìØ'
     O        E  1             MEI01
     O                         JUTNOA     6
     O                         SEQNOA     8
     O                         ORDNOA    24
     O                         W#ITDS    55
     O                         ORDQUA4   63
     O                         TANKAA4   71
     O                         KINGAA4   81
     O                         SLSNRA    86
     O                         A1A       88
     O                         WKQTYR4   88
     O                         WKQTOB4   94
     O                         WDELDYY  106
     O                         WKSHCD   108
     O                 50               113 'C¥◊∞'
     O                 51               113 'P¥◊∞'
     O                 52               113 'Q¥◊∞'
     O                 53               113 'K¥◊∞'
     O                 54               113 'T¥◊∞'
     O                         TOKSSA   125
     O                         TOTAMA   127
     O                         W#NBNB   134
     O                         ESLSNA4  138
     O                         TRESAA   141
     O                         TYKCDA   143
** TBL01< ∫œ›ƒﬁ∂ﬁ≤¿ﬁ›Ω >
MAIL_ORDER_PROCESSED@TOHNICHI.CO.JP
1Ã∏€    ∫≤ÿ§    Ã∏€√ ≤
