0001 H            Y                                                       TR0150
0002 F*  00   USED TO CONDITION FIRST TIME PASS THROUGH RPG CALC CYCLE  * TR0150
0003 F*  00   SET ON IF ERROR DURING READ FROM THE WORK STATION         * TR0150
0004 FNA047JFMCF  F     500            WORKSTN                            TR0150
0008 F                                              KSLN   SLN            TR0150
0009 FDMR0010 IF  F     704 05AI     4 DISK                               TR0150
0010 FDMR0020 IF  F      64 03AI     4 DISK                               TR0150
0011 FDMR0030 IF  F     457 05AI     4 DISK                               TR0150
0012 FDMR0040 IF  F     313 25AI     4 DISK                               TR0150
     FDMR0171 IF  E           K        DISK                               TR0150
     FDMR0320 IF  E           K        DISK                               TR0150
     FDMR0330 IF  E           K        DISK                               TR0150
     FDMR0390 IF  E           K        DISK                               TR0150
0013 FDTR0010 UF  F     128 14AI     4 DISK                               TR0150
0014 FDTR0020 UF  F     280 08AI     4 DISK                      A        TR0150
0015 FDTR0030 UF  F      32 01AI     4 DISK                               TR0150
0016 FDTR0040 IF  F     193 08AI     4 DISK                      A        TR0150
0017 FDTR0050 UF  F     469 06AI     4 DISK                      A        TR0150
0018 FDTR0060 UF  F      32 01AI     4 DISK                               TR0150
0019 FDTR0070 IF  F     221 08AI     4 DISK                      A        TR0150
0020 FDTP1110 IF  F      36 08AI     4 DISK                               TR0150
     FDTR5170 IF  E           K        DISK                               TR0150
     FDTR5178 IF  E           K        DISK                               TR0150
     F            RDTR5170                          KRENAMERDTR5178
     FNPR0100 IF  E           K        DISK                               TR0150
     FDMP0100 IF  E           K        DISK                               TR0150
0021 FDTR0020LIF  F     233 08AI     4 DISK                               TR0150
0022 FDTR0070LIF  F     169 08AI     4 DISK                               TR0150
0022 FDTR0058 IF  E           K        DISK                               TR0150
     F            RDTR0050                          KRENAMERDTR0058
0022 FDKK0380 UF  E           K        DISK                      A        TR0150
0022 FDMR0070 IF  E           K        DISK                               TR0150
0022 F*TR001M UF  E           K        DISK                               TR0150
0022 FDTR2060XIF  E           K        DISK                               TR0150
     F            RDTR2060X                         KRENAMERDTR2060
0022 FDTR0120 IF  E           K        DISK                      A        TR0150
0022 FDTR9100 IF  E           K        DISK                               TR0150
     F* º“∑ÿºﬁ∫∏ F
0022 FDTR9900 IF  E           K        DISK                               TR0150
     FNA047CFMCF  E                    WORKSTN
0023 FQSYSPRT O   F     198     OF     PRINTER                            TR0150
     E*----------------------------------------------------------------
     E*                   îzÅ@óÒÅ@íËÅ@ã`                            *
     E*----------------------------------------------------------------
     E                    TBL01   1   2 50
     E                    WK1        30  1
     E                    WK2        30  1
     E                    WK3        11  1
     E                    WK4        11  1
     E*
     E                    WT1         7  1
     E                    WT2         7  1
     E                    WT3         7  1
     E                    WT4         7  1
     IRDTR5170
     I              ACREC                           ACRECA
     IRDTR5178
     I              ACREC                           ACRECB
0025 INA047JFMNS  01   1 C                                                TR0150
0026 I* FORMAT- GAMEN1                                                    TR0150
     I        NS  02   1 C1                                               TR0150
0028 I                                     00020004 CUNR12                TR0150
0029 I                                     000500060CUNR22                TR0150
0030 I                                        2   6 CUSNR2                TR0150
0031 I* FORMAT- GAMEN2                                                    TR0150
0032 I        NS  03   1 C2                                               TR0150
0033 I                                     00020006 SHPNR3                TR0150
0034 I                                     00070021 ORDNO3                TR0150
0035 I                                     00220022 DOJCD3                TR0150
0036 I                                     002300250SLSNR3                TR0150
0036 I                                     00260031 CUSID3                TR0150
0037 I* FORMAT- GAMEN3                                                    TR0150
0038 I        NS  04   1 C3                                               TR0150
0039 I* FORMAT- GAMEN4                                                    TR0150
0040 I* FORMAT- GAMEN5                                                    TR0150
0041 I        NS  05   1 C4                                               TR0150
0042 I                                     00020002 INPN15                TR0150
0043 I                                     000300030INPN25                TR0150
0044 I* FORMAT- GAMEN6                                                    TR0150
0045 I        NS  06   1 C5                                               TR0150
0046 I                                     000200020BUNYN6                TR0150
0047 I                                     000300030DELCD6                TR0150
0048 I                                     000400090DELDY6                TR0150
0048 I                                     001000150REDY86                TR0150
0048 I                                     001600160SHCCD6                TR0150
0049 I* FORMAT- GAMEN7                                                    TR0150
0050 I        NS  07   1 C6                                               TR0150
0051 I                                        2  26 ITNB17                TR0150
0051 I                                        2  15 ITNB47                TR0150
0052 I                                     00020031 ITNBR7                TR0150
0053 I                                     003200360QUANT7                TR0150
     I                                     00370038 GTRACE                TR0150
     I                                     00390049 TOKSS7
     I                                     00500050 TOTAM7
     I                                     00510052 CODE17
     I                                     00530053 SHICD7
     I                                     00540054 GSAKS7
     I                                     00550059 GLCLA7
     I                                     00600064 GSCLA7
0054 I* FORMAT- GAMEN8                                                    TR0150
0055 I        NS  08   1 C7                                               TR0150
0056 I                                     000200080TANKA8                TR0150
0057 I                                     000900170KINGA8                TR0150
0058 I                                     001800180INPNM8                TR0150
0058 I                                     00190019 GSEBA8                TR0150
     I                                     00200020 AIRCD8                TR0150
0058 I                                     00210021 INPN28                TR0150
0059 I* FORMAT- GAMEN9                                                    TR0150
0060 I        NS  09   1 C8                                               TR0150
0061 I* FORMAT- GAMEN10                                                   TR0150
0062 I        NS  10   1 C9                                               TR0150
0063 I                                        2  26 ITNB1A                TR0150
0064 I                                     00020031 ITNBRA                TR0150
0065 I                                     003200360QUANTA                TR0150
     I                                     00370038 CODE1A
     I                                     00390039 SHICDA
     I*                                    00390039 GSEBAA
     I                                     00400045 NBNBRA
0066 I* FORMAT- GAMEN11                                                   TR0150
0067 I        NS  11   1 CA                                               TR0150
0068 I                                        2   80TANKAB                TR0150
0069 I                                        9  170KINGAB                TR0150
0070 I* FORMAT- GAMEN12                                                   TR0150
0071 I        NS  12   1 CB                                               TR0150
0072 I* FORMAT- GAMEN13                                                   TR0150
0073 I        NS  13   1 CC                                               TR0150
0074 I                                     000200020SIKYNC                TR0150
0075 I                                     000300030SISACC                TR0150
0076 I                                     000400090DELEVC                TR0150
0076 I                                     000400050WDEL                  TR0150
0077 I                                     001000140MITSUC                TR0150
0078 I                                     001500150ZUMENC                TR0150
0079 I                                     001600160SIYTEC                TR0150
0080 I                                     001700170TORSIC                TR0150
0081 I                                     00180024 TORQUC                TR0150
0082 I                                     002500250KENSAC                TR0150
0083 I                                     002600260ZAISIC                TR0150
0084 I                                     002700330BAIKAC                TR0150
0085 I                                     00340063 USERNC                TR0150
0086 I                                     006400640HOSIKC                TR0150
0087 I                                     0065  89 KATA1C                TR0150
0088 I                                       90  940QUAN1C                TR0150
0089 I                                       95 102 KIBA1C                TR0150
0090 I                                      103 127 KATA2C                TR0150
0091 I                                      128 1320QUAN2C                TR0150
0092 I                                      133 140 KIBA2C                TR0150
0093 I                                      141 165 KATA3C                TR0150
0094 I                                      166 1700QUAN3C                TR0150
0095 I                                      171 178 KIBA3C                TR0150
0096 I                                      179 203 KATA4C                TR0150
0097 I                                      204 2080QUAN4C                TR0150
0098 I                                      209 216 KIBA4C                TR0150
0099 I                                      217 241 KATA5C                TR0150
0100 I                                      242 2460QUAN5C                TR0150
0101 I                                      247 254 KIBA5C                TR0150
0102 I                                      255 2630STPRIC                TR0150
0102 I                                      264 264 GBUKUM                TR0150
0102 I                                      265 265 GUNDED                TR0150
0103 I* FORMAT- GAMEN14                                                   TR0150
0104 I        NS  14   1 CD                                               TR0150
0105 I                                     00020026 ITNBRD                TR0150
0106 I                                     002700310QUANTD                TR0150
0107 I* FORMAT- GAMEN15                                                   TR0150
0108 I* FORMAT- GAMEN16                                                   TR0150
0109 I        NS  15   1 CE                                               TR0150
0110 I                                     000200020KETYNE                TR0150
0111 I* FORMAT- GAMEN17                                                   TR0150
0112 I        NS  16   1 CF                                               TR0150
0113 I                                     000200090INPN1F                TR0150
0114 I                                        8   90INP11F                TR0150
0115 I                                     001000170INPN2F                TR0150
0116 I                                       16  170INP22F                TR0150
0117 I                                     001800250INPN3F                TR0150
0118 I                                       24  250INP33F                TR0150
0119 I                                     002600330INPN4F                TR0150
 120 I                                       32  330INP44F                TR0150
0121 I                                     003400410INPN5F                TR0150
0122 I                                       40  410INP55F                TR0150
0123 I                                     004200490INPN6F                TR0150
0124 I                                       48  490INP66F                TR0150
0125 IDMR0010 NS  18   1 CT   2 CM                                        TR0150
0126 I                                        3   3 ACRECG                TR0150
     I                                        4   8 CUSNRG                TR0150
0128 I                                        9  48 CUSNMG                TR0150
0129 I                                       49  53 SHPNRG                TR0150
0130 I                                       54  570AREADG                TR0150
0131 I                                       58  97 CUSA1G                TR0150
0132 I                                       98 137 CUSA2G                TR0150
0133 I                                      138 142 AREACG                TR0150
0134 I                                      143 157 PHONEG                TR0150
0135 I                                      158 1600SLNR1G                TR0150
0136 I                                      161 1630SLBR1G                TR0150
0137 I                                      164 1660SLNR2G                TR0150
0138 I                                      167 1690SLBR2G                TR0150
0139 I                                      170 1720SLNR3G                TR0150
0140 I                                      173 1750SLBR3G                TR0150
0141 I                                    P 176 1810CRLAMG                TR0150
0142 I                                      182 1830DCODEG                TR0150
0143 I                                      184 1850CLSCDG                TR0150
0144 I                                      186 1870SIHCDG                TR0150
0145 I                                      188 1900TESITG                TR0150
0146 I                                      191 1910SMTCDG                TR0150
0147 I                                      192 194 KEITSG                TR0150
0148 I                                      195 197 TATEAG                TR0150
0149 I                                      198 200 TATESG                TR0150
0150 I                                      201 215 SIMUAG                TR0150
0151 I                                      216 230 SIMUSG                TR0150
0152 I                                      231 233 KESAIG                TR0150
0153 I                                      234 2360USDAYG                TR0150
0154 I                                      237 261 USANSG                TR0150
0155 I                                      262 266 OTSUAG                TR0150
0156 I                                      267 271 OTSUSG                TR0150
0157 I                                      272 291 TELEXG                TR0150
0158 I                                      292 331 BANNMG                TR0150
0159 I                                      332 371 BAAR1G                TR0150
0160 I                                      372 411 BAAR2G                TR0150
0161 I                                      412 419 BAYCDG                TR0150
0162 I                                      420 429 OPPNOG                TR0150
0163 I                                      430 469 INSNMG                TR0150
0164 I                                      470 509 INAR1G                TR0150
0165 I                                      510 549 INAR2G                TR0150
0166 I                                      550 589 NOTPTG                TR0150
0167 I                                      590 629 NOAR1G                TR0150
0168 I                                      630 669 NOAR2G                TR0150
0169 I                                      670 6700INTERG                TR0150
0170 I                                      693 6980MATIMG                TR0150
0171 I                                      699 7040MADAYG                TR0150
0172 I        NS  19                                                      TR0150
0173 IDMR0020 NS  20   1 CH   2 CM                                        TR0150
0174 I                                        3   3 ACRECH                TR0150
0175 I                                        4   60SLSNRH                TR0150
0176 I                                        7  26 SLSNMH                TR0150
0177 I                                       27  280YAKCDH                TR0150
0178 I                                       53  580MATIMH                TR0150
0179 I                                       59  640MADAYH                TR0150
0180 I        NS  21                                                      TR0150
0181 IDMR0030 NS  22   1 CS   2 CM                                        TR0150
0182 I                                        3   3 ACRECI                TR0150
0183 I                                        4   8 SHPNRI                TR0150
0184 I                                        9  48 SHPNMI                TR0150
0185 I                                       49  88 SHIP1I                TR0150
0186 I                                       89 128 SHIP2I                TR0150
0187 I                                      129 133 AREASI                TR0150
0188 I                                      181 1860MATIMI                TR0150
0189 I                                      187 1920MADAYI                TR0150
0189 I                                      193 272 SHPNMB                TR0150
0189 I                                      273 352 SHIP1B                TR0150
0189 I                                      353 432 SHIP2B                TR0150
0189 I                                      433 442 AREASB                TR0150
0189 I                                      443 457 SHTELB                TR0150
0190 I        NS  23                                                      TR0150
0191 IDMR0040 NS  24   1 CI   2 CM                                        TR0150
0192 I                                        3   3 ACRECJ                TR0150
0193 I                                        4  28 ITNBRJ                TR0150
0194 I                                       29  53 ITDSCJ                TR0150
0195 I                                       54  670ITCODJ                TR0150
0196 I                                    P  68  720LSTPCJ                TR0150
0197 I                                    P  73  770UPD01J                TR0150
0198 I                                    P  78  820UPD02J                TR0150
0199 I                                    P  83  870UPD03J                TR0150
0200 I                                    P  88  920UPD04J                TR0150
0201 I                                    P  93  970UPD05J                TR0150
0202 I                                    P  98 1020UPD06J                TR0150
0203 I                                    P 103 1070UPD07J                TR0150
0204 I                                    P 108 1120UPD08J                TR0150
0205 I                                    P 113 1170UPD09J                TR0150
0206 I                                    P 118 1220UPD10J                TR0150
0207 I                                    P 123 1260LENGTJ                TR0150
0208 I                                    P 127 1300LENGWJ                TR0150
0209 I                                    P 131 1340LENGHJ                TR0150
0210 I                                    P 135 1382WEIGHJ                TR0150
0211 I                                      139 1390SIKOMJ                TR0150
0212 I                                      140 1410PRIBLJ                TR0150
0213 I                                      142 142 LPOSTJ                TR0150
     I                                    P 143 1470UPD11J
     I                                    P 148 1520UPD12J
     I                                    P 153 1570UPD13J
     I                                    P 158 1620UPD14J
     I                                    P 163 1670UPD15J
     I                                    P 168 1720UPD16J
     I                                    P 173 1770UPD17J
     I                                      178 180 ZZ0178
0214 I                                      181 1860MATIMJ                TR0150
0215 I                                      187 1920MADAYJ                TR0150
0214 I                                      193 193 GENCDJ                TR0150
0215 I                                      226 226 ELECDJ                TR0150
0215 I                                      227 227 REJETJ                TR0150
     I                                      241 241 BEACDJ                TR0150
     I                                      242 246 LCLASJ                TR0150
     I                                      252 256 SCLASJ                TR0150
     I                                      287 2953UPPERJ                TR0150
     I                                      296 3043LOWERJ                TR0150
     I                                      305 305 TOTAMJ                TR0150
     I                                      306 3110BOXPRJ                TR0150
     I                                      312 3130EXPANJ                TR0150
0216 I        NS  25                                                      TR0150
0217 IDTR0010 NS  26   1 CI   2 CZ   3NCD                                 TR0150
0218 I                                        4  17 ITCODK                TR0150
0219 I                                    P  18  210QTYOOK                TR0150
0220 I                                    P  22  250QTYOHK                TR0150
0221 I                                    P  26  290QTYRSK                TR0150
0222 I                                    P  30  330QTYRDK                TR0150
0223 I                                    P  34  370QTYRRK                TR0150
0224 I                                    P  38  410QTYRMK                TR0150
0225 I                                    P  42  450QTYRTK                TR0150
0226 I                                    P  46  490QTYOBK                TR0150
     I                                    P  50  530QTYORK                TR0150
0228 I                                    P  54  570QTYOMK                TR0150
0229 I                                    P  58  610QTYOTK                TR0150
0230 I                                    P  62  650QTSOSK                TR0150
0231 I                                    P  66  690NOSTKK                TR0150
0232 I                                    P  70  730YOSTKK                TR0150
0233 I                                      104 128 ITNBRK                TR0150
0234 I        NS  27                                                      TR0150
0235 IDTR0020 NS  28   1 CJ   2 CF   3NCD                                 TR0150
0236 I                                        4   90JUTNOL                TR0150
0237 I                                       10  110SEQNOL                TR0150
0238 I                                        4  110JUSENL                TR0150
0239 I                                       12  16 CUSNRL                TR0150
0240 I                                       17  21 SHPNRL                TR0150
0241 I                                       22  240SLSNRL                TR0150
0242 I                                       25  39 ORDNOL                TR0150
0243 I                                       40  450JUTDYL                TR0150
0244 I                                       46  460DELCDL                TR0150
0245 I                                       47  520DELDYL                TR0150
0246 I                                       53  540DETCNL                TR0150
0247 I                                       55  60 JUTKCL                TR0150
0248 I                                    P  61  630QUANTL                TR0150
0249 I                                    P  64  670TANKAL                TR0150
0250 I                                    P  68  720KINGAL                TR0150
0251 I                                       73 102 ITDSCL                TR0150
0252 I                                      103 116 ITCODL                TR0150
0253 I                                      117 117 DOJNOL                TR0150
0254 I                                      118 1180BUNYNL                TR0150
0255 I                                      119 1230INVNOL                TR0150
0256 I                                      124 129 SSAKBL                TR0150
0257 I                                      130 1370BUMORL                TR0150
0258 I                                      138 1380BUNDTL                TR0150
0259 I                                    P 139 1410BQUANL                TR0150
0260 I                                    P 142 1440HJQTYL                TR0150
0261 I                                      145 1460BUNSUL                TR0150
0262 I                                      147 152 REJUKL                TR0150
0263 I                                      187 1920REDAYL                TR0150
0261 I                                      193 2000JUTD8L                TR0150
0262 I                                      201 2080DELD8L                TR0150
0263 I                                      209 2160SHUD8L                TR0150
0263 I                                      217 2240REDA8L                TR0150
0263 I                                      225 2260CODE1L                TR0150
0263 I                                      227 232 CUSIDL                TR0150
0263 I                                      223 233 SHICDL                TR0150
     I                                      234 2410CRTD2L                TR0150
     I                                      242 2470CRTT2L                TR0150
     I                                      248 251 USID2L                TR0150
     I                                      252 255 JBID2L                TR0150
     I                                      256 265 PGID2L                TR0150
     I                                      266 270 LCLA2L                TR0150
     I                                      271 275 MCLA2L                TR0150
     I                                      276 280 SCLA2L                TR0150
0264 I        NS  29                                                      TR0150
0265 IDTR0030 NS  30   1 CJ   2 CC   3NCD                                 TR0150
0266 I                                        4   40JCKEYM                TR0150
0267 I                                        5  100JCCNTM                TR0150
0268 I        NS  31                                                      TR0150
0269 IDTR0040 NS  32   1 CZ   2 CM   3NCD                                 TR0150
     I                                        4   90JUTNON                TR0150
     I                                       10  110SEQNON                TR0150
     I                                        4  110JUSENN                TR0150
     I                                       12  250ITCODN                TR0150
     I                                       26  31 JUTKCN                TR0150
     I                                    P  32  340QUANTN                TR0150
     I                                    P  35  370QTYRSN                TR0150
     I                                    P  38  400QTYOBN                TR0150
     I                                       41  410DELCDN                TR0150
     I                                       42  420DOJNON                TR0150
     I                                       43  430BUNYNN                TR0150
     I                                       97 1040CRTD4N                TR0150
     I                                      105 1100CRTT4N                TR0150
     I                                      111 114 USID4N                TR0150
     I                                      115 118 JBID4N                TR0150
     I                                      119 128 PGID4N                TR0150
     I                                      129 134 SAK41N                TR0150
     I                                      135 140 SAK42N                TR0150
     I                                      141 146 SAK43N                TR0150
     I                                      147 152 SAK44N                TR0150
     I                                      153 158 SAK45N                TR0150
     I                                      159 1650SRY41N                TR0150
     I                                      166 1720SRY42N                TR0150
     I                                      173 1790SRY43N                TR0150
     I                                      180 1860SRY44N                TR0150
     I                                      187 1930SRY45N                TR0150
0281 I        NS  33                                                      TR0150
0282 IDTR0050 NS  34   1 CS   2 CF   3NCD                                 TR0150
0283 I                                        4   9 NBNBRO                TR0150
0284 I                                       10  39 ITDSCO                TR0150
0285 I                                    P  40  420QUANTO                TR0150
0286 I                                    P  43  460TANKAO                TR0150
0287 I                                    P  47  510KINGAO                TR0150
0288 I                                       52  590JUTNOO                TR0150
0289 I                                       60  64 CUSNRO                TR0150
0290 I                                       65  650SIKYNO                TR0150
0291 I                                       66  71 JUTKCO                TR0150
0292 I                                       72  730DETCNO                TR0150
0293 I                                       74  740SISACO                TR0150
0294 I                                       75  800DELEVO                TR0150
0295 I                                       81  850MITSUO                TR0150
0296 I                                       86  860ZUMENO                TR0150
0297 I                                       87  870SIYTEO                TR0150
0298 I                                       88  880TORSIO                TR0150
0299 I                                       89  95 TORQUO                TR0150
0300 I                                       96  960KENSAO                TR0150
0301 I                                       97  970ZAISIO                TR0150
0302 I                                       98  980HOSIKO                TR0150
0303 I                                       99 123 KATA1O                TR0150
0304 I                                    P 124 1260QUAN1O                TR0150
0305 I                                      127 134 KIBA1O                TR0150
0306 I                                      135 159 KATA2O                TR0150
0307 I                                    P 160 1620QUAN2O                TR0150
0308 I                                      163 170 KIBA2O                TR0150
0309 I                                      171 195 KATA3O                TR0150
0310 I                                    P 196 1980QUAN3O                TR0150
0311 I                                      199 206 KIBA3O                TR0150
0312 I                                      207 231 KATA4O                TR0150
0313 I                                    P 232 2340QUAN4O                TR0150
0314 I                                      235 242 KIBA4O                TR0150
0315 I                                      243 267 KATA5O                TR0150
0316 I                                    P 268 2700QUAN5O                TR0150
0317 I                                      271 278 KIBA5O                TR0150
0318 I                                    P 279 2820BAIKAO                TR0150
0319 I                                      283 312 USERNO                TR0150
     I*
0319 I                                      315 3200SEHADO                TR0150
0319 I                                      321 3220NSEQNO                TR0150
0319 I                                      323 3270OUTQUO                TR0150
0319 I                                      328 3320OWQUAO                TR0150
0319 I                                      333 3370FIQUAO                TR0150
0319 I                                      338 338 FNAIYO                TR0150
0319 I                                      339 3400BUNNOO                TR0150
0319 I                                      341 3460FIDAYO                TR0150
0320 I                                      356 3610MADELO                TR0150
0320 I                                      362 3700STPRIO                TR0150
0320 I                                      385 3920DELE8O                TR0150
0320 I                                      393 4000SEHA8O                TR0150
0320 I                                      403 4080FIDA8O                TR0150
0320 I                                      469 4690UNDEDO                TR0150
0321 I        NS  35                                                      TR0150
0322 IDTR0060 NS  36   1 CS   2 CC   3NCD                                 TR0150
0323 I                                        4   40SCKEYP                TR0150
0324 I                                        5   80BCNTEP                TR0150
0325 I                                        9  120ECNTEP                TR0150
0326 I        NS  37                                                      TR0150
     IDTR0070 NS  38   1 CS   2 CM   3NCD                                 TR0150
0328 I                                        4   9 NBNBRQ                TR0150
0329 I                                       10  110SEQNOQ                TR0150
0330 I                                        4  11 NBSEQQ                TR0150
0331 I                                       12  36 ITDSCQ                TR0150
0332 I                                       42  550ITCODQ                TR0150
0333 I                                    P  56  580QUANTQ                TR0150
0334 I                                    P  59  610QTYRSQ                TR0150
0335 I                                    P  62  640QTYOBQ                TR0150
0336 I                                       65  70 JUTKCQ                TR0150
0337 I                                       71  780JUTNOQ                TR0150
     I*
     I                                      130 1310DETCNQ                TR0150
     I                                    P 132 1340BQUANQ                TR0150
     I                                    P 135 1370HJQTYQ                TR0150
     I                                      138 1450CRTD1Q                TR0150
     I                                      146 1510CRTT1Q                TR0150
     I                                      152 155 USID1Q                TR0150
     I                                      156 159 JBID1Q                TR0150
     I                                      160 169 PGID1Q                TR0150
     I*
     I                                      170 175 SAK71Q                TR0150
     I                                      176 181 SAK72Q                TR0150
     I                                      182 187 SAK73Q                TR0150
     I                                      188 193 SAK74Q                TR0150
     I                                      194 2000SRY71Q                TR0150
     I                                      201 2070SRY72Q                TR0150
     I                                      208 2140SRY73Q                TR0150
     I                                      215 2210SRY74Q                TR0150
0338 I        NS  39                                                      TR0150
0339 IDTP1110 NS  40   1 CC   2 CF                                        TR0150
0340 I                                        4  110MDYKER                TR0150
0341 I                                       12  14 YOUBIR                TR0150
0342 I                                       15  15 SUNDAR                TR0150
0343 I                                       16  16 THOLIR                TR0150
0344 I                                       17  17 HOLIDR                TR0150
0345 I                                       18  32 HNAMER                TR0150
0345 I                                       18  18 TANA1R                TR0150
0345 I                                       32  32 BIKO1R                TR0150
0346 I                                       33  360RRNNOR                TR0150
0347 I        NS  41                                                      TR0150
0348 IDTR0020LNS  42   1 CJ   2 CF   3NCD                                 TR0150
0349 I                                        4   90JUTNOS                TR0150
0350 I                                       10  110SEQNOS                TR0150
0351 I                                        4  110JUSENS                TR0150
0352 I                                       12  16 CUSNRS                TR0150
0353 I                                       17  21 SHPNRS                TR0150
0354 I                                       22  240SLSNRS                TR0150
0355 I                                       25  39 ORDNOS                TR0150
0356 I                                       40  450JUTDYS                TR0150
0357 I                                       46  460DELCDS                TR0150
0358 I                                       47  520DELDYS                TR0150
0359 I                                       53  540DETCNS                TR0150
0360 I                                       55  60 JUTKCS                TR0150
0360 I                                       55  55 A1S                   TR0150
0360 I                                       56  560A2S                   TR0150
0361 I                                    P  61  630QUANTS                TR0150
0362 I                                    P  64  670TANKAS                TR0150
0363 I                                    P  68  720KINGAS                TR0150
0364 I                                       73 102 ITDSCS                TR0150
0365 I                                      103 1160ITCODS                TR0150
0366 I                                      117 117 DOJNOS                TR0150
0367 I                                      118 1180BUNYNS                TR0150
0368 I                                      119 1230INVNOS                TR0150
0369 I                                      124 129 SSAKBS                TR0150
0370 I                                      130 1370BUMORS                TR0150
0371 I                                      138 1380BUNDTS                TR0150
0372 I                                    P 139 1410BQUANS                TR0150
0373 I                                    P 142 1440HJQTYS                TR0150
0374 I                                      145 1460BUNSUS                TR0150
0375 I                                      147 152 REJUKS                TR0150
0376 I                                      187 1920REDAYS                TR0150
0261 I                                      193 2000JUTD8S                TR0150
0262 I                                      201 2080DELD8S                TR0150
0263 I                                      209 2160SHUD8S                TR0150
0263 I                                      217 2240REDA8S                TR0150
0263 I                                      225 2260CODE1S                TR0150
0263 I                                      227 232 CUSIDS                TR0150
0263 I                                      233 233 SHICDS                TR0150
0377 I        NS  43                                                      TR0150
0378 I                                        4   90JUTNOS                TR0150
0379 I                                       10  110SEQNOS                TR0150
0380 I                                        4  110JUSENS                TR0150
0381 IDTR0070LNS  44   1 CS   2 CM   3NCD                                 TR0150
0382 I                                        4   9 NBNBRT                TR0150
0383 I                                       10  110SEQNOT                TR0150
0384 I                                        4  11 NBSEQT                TR0150
0385 I                                       12  36 ITDSCT                TR0150
0386 I                                       42  550ITCODT                TR0150
0387 I                                    P  56  580QUANTT                TR0150
0388 I                                    P  59  610QTYRST                TR0150
0389 I                                    P  62  640QTYOBT                TR0150
0390 I                                       65  70 JUTKCT                TR0150
0391 I                                       71  780JUTNOT                TR0150
0392 I        NS  45                                                      TR0150
0393 I                                        4   9 NBNBRT                TR0150
0394 I                                       10  110SEQNOT                TR0150
0395 I                                        4  11 NBSEQT                TR0150
0381 IRDKK0380                                                            TR0150
     I              ZZ0001                          RECCDZ
     I              ACREC                           ACRECZ
     I              JUSEN                           JUSENZ
     I              TOKSE                           TOKSEZ
     I              TOTAM                           TOTAMZ
     I              TOKSS                           TOKSSZ
     IRDMR0070
     I              ITCOD                           ITCODX
     I**TP11
     I**            ZZ0001                          RECCD4
     I**            ACREC                           ACREC4
     I**            Y2YMD                           Y2YMD4
     I**            RRNNO                           RRNNO4
     IRDMP0100
     I              ACREC                           ACRECW
     I              RECCD                           RECCDW
     I              ITNBR                           ITNBRW
     I              ITDSC                           ITDSCW
     I              ITTYP                           ITTYPW
     I              ORDPC                           ORDPCW
     I              LOTSZ                           LOTSZW
     I              SAINV                           SAINVW
     I              CLCST                           CLCSTW
     I              STCOS                           STCOSW
     I              INVQU                           INVQUW
     I              ORDRE                           ORDREW
     I              PAYQU                           PAYQUW
     I              NBNBR                           NBNBRW
     I              ORDYN                           ORDYNW
     I              MATER                           MATERW
     I              HPRIC                           HPRICW
     I              HQUAN                           HQUANW
     I              PSRRN                           PSRRNW
     I              PERRN                           PERRNW
     I              RSRRN                           RSRRNW
     I              RERRN                           RERRNW
     I              OSRRN                           OSRRNW
     I              OERRN                           OERRNW
     I              ORSRR                           ORSRRW
     I              ORERR                           ORERRW
     I              UNMSR                           UNMSRW
     I              LLCCD                           LLCCDW
     I              FPOST                           FPOSTW
     I              BCODE                           BCODEW
     I              STACO                           STACOW
     I              NAIYN                           NAIYNW
     I              SLTSZ                           SLTSZW
     I              PLACE                           PLACEW
     I              RETIM                           RETIMW
     I              REDAY                           REDAYW
     I              RPROG                           RPROGW
     IRDTR9100
     I              ACREC                           ACRECX
     I              SLSNR                           SLSNRX
     I              SLSNM                           SLSNMX
     I              SOTCD                           SOTCDX
     IDS1         DS
     I                                        1   5 CUSNR2
     I                                        1   1 WKCUS
     I                                        1   2 WKCUS2
     IDS2         DS
     I                                        1  30 ITNBR7
     I                                        1  14 ITDS14
     I                                       26  26 W26
     I                                       26  27 W261
     I                                       28  28 MAISU
     I                                       30  30 W30
     I                                       27  30 WKTOK4
     IDS3         DS
     I                                        1  30 ITNBRA
     I                                        1  14 ITD14A
     I                                       26  26 WW26
     I                                       28  28 MAISU1
     I                                       30  30 WW30
     IDS4         DS
     I                                        1   60JUTDY3
     I                                        1   20WYY1
     IDS5         DS
     I                                        1   60DELDY6
     I                                        1   20WYY2
     IDS6         DS
     I                                        1   6 AAA
     I                                        1   1 WAA1
     I                                        2   2 WAA2
     I                                        3   60WAA4
     IDS7         DS
     I                                        1  16 MSGX
     I                                        1   5 MSG3
     IDS8         DS
     I                                        1  25 ITNB17
     I                                        1  14 ITNB14
     IDS9         DS
     I                                        1  25 ITNB1A
     I                                        1  14 ITN14A
     IDSA         DS
     I                                        1   80PJUTNO
     I                                        1   60WJUTN1
     I                                        7   80WSEQNO
     IDSB         DS
     I                                        1   6 WJUTK1
     I                                        1   1 A1
     I                                        2   20A2
     I                                        3   30A3
     I                                        4   40A4
     I                                        5   50A5
     I                                        6   60A6
     IDSC         DS
     I                                        1  10 GYUBI1
     I                                        1   7 GZIPCD
     IDSD         DS
     I                                        1   8 YUBIN8
     I                                        1   3 YUB1
     I                                        4   4 YUB2
     I                                        5   8 YUB3
     IDSE         DS
     I                                        1   8 GYUBIN
     I                                        1   1 GYUB1
     I                                        2   2 GYUB2
     I                                        3   3 GYUB3
     I                                        4   4 GYUB4
     I                                        5   5 GYUB5
     I                                        6   6 GYUB6
     I                                        7   7 GYUB7
     I                                        8   8 GYUB8
     IDSF         DS
     I                                        1   7 WZIPCD
     I                                        1   1 WZIP1
     I                                        2   2 WZIP2
     I                                        3   3 WZIP3
     I                                        4   4 WZIP4
     I                                        5   5 WZIP5
     I                                        6   6 WZIP6
     I                                        7   7 WZIP7
     IDSG         DS
     I                                        1  25 B25
     I                                        5   8 W#QU1
     I                                       13  16 W#QU2
     IDSH         DS
     I                                        1  14 B2544
     I                                        6  10 W#QU3
     IDSI         DS
     I                                        1   2 CODE17
     I                                        1   1 WCOD11
     I                                        2   2 WCOD12
     IDSJ         DS
     I                                        1   2 CODE1A
     I                                        1   1 WCOA11
     I                                        2   2 WCOA12
     IDSK         DS
     I                                        1   80J
     I                                        7   80SEQJ
     I*< SDS >
     I           SDS
     I                                        1  10 S#PGID
     I                                      244 253 S#JOB
     I                                      244 245 WSID
     I                                      254 263 S#USR
     I*< ºΩ√—ì˙ït>
     I            DS
     I                                        1  140W#SYST
     I                                        1   60W#SHMS
     I                                        7  140W#SYMD
     C*----------------------------------------------------
     C                     TIME           W#SYST
     C                     MOVELS#JOB     W#JOB   5
     C*----------------------------------------------------
     C           PAR010    PLIST
     C                     PARM           P#DELC  1
     C                     PARM           P#SELC  10
     C                     PARM           P#KOSN  1
     C                     PARM           P#JUT4  60
     C                     PARM           P#SEQ4  20
     C                     PARM           P#NBNB  6
     C                     PARM           P#NB11  6
     C                     PARM           P#NB21  6
     C                     PARM           P#NB31  6
     C                     PARM           P#NB41  6
     C                     PARM           P#NB51  6
     C                     PARM           P#DE11  60
     C                     PARM           P#DE21  60
     C                     PARM           P#DE31  60
     C                     PARM           P#DE41  60
     C                     PARM           P#DE51  60
     C                     PARM           P#RECD  2
     C*----------------------------------------------------               TR0150
     C           PAR020    PLIST
     C                     PARM           P#CUSN  5        å⁄ãq
     C                     PARM           P#SHPN  5        èoâ◊êÊ
     C                     PARM           P#ODNO 15        íçî‘
     C                     PARM           P#JUDY  60       éÛíçì˙
     C                     PARM           P#SLSN  30       ì¸óÕé“
     C                     PARM           P#INPN  10       éÌï 
     C                     PARM           P#BUYN  10       ï™î[YN
     C                     PARM           P#DECD  10       î[ä˙éwíË
     C                     PARM           P#DEDY  60       î[ä˙ì˙ït
     C                     PARM           P#SHCD  10       èoâ◊êÊïœçX
     C                     PARM           P#ITNB 30        ïîïiNO
     C                     PARM           P#QUAN  50       êîó 
     C                     PARM           P#GCOD  2        ï™óﬁ
     C                     PARM           P#RTC1  1        ÿ¿∞›∫∞ƒﬁ
     C                     PARM           P#JUNO  80       éÛíçNO
     C                     PARM           P#TANK  70       íPâø
     C                     PARM           P#KING  90       ã‡äz
     C                     PARM           P#ITNR 14        ê}î‘
     C                     PARM           P#JUTK  6        éÛíçå`ë‘
     C                     PARM           P#SHP1  5        èoâ◊êÊ∫∞ƒﬁ
     C                     PARM           P#SHPM 50        èoâ◊êÊñº
     C                     PARM           P#YUBI 10        óXï÷î‘çÜ
     C                     PARM           P#SHI1 60        èZèäÇP
     C                     PARM           P#SHI2 60        èZèäÇQ
     C                     PARM           P#BIKO 62        îıçlÇP
     C                     PARM           P#BIK2 62        îıçlÇQ
     C                     PARM           P#BUSY 62        ïîèê
     C                     PARM           P#SHTE 15        ìdòb
     C                     PARM           P#RJUN  80       éÛíçÇmÇn
     C                     PARM           P#CLOK  60       éûçè
     C                     PARM           P#DUDY  80       èoâ◊ì˙
     C                     PARM           P#TMCD  2        èoâ◊éûä‘ë—
     C                     PARM           P#SAGC  50       ç≤êÏÇbÇc
     C                     PARM           P#DJCD  1
     C                     PARM           P#TGCD  3
     C*----------------------------------------------------               TR0150
     C           PAR025    PLIST
     C                     PARM           P#CUSN  5        å⁄ãq
     C                     PARM           P#SHPN  5        èoâ◊êÊ
     C                     PARM           P#ODNO 15        íçî‘
     C                     PARM           P#JUDY  60       éÛíçì˙
     C                     PARM           P#SLSN  30       ì¸óÕé“
     C                     PARM           P#INPN  10       éÌï 
     C                     PARM           P#BUYN  10       ï™î[YN
     C                     PARM           P#DECD  10       î[ä˙éwíË
     C                     PARM           P#DEDY  60       î[ä˙ì˙ït
     C                     PARM           P#SHCD  10       èoâ◊êÊïœçX
     C                     PARM           P#ITNB 30        ïîïiNO
     C                     PARM           P#QUAN  50       êîó 
     C                     PARM           P#GCOD  2        ï™óﬁ
     C                     PARM           P#RTC3  1        ÿ¿∞›∫∞ƒﬁ
     C                     PARM           P#JUNO  80       éÛíçNO
     C                     PARM           P#TANK  70       íPâø
     C                     PARM           P#KING  90       ã‡äz
     C                     PARM           P#ITNR 14        ê}î‘
     C                     PARM           P#JUTK  6        éÛíçå`ë‘
     C                     PARM           P#SHP1  5        èoâ◊êÊ∫∞ƒﬁ
     C                     PARM           P#SHPM 50        èoâ◊êÊñº
     C                     PARM           P#YUBI 10        óXï÷î‘çÜ
     C                     PARM           P#SHI1 60        èZèäÇP
     C                     PARM           P#SHI2 60        èZèäÇQ
     C                     PARM           P#BIKO 62        îıçlÇP
     C                     PARM           P#BIK2 62        îıçlÇQ
     C                     PARM           P#BUSY 62        ïîèê
     C                     PARM           P#SHTE 15        ìdòb
     C                     PARM           P#RJUN  80       éÛíçÇmÇn
     C                     PARM           P#CLOK  60       éûçè
     C                     PARM           P#DUDY  80       èoâ◊ì˙
     C                     PARM           P#TMCD  2        èoâ◊éûä‘ë—
     C                     PARM           P#SAGC  50       ç≤êÏÇbÇc
     C                     PARM           P#NBNB  6        çÏî‘
     C                     PARM           P#SHOC  1        èoâ◊çHèÍ
     C                     PARM           P#LCLA  5        ëÂï™óﬁ
     C                     PARM           P#MCLA  5        íÜï™óﬁ
     C                     PARM           P#SCLA  5        è¨ï™óﬁ
     C*----------------------------------------------------               TR0150
     C           PAR030    PLIST
     C                     PARM           P#ITN1 30        å^éÆ
     C                     PARM           P#QUNT  50       êîó 
     C                     PARM           P#NBN1  6        çÏî‘
     C                     PARM           P#JUT1  80       éÛíçNO
     C                     PARM           P#JUK1  6        éÛíçå`ë‘
     C                     PARM           P#DETC  10       √ﬁ®√®∞Ÿ
     C                     PARM           P#RTC2  10       RTCD
     C*----------------------------------------------------
     C           PAR040    PLIST
     C                     PARM           P#NBN2  6        çÏî‘
     C                     PARM           P#JUT2  80       éÛíçNO
     C*----------------------------------------------------
     C           PAR050    PLIST
     C                     PARM           P#KOSN  1
     C                     PARM           P#SBTP  1
     C                     PARM           P#KEY1 10
     C                     PARM           P#KEY2 14
     C                     PARM           P#KEY3 10
     C                     PARM           P#KEY4 10
     C                     PARM           P#ITCD 14
     C                     PARM           P#MFIQ 110
     C                     PARM           P#JUTN  80
     C                     PARM           P#IDSC 30
     C                     PARM           P#ITNO 25
     C                     PARM           P#RTCD  2
     C*----------------------------------------------------
     C           PAR060    PLIST
     C                     PARM           P#ITDS 30
     C                     PARM           P#DCOD  20
     C                     PARM           P#RECD  2
     C*----------------------------------------------------
     C           PAR070    PLIST
     C                     PARM           P#SKBN  1
     C                     PARM           P#LENG  30
     C                     PARM           P#MOJ1256
     C                     PARM           P#MOJ2256
     C                     PARM           P#MOJ3256
     C                     PARM           P#RETN  1
     C*<îrëºêßå‰èàóù: @SB030R >
     C           PAR080    PLIST
     C                     PARM           P#SYOK  1        èàóùãÊï™
     C                     PARM           P#OBJF 10         Ãß≤ŸID
     C                     PARM           P#OBJ1 15         KEY1
     C                     PARM           P#OBJ2 15         KEY2
     C                     PARM           P#OBJ3 15         KEY3
     C                     PARM           P#OBJ4 15         KEY4
     C                     PARM           P#OBJ5 15         KEY5
     C                     PARM           P#CRTP 10         Ãﬂ€∏ﬁ◊—ID
     C                     PARM           P#USID 10         ’∞ªﬁ∞ID
     C                     PARM           P#JBID 10         ºﬁÆÃﬁID
     C                     PARM           P#RTN2  2         ÿ¿∞›∫∞ƒﬁ
     C*----------------------------------------------------
     C           PAR090    PLIST
     C                     PARM           P#SACD  50
     C                     PARM           P#SNAM 60
     C                     PARM           P#ZIPC  7
     C                     PARM           P#RECD  2
     C*----------------------------------------------------
     C           PAR100    PLIST
     C                     PARM           P#CUSN  5
     C                     PARM           P#ODNO 15
     C                     PARM           P#ITTP  1
     C                     PARM           P#ITCD 14
     C                     PARM           P#ITDS 30
     C                     PARM           P#RECD  2
     C*----------------------------------------------------
     C           PAR110    PLIST
     C                     PARM           P#DAY1  80
     C                     PARM           P#DATE  40
     C                     PARM           P#DAY2  80
     C*----------------------------------------------------
     C           PAR120    PLIST
     C                     PARM           P#SBSB  6
     C                     PARM           P#QUAN  50
     C*----------------------------------------------------
     C           PAR130    PLIST
     C                     PARM           P#JUN8  80
     C                     PARM           P#DJCD  1
     C                     PARM           P#TGCD  3
     C*----------------------------------------------------
     C           PAR140    PLIST
     C                     PARM           P#EDCD  1
     C*----------------------------------------------------
     C           PAR150    PLIST
     C                     PARM           P#JUN8
     C*----------------------------------------------------
     C           PAR160    PLIST
     C                     PARM           P#ITCD
     C                     PARM           P#HAIK  1
     C*----------------------------------------------------
     C           D0070     KLIST
     C                     KFLD           J
     C                     KFLD           AAA
     C*----------------------------------------------------
     C           D0050     KLIST
     C                     KFLD           WAA1
     C                     KFLD           WAA2
     C                     KFLD           WAA4
     C*----------------------------------------------------
     C                     MOVE *IN90     WK90    1
     C                     MOVE WK90X     *IN90
     C                     MOVE *IN91     WK91    1
     C                     MOVE WK91X     *IN91
0399 C   90                READ NA047JFM                 91               TR0150
0400 C  N90                SETON                     9001                 TR0150
0401 C                     SETOF                     91                   TR0150
     C                     MOVE *IN90     WK90X   1
     C                     MOVE WK90      *IN90
     C                     MOVE *IN91     WK91X   1
     C                     MOVE WK91      *IN91
0402 C   99                GOTO \PROC                                     TR0150
0403 C  N99                EXSR #FIRST                                    TR0150
0404 C  N99                SETON                     99                   TR0150
0405 C           \PROC     TAG                                            TR0150
0406 C*****************************************************               TR0150
0407 C*         ºﬁ≠¡≠- √ﬁ-¿ INPUT WORKSTN PROCESS         *               TR0150
0408 C*****************************************************               TR0150
0409 C                     TIME           TIME                            TR0150
0410 C   02 KG             EXSR #TRSC                                     TR0150
0410 C*  02 KG             SETON                     LR                   TR0150
0411 C*  02 KG             GOTO END                                       TR0150
0412 C   01                GOTO \SF01                                     TR0150
0413 C   02                GOTO \SF02                                     TR0150
0653 C   03                GOTO \SF03                                     TR0150
0415 C   04                GOTO \SF04                                     TR0150
0416 C   05                GOTO \SF05                                     TR0150
0417 C   06                GOTO \SF06                                     TR0150
0418 C   07                GOTO \SF07                                     TR0150
0419 C   08                GOTO \SF08                                     TR0150
0420 C   09                GOTO \SF09                                     TR0150
0421 C   10                GOTO \SF10                                     TR0150
0422 C   11                GOTO \SF11                                     TR0150
0423 C   12                GOTO \SF12                                     TR0150
0424 C   13                GOTO \SF13                                     TR0150
0425 C   14                GOTO \SF14                                     TR0150
0426 C   15                GOTO \SF15                                     TR0150
     C   16                GOTO \SF16                                     TR0150
0428 C*****************************************************               TR0150
0429 C           \SF01     TAG                                            TR0150
0430 C*****************************************************               TR0150
0432 C                     EXSR #SETOF                                    TR0150
0432 C                     EXSR #DOJC                                     TR0150
0433 C                     SETON                     50                   TR0150
0434 C                     EXCPT                           GAMEN1         TR0150
0435 C                     SETOF                     50                   TR0150
0436 C                     GOTO END                                       TR0150
0437 C*****************************************************               TR0150
0438 C           \SF02     TAG                                            TR0150
0439 C*****************************************************               TR0150
0441 C                     EXSR #SETOF                                    TR0150
0442 C                     SETOF                     9596                 TR0150
0443 C           CUSNR2    CHAINDMR0010              95                   TR0150
0444 C   95                SETON                     8081                 TR0150
0432 C   95                EXSR #DOJC                                     TR0150
0445 C   95                SETON                     50                   TR0150
0446 C   95                EXCPT                           GAMEN1         TR0150
0447 C   95                SETOF                     50                   TR0150
0448 C   95                GOTO END                                       TR0150
0449 C  N95                Z-ADDSLNR2G    WSLNR2  30                      TR0150
0449 C  N95      SHPNRG    CHAINDMR0030              96                   TR0150
0450 C  N95 96             SETON                     8081                 TR0150
0451 C  N95 96             EXSR #DOJC                                     TR0150
0451 C  N95 96             SETON                     50                   TR0150
0452 C  N95 96             EXCPT                           GAMEN1         TR0150
0453 C  N95 96             SETOF                     50                   TR0150
0454 C  N95 96             GOTO END                                       TR0150
     C*
0455 C  N95N96             EXSR #SETOF                                    TR0150
     C  N95N96             MOVELWCUSID    CUSID3
0456 C  N95N96             SETON                     51                   TR0150
0457 C  N95N96             EXCPT                           GAMEN2         TR0150
0458 C  N95N96             SETOF                     51                   TR0150
0459 C  N95N96             GOTO END                                       TR0150
0460 C*****************************************************               TR0150
0461 C           \SF03     TAG                                            TR0150
0462 C*****************************************************               TR0150
0464 C                     EXSR #SETOF                                    TR0150
     C                     SETOF                     27
     C           DOJCD3    IFEQ '*'
     C                     SETON                     27
     C                     ENDIF
0465 C   KD                EXSR #DOJC                                     TR0150
0465 C   KD                SETON                     50                   TR0150
0466 C   KD                EXCPT                           GANEN1         TR0150
0467 C   KD                SETOF                     50                   TR0150
0468 C   KD                GOTO END                                       TR0150
0469 C  NKD                GOTO \S3XXX                                    TR0150
     C*----------------------------------------------------               TR0150
0471 C           \S3XXX    TAG                                            TR0150
0472 C*----------------------------------------------------               TR0150
0473 C                     SETOF                     959697               TR0150
     C           SHPNR3    CHAINDMR0030              95                   TR0150
     C   95                SETON                     8081                 TR0150
     C   95                GOTO \S310A                                    TR0150
0477 C  N95                GOTO \S3100                                    TR0150
0478 C*----------------------------------------------------               TR0150
0479 C           \S310A    TAG                                            TR0150
     C           SHPNR3    IFEQ *BLANK
0477 C                     GOTO \S3100                                    TR0150
     C                     ELSE
0490 C                     GOTO \S3210                                    TR0150
     C                     ENDIF
0478 C*----------------------------------------------------               TR0150
0479 C           \S3100    TAG                                            TR0150
0480 C*----------------------------------------------------               TR0150
     C                     MOVEL*BLANK    WSHP11  5
     C                     MOVEL*BLANK    WYUBIN 10
     C                     MOVEL*BLANK    WSHPN1 50
     C                     MOVEL*BLANK    WSHIP1 60
     C                     MOVEL*BLANK    WSHIP2 60
     C                     MOVEL*BLANK    WBUSYO 62
     C                     MOVEL*BLANK    WBIKO1 62
     C                     MOVEL*BLANK    WBIKO2 62
     C                     MOVEL*BLANK    WSHTEL 15
     C                     Z-ADD0         WDUEDY  80
     C                     MOVEL*BLANK    WTIMCD  2
     C                     Z-ADD0         WSAGCD  50
     C*
     C                     MOVELUDATE     JUTDY3
     C                     Z-ADD0         WYJUT   80
     C           WYY1      IFGE 90
     C                     MOVEL'19'      WYJUT
     C                     ELSE
     C                     MOVEL'20'      WYJUT
     C                     ENDIF
     C                     MOVE JUTDY3    WYJUT
     C*
0481 C           WYJUT     CHAINDTP1110              96                   TR0150
0482 C   96                SETON                     8082                 TR0150
0483 C   96                GOTO \S3110                                    TR0150
0484 C  N96                GOTO \S3110                                    TR0150
0485 C*----------------------------------------------------               TR0150
0486 C           \S3110    TAG                                            TR0150
0487 C*----------------------------------------------------               TR0150
0488 C           SLSNR3    CHAINDMR0020              97                   TR0150
0489 C   97                SETON                     8083                 TR0150
0490 C   97                GOTO \S3210                                    TR0150
0491 C  N97                GOTO \S311X                                    TR0150
0485 C*----------------------------------------------------               TR0150
0486 C           \S311X    TAG                                            TR0150
0487 C*----------------------------------------------------               TR0150
     C                     SETOF                     98
     C           SLSNR3    CHAINDTR9100              98
     C           *IN98     IFEQ '0'
     C                     SELEC
     C           WKCUS2    WHEQ '0X'
0491 C                     GOTO \S3120                     OK             TR0150
     C           WKCUS     WHNE '0'
     C*
     C           SOTCDX    IFEQ 'E'
0491 C                     GOTO \S3120                     OK             TR0150
     C                     ELSE
0489 C                     SETON                     8083                 TR0150
0490 C                     GOTO \S3210                     ¥◊∞            TR0150
     C                     ENDIF
     C*
     C                     OTHER
     C           SOTCDX    IFNE 'E'
0491 C                     GOTO \S3120                     OK             TR0150
     C                     ELSE
0489 C                     SETON                     8083                 TR0150
0490 C                     GOTO \S3210                     ¥◊∞            TR0150
     C                     ENDIF
     C                     ENDSL
     C*
     C                     ELSE
0489 C                     SETON                     8083                 TR0150
0490 C                     GOTO \S3210                     ¥◊∞            TR0150
     C                     ENDIF
0492 C*----------------------------------------------------               TR0150
0493 C           \S3120    TAG                                            TR0150
0494 C*----------------------------------------------------               TR0150
     C                     MOVEL*BLANK    WSHPNR  5
     C                     MOVEL*BLANK    WSHPNM 40
0495 C   80                GOTO \S3200                                    TR0150
     C  N80                MOVELSHPNR3    WSHPNR
     C  N80                MOVELSHPNMI    WSHPNM
0496 C  N80                GOTO \S3300                                    TR0150
0497 C*----------------------------------------------------               TR0150
0498 C           \S3200    TAG                                            TR0150
0499 C*----------------------------------------------------               TR0150
     C                     SETOF                     81
     C***                  Z-ADD0         GSAGCD
     C                     Z-ADD0         FLAG01  10
     C           FLAG01    DOWEQ0
     C                     EXFMTGAMEN18
     C           *IN04     IFEQ '1'
     C                     Z-ADD1         FLAG01
     C                     GOTO \SF02
     C                     ELSE
     C           *IN01     IFEQ '1'
     C                     EXSR #YUBIN
     C                     ELSE
     C           *IN03     IFEQ '1'
     C                     Z-ADD0         P#SACD            ºﬁÆÃﬁID
     C                     MOVEL*BLANK    P#SNAM            ÿ¿∞›∫∞ƒﬁ
     C                     MOVEL*BLANK    P#RECD
     C                     MOVEL*BLANK    P#ZIPC
     C                     CALL '@NA0470' PAR090           ç≤êÏåüçı
     C                     Z-ADDP#SACD    GSAGCD
     C                     MOVELP#SNAM    GSHIP1
     C                     MOVELP#ZIPC    WZIPCD  7
     C                     EXSR #ZIP
     C                     ELSE
     C*
     C                     SETOF                     808190
     C           GDUEDY    IFNE 0
     C           GDUEDY    CHAINDTP1110              90
     C           *IN90     IFEQ '1'
     C                     SETON                     8081
     C                     ELSE
     C**         THOLIR    IFEQ '*'
     C**                   SETON                     8081
     C***                  ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     SETOF                     83
     C           GSAGCD    IFEQ 0
     C           GYUBIN    IFNE *BLANK
     C                     EXSR #CHKY
     C                     ELSE
     C                     SETON                     8083
     C                     ENDIF
     C                     ENDIF
     C*
     C           GSAGCD    IFNE 0
     C                     SETOF                     8291
     C           GSAGCD    CHAINDMR0330              91
     C           *IN91     IFEQ '1'
     C                     SETON                     8082
     C                     ENDIF
     C                     ENDIF
     C*
     C           *IN80     IFEQ '0'
     C                     MOVEL*BLANK    WSHPN1
     C                     MOVEL*BLANK    WSHIP1
     C                     MOVEL*BLANK    WSHIP2
     C                     MOVEL*BLANK    WSHPNM
     C                     MOVELGSHPNM    WSHPNM
     C                     MOVEL*BLANK    WSHP11
     C                     MOVELGYUBIN    WYUBIN
     C                     MOVELGSHPNM    WSHPN1
     C                     MOVELGSHIP1    WSHIP1
     C                     MOVELGSHIP2    WSHIP2
     C                     MOVELGBUSYO    WBUSYO
     C                     MOVELGBIKO1    WBIKO1
     C                     MOVELGBIKO2    WBIKO2
     C                     MOVELGSHTEL    WSHTEL
     C                     Z-ADDGDUEDY    WDUEDY
     C                     MOVEL*BLANK    WTIMCD
     C                     Z-ADDGSAGCD    WSAGCD
     C                     GOTO \S3300
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
0497 C*----------------------------------------------------               TR0150
0498 C           \S3210    TAG                                            TR0150
0499 C*----------------------------------------------------               TR0150
     C                     MOVELWCUSID    CUSID3                          TR0150
0500 C                     SETON                     51                   TR0150
0501 C                     EXCPT                           GAMEN2         TR0150
0502 C                     SETOF                     51                   TR0150
0503 C                     GOTO END                                       TR0150
0504 C*----------------------------------------------------               TR0150
0505 C           \S3300    TAG                                            TR0150
0506 C*----------------------------------------------------               TR0150
0507 C                     Z-ADD0         A       60                      TR0150
     C*<<îrëºêßå‰ÅiÉçÉbÉNÅj>>
     C                     MOVEL'L'       P#SYOK           èàóùãÊï™
     C                     MOVEL'DTR0030' P#OBJF            Ãß≤ŸID
     C                     MOVELS#USR     P#OBJ1            KEY1
     C                     MOVEL*BLANK    P#OBJ2            KEY2
     C                     MOVEL*BLANK    P#OBJ3            KEY3
     C                     MOVEL*BLANK    P#OBJ4            KEY4
     C                     MOVEL*BLANK    P#OBJ5            KEY5
     C                     MOVELS#PGID    P#CRTP            Ãﬂ€∏ﬁ◊—ID
     C                     MOVELS#USR     P#USID            ’∞ªﬁ∞ID
     C                     MOVELS#JOB     P#JBID            ºﬁÆÃﬁID
     C                     MOVEL*BLANK    P#RTN2            ÿ¿∞›∫∞ƒﬁ
     C                     CALL '@SB030R' PAR080
     C*
     C***        P#RTN2    IFEQ *BLANK
0508 C                     SETOF                     95                   TR0150
0509 C           1         CHAINDTR0030              95                   TR0150
0510 C   95                SETON                     H1                   TR0150
0511 C  N95                Z-ADDJCCNTM    A                               TR0150
0512 C  N95                Z-ADD0         C       60                      TR0150
0513 C  N95      1         ADD  JCCNTM    C                               TR0150
     C           C         IFEQ 900000
     C                     Z-ADD1         C
     C                     ENDIF
0514 C  N95                SETON                     79                   TR0150
0515 C  N95                EXCPT                                          TR0150
0516 C  N95                SETOF                     79                   TR0150
     C*<<îrëºêßå‰ÅiâèúÅj>>
     C  N95                MOVEL'U'       P#SYOK           èàóùãÊï™
     C  N95                MOVEL'DTR0030' P#OBJF            Ãß≤ŸID
     C  N95                MOVELS#USR     P#OBJ1            KEY1
     C  N95                MOVEL*BLANK    P#OBJ2            KEY2
     C  N95                MOVEL*BLANK    P#OBJ3            KEY3
     C  N95                MOVEL*BLANK    P#OBJ4            KEY4
     C  N95                MOVEL*BLANK    P#OBJ5            KEY5
     C  N95                MOVELS#PGID    P#CRTP            Ãﬂ€∏ﬁ◊—ID
     C  N95                MOVELS#USR     P#USID            ’∞ªﬁ∞ID
     C  N95                MOVELS#JOB     P#JBID            ºﬁÆÃﬁID
     C  N95                MOVEL*BLANK    P#RTN2            ÿ¿∞›∫∞ƒﬁ
     C  N95                CALL '@SB030R' PAR080
     C*
     C  N95                MOVELCUSID3    WCUSID  6                       TR0150
     C  N95                EXSR #DOJC                                     TR0150
0517 C  N95                SETON                     52    GAMEN3         TR0150
0518 C  N95                EXCPT                                          TR0150
0519 C  N95                SETOF                     52                   TR0150
0520 C  N95                GOTO END                                       TR0150
0521 C*****************************************************               TR0150
0522 C           \SF04     TAG                                            TR0150
0523 C*****************************************************               TR0150
0525 C                     EXSR #SETOF                                    TR0150
0526 C   KD                GOTO \S4100                                    TR0150
     C  NKD KH             GOTO \S4500                                    TR0150
0528 C  NKDNKH             GOTO \S4300                                    TR0150
0529 C*----------------------------------------------------               TR0150
0530 C           \S4100    TAG                                            TR0150
0531 C*----------------------------------------------------               TR0150
     C                     Z-ADD0         WSAGCD
     C                     Z-ADD0         GSAGCD
     C                     Z-ADD0         WDUEDY
     C                     Z-ADD0         GDUEDY
     C*
0532 C                     EXSR #SETOF                                    TR0150
0532 C                     EXSR #DOJC                                     TR0150
0533 C                     SETON                     50                   TR0150
0534 C                     EXCPT                                          TR0150
0535 C                     SETOF                     50                   TR0150
0536 C                     GOTO END                                       TR0150
0537 C*----------------------------------------------------               TR0150
0538 C           \S4300    TAG                                            TR0150
0539 C*----------------------------------------------------               TR0150
0540 C                     EXSR #SETOF                                    TR0150
     C*GAMEN5ÀÆ≥ºﬁ
0541 C                     SETON                     54                   TR0150
0542 C                     EXCPT                                          TR0150
0543 C                     SETOF                     54                   TR0150
0544 C                     GOTO END                                       TR0150
0545 C*----------------------------------------------------               TR0150
0546 C           \S4500    TAG                                            TR0150
0547 C*----------------------------------------------------               TR0150
0548 C                     EXSR #SETOF                                    TR0150
0549 C                     Z-ADD0         B       80                      TR0150
0550 C                     MOVE Z2        B                               TR0150
0551 C                     MOVELA         B                               TR0150
0552 C                     SETOF                     97                   TR0150
0553 C           B         CHAINDTR0020              97                   TR0150
0554 C   97                EXSR #SETOF                                    TR0150
     C   97                MOVELCUSID3    WCUSID  6                       TR0150
     C   97                EXSR #DOJC                                     TR0150
0555 C   97                SETON                     52    GAMEN3         TR0150
0556 C   97                EXCPT                                          TR0150
0557 C   97                SETOF                     52                   TR0150
0558 C   97                GOTO END                                       TR0150
0559 C  N97                GOTO \S4510                                    TR0150
0560 C*----------------------------------------------------               TR0150
0561 C           \S4510    TAG                                            TR0150
0562 C*----------------------------------------------------               TR0150
0563 C                     SETON                     66                   TR0150
0564 C                     EXCPT                                          TR0150
0565 C                     SETOF                     66                   TR0150
0566 C                     EXSR #SETL1                                    TR0150
0567 C                     GOTO END                                       TR0150
0568 C*****************************************************               TR0150
0569 C           \SF05     TAG                                            TR0150
0570 C*****************************************************               TR0150
0572 C                     EXSR #SETOF                                    TR0150
     C   KD                MOVELCUSID3    WCUSID                          TR0150
     C   KD                EXSR #DOJC                                     TR0150
0573 C   KD                SETON                     52    GAMEN3         TR0150
0574 C   KD                EXCPT                                          TR0150
0575 C   KD                SETOF                     52                   TR0150
0576 C   KD                EXSR #SETL1                                    TR0150
0577 C   KD                GOTO END                                       TR0150
0578 C  NKD                GOTO \S5XXX                                    TR0150
0579 C*----------------------------------------------------               TR0150
0580 C           \S5XXX    TAG                                            TR0150
0581 C*----------------------------------------------------               TR0150
0582 C                     MOVE '      '  AAA     6                       TR0150
0583 C                     MOVE ' '       A1      1                       TR0150
0584 C                     Z-ADD0         A2      10                      TR0150
0585 C                     Z-ADD0         A3      10                      TR0150
0586 C                     Z-ADD0         A4      10                      TR0150
0587 C                     Z-ADD0         A5      10                      TR0150
0588 C                     Z-ADD0         A6      10                      TR0150
0589 C                     MOVE ' '       A7      1                       TR0150
0590 C                     MOVEL'        'MSGX   16                       TR0150
0591 C                     MOVE '        'MSGX                            TR0150
0592 C                     MOVEL'        'MSG1    9                       TR0150
0593 C                     MOVE '        'MSG1                            TR0150
0594 C                     MOVEL'        'MSG2    7                       TR0150
     C*
     C                     MOVEL*BLANK    WTOKSS
     C                     MOVEL*BLANK    WTOTAM
     C                     MOVEL*BLANK    WTOTAN
     C*
0595 C                     SETOF                     848586               TR0150
0596 C                     SETOF                     878889               TR0150
0597 C                     SETOF                     90                   TR0150
     C                     MOVEL*BLANK    W26
0598 C           INPN15    COMP 'A'                  848485               TR0150
0599 C   85                GOTO \S5100                                    TR0150
0600 C   84      INPN15    COMP 'B'                  848486               TR0150
0601 C   86                GOTO \S5110                                    TR0150
0602 C   84      INPN15    COMP 'C'                  848487               TR0150
0603 C   87                GOTO \S5120                                    TR0150
0604 C   84      INPN15    COMP 'D'                  848488               TR0150
0605 C   88                GOTO \S5130                                    TR0150
0606 C   84      INPN15    COMP 'E'                  848489               TR0150
0607 C   89                GOTO \S5140                                    TR0150
0608 C   84                SETON                     8081                 TR0150
0609 C   84                GOTO \S5XX1                                    TR0150
0610 C*----------------------------------------------------               TR0150
0611 C           \S5100    TAG                                            TR0150
0612 C*----------------------------------------------------               TR0150
0613 C                     MOVEL'º∫–À›'   MSG1                            TR0150
0614 C                     MOVE 'A'       A1                              TR0150
0615 C                     GOTO \S5XX1                                    TR0150
0616 C*----------------------------------------------------               TR0150
0617 C           \S5110    TAG                                            TR0150
0618 C*----------------------------------------------------               TR0150
0619 C                     MOVEL'ƒ∏º’À›'  MSG1                            TR0150
0620 C                     MOVE 'B'       A1                              TR0150
0621 C                     GOTO \S5XX1                                    TR0150
0622 C*----------------------------------------------------               TR0150
0623 C           \S5120    TAG                                            TR0150
0624 C*----------------------------------------------------               TR0150
0625 C                     MOVEL'ƒŸ∏æ¬ƒ'  MSG1                            TR0150
0626 C                     MOVE 'C'       A1                              TR0150
     C                     GOTO \S5XX1                                    TR0150
0628 C*----------------------------------------------------               TR0150
0629 C           \S5130    TAG                                            TR0150
0630 C*----------------------------------------------------               TR0150
0631 C                     MOVEL'º’-ÿ.π›√'MSG1                            TR0150
0632 C                     MOVE '≤'       MSG1                            TR0150
0633 C                     MOVE 'D'       A1                              TR0150
0634 C                     GOTO \S5XX1                                    TR0150
0635 C*----------------------------------------------------               TR0150
0636 C           \S5140    TAG                                            TR0150
0637 C*----------------------------------------------------               TR0150
0638 C                     MOVEL'ø … ¿'   MSG1                            TR0150
0639 C                     MOVE 'E'       A1                              TR0150
0640 C                     GOTO \S5XX1                                    TR0150
0641 C*----------------------------------------------------               TR0150
0642 C           \S5XX1    TAG                                            TR0150
0643 C*----------------------------------------------------               TR0150
     C* Ãﬁ›…≥Ã∂
     C           WKCUS     IFEQ '0'
     C           A1        IFEQ 'A'
     C                     MOVEL'1'       B11
     C                     ELSE
     C                     MOVEL*BLANK    B11
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*BLANK    B11
     C                     ENDIF
     C*E1… ﬁ±≤
     C           A1        IFEQ 'E'
     C           INPN25    ANDEQ1
     C                     MOVEL'1'       B11
     C                     ENDIF
     C*----------------------------------------------------
0644 C                     SETOF                     848586               TR0150
0645 C                     SETOF                     878889               TR0150
0646 C           INPN25    COMP 1                    848485               TR0150
0647 C   85                GOTO \S5150                                    TR0150
0648 C   84      INPN25    COMP 2                    848486               TR0150
     C   86      INPN15    IFEQ 'A'
     C           INPN15    OREQ ' '
0652 C                     SETON                     8082                 TR0150
     C                     GOTO \S5XX2
     C                     ELSE
0649 C                     GOTO \S5160                                    TR0150
     C                     ENDIF
0650 C   84      INPN25    COMP 3                    848487               TR0150
0651 C   87                GOTO \S5170                                    TR0150
0652 C   84                SETON                     8082                 TR0150
0653 C   84                GOTO \S5XX2                                    TR0150
0654 C*----------------------------------------------------               TR0150
0655 C           \S5150    TAG                                            TR0150
0656 C*----------------------------------------------------               TR0150
0657 C                     MOVE 'ºﬁ’¡’-'  MSG2                            TR0150
0658 C                     MOVE 0         A2                              TR0150
0659 C                     GOTO \S5XX2                                    TR0150
0660 C*----------------------------------------------------               TR0150
0661 C           \S5160    TAG                                            TR0150
0662 C*----------------------------------------------------               TR0150
0663 C                     MOVE 'º’¬∂Ωﬁ–' MSG2                            TR0150
0664 C                     MOVE 1         A2                              TR0150
0665 C                     GOTO \S5XX2                                    TR0150
0666 C*----------------------------------------------------               TR0150
0667 C           \S5170    TAG                                            TR0150
0668 C*----------------------------------------------------               TR0150
0669 C                     MOVE 'Õ›Àﬂ›'   MSG2                            TR0150
0670 C                     MOVE 2         A2                              TR0150
0671 C                     GOTO \S5XX2                                    TR0150
0672 C*----------------------------------------------------               TR0150
0673 C           \S5XX2    TAG                                            TR0150
0675 C   80                SETON                     54                   TR0150
0676 C   80                EXCPT                                          TR0150
0677 C   80                SETOF                     54                   TR0150
0678 C   80                GOTO END                                       TR0150
0679 C  N80                MOVELMSG1      MSGX                            TR0150
0680 C  N80                MOVE MSG2      MSGX                            TR0150
0681 C  N80                GOTO \S5200                                    TR0150
0682 C*----------------------------------------------------               TR0150
0683 C           \S5200    TAG                                            TR0150
0684 C*----------------------------------------------------               TR0150
0685 C                     SETOF                     848586               TR0150
0686 C                     SETOF                     878889               TR0150
0687 C           A2        COMP 0                    848485               TR0150
0688 C   85                GOTO \S5300                                    TR0150
0689 C   84                GOTO \S5400                                    TR0150
0690 C*----------------------------------------------------               TR0150
0691 C           \S5300    TAG                                            TR0150
0692 C*----------------------------------------------------               TR0150
     C                     MOVEL*BLANK    WDELDY
     C                     MOVEL*BLANK    REDY86
     C                     TIME           CLOCK   60
     C           A1        IFEQ 'B'
     C           A1        OREQ 'C'
     C           A1        OREQ 'D'
     C           A1        OREQ 'E'
     C                     MOVEL999999    WDELDY  60
     C*
     C                     EXSR #NOKI
     C*
     C***                  Z-ADDUDATE     REDY86
     C                     ELSE
     C           WKCUS     IFEQ '0'
     C*
     C           A1        IFEQ 'A'
     C*
     C                     SELEC
     C           A2        WHEQ 0
     C           CUSNR2    IFEQ '0X 00'
     C           CUSNR2    OREQ '0X 01'
     C           CUSNR2    OREQ '0X 02'
     C                     Z-ADD999999    WDELDY
     C                     Z-ADDUDATE     REDY86
     C                     MOVEL99999999  WYDEL
     C                     ELSE
     C*
     C           CLOCK     IFLE WKTIME
     C*
     C                     SETOF                     95
     C           W#SYMD    CHAINDTP1110              95
     C           *IN95     IFEQ '0'
     C*
     C           BIKO1R    IFEQ '*'
     C*---------------------------------------------
     C*âcã∆ì˙
     C                     Z-ADDW#SYMD    P#DAY1
     C                     Z-ADD1         P#DATE
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR110
     C*
     C                     MOVE P#DAY2    WDELDY
     C***                  MOVE P#DAY2    REDY86
     C                     MOVE *DATE     REDY86
     C*---------------------------------------------
     C*
     C                     ELSE
     C           TANA1R    IFEQ '*'
     C*âcã∆ì˙
     C                     Z-ADDW#SYMD    P#DAY1
     C                     Z-ADD0         P#DATE
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR110
     C*
     C                     MOVE P#DAY2    WDELDY
     C***                  MOVE P#DAY2    REDY86
     C                     MOVE *DATE     REDY86
     C                     ELSE
     C                     Z-ADDUDATE     WDELDY
     C                     Z-ADDUDATE     REDY86
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ELSE
     C*
     C*---------------------------------------------
     C*âcã∆ì˙
     C                     SETOF                     95
     C           W#SYMD    CHAINDTP1110              95
     C           *IN95     IFEQ '0'
     C                     Z-ADDW#SYMD    P#DAY1
     C*
     C           TANA1R    IFEQ '*'
     C                     Z-ADD0         P#DATE
     C                     ELSE
     C                     Z-ADD1         P#DATE
     C                     ENDIF
     C                     ENDIF
     C*
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR110
     C*
     C                     MOVE P#DAY2    WDELDY
     C***                  MOVE P#DAY2    REDY86
     C                     MOVE *DATE     REDY86
     C*
     C*---------------------------------------------
     C                     ENDIF
     C                     ENDIF
     C*
     C           A2        WHEQ 1
     C                     MOVEL999999    WDELDY  60
     C                     EXSR #NOKI
     C***                  Z-ADDUDATE     REDY86
     C                     MOVEL99999999  WYDEL
     C                     ENDSL
     C*
     C                     ENDIF
     C                     ELSE
     C                     MOVEL999999    WDELDY  60
     C                     EXSR #NOKI
     C***                  Z-ADDUDATE     REDY86
     C                     MOVEL99999999  WYDEL
     C                     ENDIF
     C                     ENDIF
0674 C*âÊñ ÇUï\é¶                                                       TR0150
0693 C                     SETON                     55                   TR0150
0694 C                     EXCPT                           GAMEN6         TR0150
0695 C                     SETOF                     55                   TR0150
0696 C                     GOTO END                                       TR0150
0697 C*----------------------------------------------------               TR0150
0698 C           \S5400    TAG                                            TR0150
0699 C*----------------------------------------------------               TR0150
     C                     MOVEL999999    WDELDY  60
     C                     Z-ADDUDATE     REDY86
     C                     MOVEL99999999  WYDEL
     C                     MOVEL'00'      CODE1A                          TR0150
     C                     MOVEL'C'       GSEBA8
     C*âÊñ ÇPÇOï\é¶
0700 C                     SETON                     59                   TR0150
0701 C                     EXCPT                                          TR0150
0702 C                     SETOF                     59                   TR0150
0703 C                     GOTO END                                       TR0150
0704 C*****************************************************               TR0150
0705 C           \SF06     TAG                                            TR0150
0706 C*****************************************************               TR0150
0708 C                     EXSR #SETOF                                    TR0150
0709 C   KD                SETON                     54                   TR0150
0710 C   KD                EXCPT                                          TR0150
0711 C   KD                SETOF                     54                   TR0150
0712 C   KD                GOTO END                                       TR0150
0713 C  NKD                GOTO \S6XXX                                    TR0150
0714 C*----------------------------------------------------               TR0150
0715 C           \S6XXX    TAG                                            TR0150
0716 C*----------------------------------------------------               TR0150
0717 C                     SETOF                     848586               TR0150
0718 C                     SETOF                     878889               TR0150
0719 C           BUNYN6    COMP 0                    848485               TR0150
0720 C   85                GOTO \S6100                                    TR0150
0721 C   84      BUNYN6    COMP 1                    848486               TR0150
0722 C   86                GOTO \S6100                                    TR0150
0723 C   84                SETON                     8081                 TR0150
0724 C   84                GOTO \S6100                                    TR0150
0725 C*----------------------------------------------------               TR0150
0726 C           \S6100    TAG                                            TR0150
     C*----------------------------------------------------               TR0150
0728 C                     SETOF                     848586               TR0150
0729 C                     SETOF                     878889               TR0150
0730 C           DELCD6    COMP 0                    848485               TR0150
0731 C   85                GOTO \S6110                                    TR0150
0732 C   84      DELCD6    COMP 1                    848486               TR0150
0733 C   86                GOTO \S6110                                    TR0150
0734 C   84                SETON                     8082                 TR0150
0735 C   84                GOTO \S6110                                    TR0150
0736 C*----------------------------------------------------               TR0150
0737 C           \S6110    TAG                                            TR0150
0738 C*----------------------------------------------------               TR0150
0740 C                     SETOF                     9596                 TR0150
     C*
     C           A1        IFEQ 'B'
     C           A1        OREQ 'C'
     C           A1        OREQ 'D'
     C           A1        OREQ 'E'
     C*
     C           DELCD6    IFEQ 1
     C           WYY2      IFGE 90
     C                     MOVEL'19'      WYDEL
     C                     ELSE
     C                     MOVEL'20'      WYDEL
     C                     ENDIF
     C                     MOVE DELDY6    WYDEL
     C                     ELSE
     C                     Z-ADD99999999  WYDEL
     C                     ENDIF
     C*
     C                     GOTO \S6120                                    TR0150
     C                     ELSE
     C           DELDY6    IFEQ 999999
     C                     MOVEL99999999  WYDEL
     C                     ELSE
     C                     Z-ADD0         WYDEL   80
     C           WYY2      IFGE 90
     C                     MOVEL'19'      WYDEL
     C                     ELSE
     C                     MOVEL'20'      WYDEL
     C                     ENDIF
     C                     MOVE DELDY6    WYDEL
     C                     ENDIF
     C*
     C           WYDEL     IFEQ 99999999
0746 C                     GOTO \S6120                                    TR0150
     C                     ELSE
     C           A1        IFEQ 'A'
     C           WKCUS     ANDEQ'0'
     C           WYDEL     CHAINDTP1110              95                   TR0150
0744 C   95                SETON                     8083                 TR0150
0745 C   95                GOTO \S6120                                    TR0150
0746 C  N95                GOTO \S6120                                    TR0150
     C                     ELSE
0746 C                     GOTO \S6120                                    TR0150
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
0747 C*----------------------------------------------------               TR0150
0748 C           \S6120    TAG                                            TR0150
0749 C*----------------------------------------------------               TR0150
0750 C   80                GOTO \S6200                                    TR0150
0751 C  N80                GOTO \S6210                                    TR0150
0752 C*----------------------------------------------------               TR0150
0753 C           \S6200    TAG                                            TR0150
0754 C*----------------------------------------------------               TR0150
0755 C                     SETON                     55                   TR0150
0756 C                     EXCPT                           GAMEN6         TR0150
0757 C                     SETOF                     55                   TR0150
0758 C                     GOTO END                                       TR0150
0759 C*----------------------------------------------------               TR0150
0760 C           \S6210    TAG                                            TR0150
0761 C*----------------------------------------------------               TR0150
     C                     MOVEL*BLANK    WTHOLD 15
     C           WYDEL     IFNE 99999999
     C           WYDEL     ANDNE0
     C           THOLIR    IFEQ '*'
     C                     SETON                     8083
     C                     MOVELTBL01,2   WTHOLD
     C                     GOTO \S6200                                    TR0150
     C                     ENDIF
     C                     ENDIF
     C*
     C           REDY86    IFNE 999999
     C           REDY86    ANDNE0
     C           20000000  ADD  REDY86    WYRED   80
     C                     SETOF                     90
     C           WYRED     CHAINDTP1110              90
     C           *IN90     IFEQ '0'
     C           THOLIR    IFEQ '*'
     C                     SETON                     8083
     C                     MOVELTBL01,2   WTHOLD
     C                     GOTO \S6200                                    TR0150
     C                     ENDIF
     C                     ELSE
     C                     SETON                     8083
     C                     ENDIF
     C                     ENDIF
     C*
     C           SHCCD6    IFNE 0
     C                     MOVEL*BLANK    WSHP11
     C                     MOVEL*BLANK    WYUBIN
     C                     MOVEL*BLANK    WSHPN1
     C                     MOVEL*BLANK    WSHIP1
     C                     MOVEL*BLANK    WSHIP2
     C                     MOVEL*BLANK    WBUSYO
     C                     MOVEL*BLANK    WBIKO1
     C                     MOVEL*BLANK    WBIKO2
     C                     MOVEL*BLANK    WSHTEL
     C                     Z-ADD0         WDUEDY
     C                     MOVEL*BLANK    WTIMCD
     C                     SETOF                     81
     C*íºëóêÊì¸óÕâÊñ 
     C                     Z-ADD0         FLAG01  10
     C           FLAG01    DOWEQ0
     C                     EXFMTGAMEN18
     C           *IN04     IFEQ '1'
     C                     Z-ADD1         FLAG01
     C                     GOTO \SF06
     C                     ELSE
     C           *IN01     IFEQ '1'
     C                     EXSR #YUBIN
     C                     ELSE
     C           *IN03     IFEQ '1'
     C                     Z-ADD0         P#SACD            ºﬁÆÃﬁID
     C                     MOVEL*BLANK    P#SNAM            ÿ¿∞›∫∞ƒﬁ
     C                     MOVEL*BLANK    P#RECD
     C                     MOVEL*BLANK    P#ZIPC
     C                     CALL '@NA0470' PAR090           ª∂ﬁ‹∫∞ƒﬁπ›ª∏
     C                     Z-ADDP#SACD    GSAGCD
     C                     MOVELP#SNAM    GSHIP1
     C                     MOVELP#ZIPC    WZIPCD
     C                     EXSR #ZIP
     C                     ELSE
     C*
     C                     SETOF                     808190
     C           GDUEDY    IFNE 0
     C           GDUEDY    CHAINDTP1110              90
     C           *IN90     IFEQ '1'
     C                     SETON                     8081
     C                     ELSE
     C**         THOLIR    IFEQ '*'
     C**                   SETON                     8081
     C**                   ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     SETOF                     83
     C           GSAGCD    IFEQ 0
     C           GYUBIN    IFNE *BLANK
     C                     EXSR #CHKY
     C                     ELSE
     C                     SETON                     8083
     C                     ENDIF
     C                     ENDIF
     C*ç≤êÏCD
     C           GSAGCD    IFNE 0
     C                     SETOF                     8291
     C           GSAGCD    CHAINDMR0330              91
     C           *IN91     IFEQ '1'
     C                     SETON                     8082
     C                     ENDIF
     C                     ENDIF
     C*
     C           *IN80     IFEQ '0'
     C                     MOVEL*BLANK    WSHP11
     C                     MOVEL*BLANK    WSHIP1
     C                     MOVEL*BLANK    WSHIP2
     C                     MOVEL*BLANK    WSHPN1
     C                     MOVELGYUBIN    WYUBIN
     C                     MOVELGSHPNM    WSHPN1
     C                     MOVELGSHIP1    WSHIP1
     C                     MOVELGSHIP2    WSHIP2
     C                     MOVELGBUSYO    WBUSYO
     C                     MOVELGBIKO1    WBIKO1
     C                     MOVELGBIKO2    WBIKO2
     C                     MOVELGSHTEL    WSHTEL
     C                     Z-ADDGDUEDY    WDUEDY
     C                     MOVEL*BLANK    WTIMCD
     C                     Z-ADDGSAGCD    WSAGCD
     C                     GOTO \S6300
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ELSE
     C* DMR0030 ∂◊ º≠Ø∂ª∑
     C                     EXSR #MOV3
     C                     GOTO \S6300
     C                     ENDIF
0759 C*----------------------------------------------------               TR0150
0760 C           \S6300    TAG                                            TR0150
0761 C*----------------------------------------------------               TR0150
0762 C                     MOVE BUNYN6    A7                              TR0150
0763 C                     MOVE DELCD6    A3                              TR0150
     C                     MOVEL*BLANK    GSAKS7                          TR0150
     C                     EXSR #PG7
0764 C                     EXSR #SETOF                                    TR0150
0765 C                     SETON                     56                   TR0150
0766 C                     EXCPT                           GAMEN7         TR0150
0767 C                     SETOF                     56                   TR0150
0768 C                     GOTO END                                       TR0150
0769 C*****************************************************               TR0150
0770 C           \SF07     TAG                                            TR0150
0771 C*****************************************************               TR0150
0773 C                     EXSR #SETOF                                    TR0150
0774 C   KD                SETON                     55                   TR0150
0775 C   KD                EXCPT                           GAMEN6         TR0150
0776 C   KD                SETOF                     55                   TR0150
0777 C   KD                GOTO END                                       TR0150
0778 C  NKD                GOTO \S7XXX                                    TR0150
0779 C*----------------------------------------------------               TR0150
0780 C           \S7XXX    TAG                                            TR0150
0781 C*----------------------------------------------------               TR0150
0782 C                     SETOF                     848586               TR0150
0783 C                     SETOF                     878889               TR0150
     C*
     C                     MOVEL*BLANK    WELECD  1
     C                     MOVEL*BLANK    WTOKSS 11
     C                     MOVEL*BLANK    WSHICD  1
     C                     MOVEL*BLANK    WTOTAM  1
     C                     MOVEL*BLANK    WWITH   1
     C                     MOVELTOKSS7    WTOKSS
     C                     MOVE TOKSS7    WTOKS1  60
     C                     MOVELTOTAM7    WTOTAM
     C                     MOVEL*BLANK    WWITH
     C*
     C                     SELEC
     C           WCOD11    WHNE *BLANK
     C           WCOD12    ANDNE*BLANK
     C                     MOVELCODE17    WCODE7
     C*
     C           WCOD11    WHNE *BLANK
     C           WCOD12    ANDEQ*BLANK
     C                     MOVEL'0'       WCODE7
     C                     MOVE WCOD11    WCODE7
     C*
     C           WCOD11    WHEQ *BLANK
     C           WCOD12    ANDEQ*BLANK
     C                     MOVEL'0'       WCODE7
     C                     MOVE '0'       WCODE7
     C                     ENDSL
     C*
     C                     MOVELSHICD7    WSHICD
     C*
     C                     MOVELITNBR     WITNBR 25
     C                     MOVEL*BLANK    GSEBA8
     C                     SETOF                     90
     C           WITNBR    CHAINDTR2060X             90
     C           *IN90     IFEQ '0'
     C*
     C                     SELEC
     C           TSEBS     WHEQ ' '
     C*
     C           SEBAS     IFNE ' '
     C                     MOVELSEBAS     GSEBA8
     C                     ELSE
     C                     MOVEL'O'       GSEBA8
     C                     ENDIF
     C           TSEBS     WHEQ 'K'
     C                     MOVEL'K'       GSEBA8
     C           TSEBS     WHEQ 'O'
     C                     MOVEL'O'       GSEBA8
     C*
     C                     ENDSL
     C*
     C                     ELSE
     C                     EXSR #PLACE
     C                     ENDIF
     C*-----------------------------------------------------
     C           CODE17    IFGE '00'
     C           CODE17    ANDLE'99'
     C           CODE17    OREQ *BLANK
     C                     ELSE
     C                     GOTO END
     C                     ENDIF
     C*
0784 C           QUANT7    COMP 0                    848485               TR0150
0785 C   85                SETON                     8082                 TR0150
0786 C   85                GOTO \S7100                                    TR0150
0787 C   84                GOTO \S7100                                    TR0150
0788 C*----------------------------------------------------               TR0150
0789 C           \S7100    TAG                                            TR0150
0790 C*----------------------------------------------------               TR0150
0791 C                     SETOF                     848586               TR0150
0792 C                     SETOF                     878889               TR0150
0793 C           A1        COMP 'A'                  848485               TR0150
0794 C   84                GOTO \S7200                                    TR0150
0795 C   85                GOTO \S7110                                    TR0150
0796 C*----------------------------------------------------               TR0150
0797 C           \S7110    TAG                                            TR0150
0798 C*----------------------------------------------------               TR0150
     C                     MOVEL*BLANK    WITNB7 25
     C                     SETOF                     90
     C           ITNB17    CHAINDMR0070              90
     C           *IN90     IFEQ '0'
     C           REMAK     IFEQ 'D'
     C                     GOTO \S7111
     C                     ELSE
     C                     Z-ADD1         A6
     C                     MOVELNITNB     ITNB17
     C                     MOVELNITNB     ITNBR7
     C                     GOTO \S7111
     C                     ENDIF
     C                     ELSE
     C                     MOVELITNB17    ITNB17
     C                     MOVELITNB17    ITNBR7
     C                     GOTO \S7111
     C                     ENDIF
0796 C*----------------------------------------------------               TR0150
0797 C           \S7111    TAG                                            TR0150
0798 C*----------------------------------------------------               TR0150
     C           CUSNR2    IFEQ '0X 00'
     C           CUSNR2    OREQ '0X 01'
     C           CUSNR2    OREQ '0X 02'
0799 C                     SETOF                     9596                 TR0150
0800 C           ITNB17    CHAINDMR0040              95                   TR0150
0801 C   95                SETON                     8081                 TR0150
0802 C   95                GOTO \S7200                                    TR0150
0802 C  N95                GOTO \S7200                                    TR0150
     C                     ELSE
     C*
0799 C                     SETOF                     9596                 TR0150
0800 C           ITNB17    CHAINDMR0040              95                   TR0150
0801 C   95                SETON                     8081                 TR0150
     C   95                MOVEL*BLANK    WELECD  1
0802 C   95                GOTO \S7200                                    TR0150
     C  N95                MOVELITNB17    P#ITDS
     C  N95                Z-ADDDCODEG    P#DCOD
     C  N95                MOVEL*BLANK    P#RECD                           *  +
     C  N95                CALL '@NA0450' PAR060           Ω”∞Ÿ@∂∏∆›
     C*
     C           P#RECD    IFEQ 'NG'
0801 C                     SETON                     8081                 TR0150
     C                     MOVEL*BLANK    WELECD  1
0802 C                     GOTO \S7200                                    TR0150
     C                     ELSE
0803 C                     SETOF                     81                   TR0150
     C                     MOVELELECDJ    WELECD
0804 C                     GOTO \S7200                                    TR0150
     C                     ENDIF
     C                     ENDIF
0805 C*----------------------------------------------------               TR0150
0806 C           \S7200    TAG                                            TR0150
0807 C*----------------------------------------------------               TR0150
     C                     SETOF                     90
     C           ITNB17    CHAINDMR0040              90
     C           *IN90     IFEQ '0'
     C                     MOVELLCLASJ    GLCLA7
     C                     MOVELSCLASJ    GSCLA7
     C*-----
     C           WKCUS2    IFNE '0X'
     C           SOTCDX    IFGE '1'
     C           SOTCDX    ANDLE'9'
     C*
     C           EXPANJ    IFEQ 0
     C                     SETON                     8081                 TR0150
     C                     ENDIF
     C*
     C                     ELSE
     C           SOTCDX    IFNE 'E'
     C           EXPANJ    IFEQ 1
     C                     SETON                     8081                 TR0150
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*-----
     C           WSLNR2    IFEQ 999
     C           BEACDJ    IFNE ' '
     C                     SETON                     8081
     C                     ENDIF
     C                     ENDIF
     C*-----
     C                     ENDIF
     C*
     C           DOJCD3    IFEQ '*'
     C           GTRACE    IFEQ '* '
     C                     SETON                     80
     C                     ENDIF
     C                     ENDIF
     C*
     C                     SETOF                     8384
     C           INPN15    IFEQ 'A'
     C           INPN25    ANDEQ1
     C           REJETJ    IFNE ' '
     C                     SETON                     8083   ≤∑
     C                     ENDIF
     C* ƒŸ∏æØƒ¡∂∏∆›
     C           W261      IFNE 'TK'                       œ¬¿ﬁ ºﬁÆ∂ﬁ≤
     C           W26       IFEQ 'T'
     C*
     C           WTOKSS    IFNE *BLANK
     C           WTOTAM    ANDNE*BLANK
     C                     SETOF                     87
     C                     EXSR #RTN5
     C                     ELSE
     C                     SETON                     8087
     C                     ENDIF
     C*
     C                     ELSE
     C*
     C           WTOKSS    IFNE *BLANK
     C           WTOTAM    ANDNE*BLANK
     C                     SETOF                     87
     C                     EXSR #RTN5
     C                     ELSE
     C***                  SETON                     8087
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     MOVELITNB17    WITNBR 25
     C*----------------------------
     C                     SELEC
     C           WELECD    WHEQ '@'
     C                     MOVELWELECD    W26              √ﬁ›ºæ≤À›
     C           WELECD    WHEQ '#'
     C           WKCUS     ANDEQ'0'
     C                     MOVELWELECD    W26               ﬂ⁄Øƒ
     C                     ENDSL
     C*--------------------------
     C                     MOVEL*BLANK    GSEBA8
     C                     Z-ADD0         WKSMAL  51
     C                     SETOF                     90
     C           WITNBR    CHAINDTR2060X             90
     C           *IN90     IFEQ '0'
     C*
     C           ACNTE     ADD  ACNEE     WKSMAL
     C*
     C                     SELEC
     C           TSEBS     WHEQ ' '
     C*
     C           SEBAS     IFNE ' '
     C                     MOVELSEBAS     GSEBA8
     C                     ELSE
     C                     MOVEL'O'       GSEBA8
     C                     ENDIF
     C*
     C           TSEBS     WHEQ 'K'
     C                     MOVEL'K'       GSEBA8
     C           TSEBS     WHEQ 'O'
     C                     MOVEL'O'       GSEBA8
     C                     ENDSL
     C*
     C                     ELSE
     C                     EXSR #PLACE
     C                     ENDIF
0807 C*----------------------------------------------------               TR0150
     C           INPN15    IFEQ 'A'
0808 C                     SETOF                     848586               TR0150
0809 C           SIKOMJ    COMP 0                    848485               TR0150
0810 C   84                SETON                     8081                 TR0150
0811 C   84                GOTO \S73XY                                    TR0150
0812 C   85                GOTO \S73XY                                    TR0150
     C                     ENDIF
     C*
0813 C           \S73XY    TAG                                            TR0150
0814 C   80                GOTO \S7300                                    TR0150
0815 C  N80                GOTO \S7400                                    TR0150
0816 C*----------------------------------------------------               TR0150
0817 C           \S7300    TAG                                            TR0150
0818 C*----------------------------------------------------               TR0150
     C                     MOVEL*BLANK    GSAKS7
     C                     EXSR #PG7
0819 C                     SETON                     56                   TR0150
0820 C                     EXCPT                           GAMEN7         TR0150
0821 C                     SETOF                     56                   TR0150
0822 C                     GOTO END                                       TR0150
0823 C*----------------------------------------------------               TR0150
0824 C           \S7400    TAG                                            TR0150
0825 C*----------------------------------------------------               TR0150
     C*DTR0020 CHECK
     C                     SETOF                     80
     C                     MOVELCUSNR2    P#CUSN
     C                     MOVELORDNO3    P#ODNO
     C                     MOVELA1        P#ITTP
     C                     MOVELITCODJ    P#ITCD
     C                     MOVELITNBR7    P#ITDS
     C                     MOVEL*BLANK    P#RECD
     C                     CALL '@NA0490' PAR100
     C           P#RECD    IFEQ 'NG'
     C                     SETON                     80
     C                     ELSE
     C                     SETOF                     80
     C                     ENDIF
     C*
     C*  /* ƒŸ∏æØƒ À›“≤ÀÆ≥∑ 10/12/13 Õ›∫≥ */
     C*
     C           INPN15    IFEQ 'A'
     C           TOTAM7    IFNE *BLANK                     ƒŸ∏¿›≤
     C           TOKSS7    ANDNE*BLANK                     ƒŸ∏±¿≤
     C                     MOVEL'T'       W26
     C                     MOVELTOKSS7    WKTOK4
     C                     ENDIF
     C                     ENDIF
     C*
0826 C                     Z-ADD0         E       50                      TR0150
     C                     Z-ADD0         F       50                      TR0150
0828 C                     Z-ADD0         G       70                      TR0150
0829 C                     Z-ADD0         H       90                      TR0150
     C* /*  ﬂ-¬  À›“≤ */
     C                     EXSR #RTN1
     C*
0830 C                     SETOF                     848586               TR0150
0831 C                     SETOF                     878889               TR0150
0832 C           A1        IFEQ 'A'                                       TR0150
0834 C                     GOTO \S7500                                    TR0150
     C                     ELSE
0832 C           A1        IFEQ 'B'                                       TR0150
     C                     SETOF                     90
     C           WITNBR    CHAINDMR0040              90
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         X
     C                     Z-ADDDCODEG    X
0884 C           X         IFEQ 0                                         TR0150
     C                     Z-ADD1         X
     C                     ENDIF
0833 C                     GOTO \S7561                                    TR0150
     C                     ELSE
0833 C                     GOTO \S7600                                    TR0150
     C                     ENDIF
     C                     ELSE
0833 C                     GOTO \S7600                                    TR0150
     C                     ENDIF
     C                     ENDIF
0835 C*----------------------------------------------------               TR0150
0836 C           \S7500    TAG                                            TR0150
0837 C*----------------------------------------------------               TR0150
0838 C                     SETOF                     959697               TR0150
0839 C           ITCODJ    CHAINDTR0010              95                   TR0150
0840 C   95                SETON                     H1                   TR0150
0841 C  N95                GOTO \S7510                                    TR0150
0842 C*----------------------------------------------------               TR0150
0843 C           \S7510    TAG                                            TR0150
0844 C*----------------------------------------------------               TR0150
0845 C                     Z-ADD0         R       70                      TR0150
0846 C                     Z-ADD0         S       70                      TR0150
     C*
     C           QUANT7    IFGT WKSMAL
0850 C                     GOTO \S7520                                    TR0150
     C                     ELSE
     C                     ENDIF
     C*
0847 C           QTYOHK    SUB  QTYOTK    R                               TR0150
0848 C                     SETOF                     848586               TR0150
0849 C           R         COMP 0                    848585               TR0150
0850 C   85                GOTO \S7520                                    TR0150
0851 C   84                GOTO \S7530                                    TR0150
0852 C*----------------------------------------------------               TR0150
0853 C           \S7530    TAG                                            TR0150
0854 C*----------------------------------------------------               TR0150
0855 C           R         SUB  QUANT7    S                               TR0150
0856 C                     SETOF                     848586               TR0150
0857 C           S         COMP 0                    848584               TR0150
0858 C   85                GOTO \S7540                                    TR0150
0859 C   84                GOTO \S7550                                    TR0150
0860 C*----------------------------------------------------               TR0150
0861 C           \S7520    TAG                                            TR0150
0862 C*----------------------------------------------------               TR0150
0863 C                     Z-ADDQUANT7    F                               TR0150
0864 C                     GOTO \S7560                                    TR0150
0865 C*----------------------------------------------------               TR0150
0866 C           \S7540    TAG                                            TR0150
0867 C*----------------------------------------------------               TR0150
0868 C                     Z-ADDR         E                               TR0150
0869 C                     Z-SUBS         I       50                      TR0150
0870 C                     Z-ADDI         F                               TR0150
0871 C                     GOTO \S7560                                    TR0150
0872 C*----------------------------------------------------               TR0150
0873 C           \S7550    TAG                                            TR0150
0874 C*----------------------------------------------------               TR0150
0875 C                     Z-ADDQUANT7    E                               TR0150
0876 C                     GOTO \S7560                                    TR0150
0877 C*----------------------------------------------------               TR0150
0878 C           \S7560    TAG                                            TR0150
0879 C*----------------------------------------------------               TR0150
0880 C                     Z-ADD1         X       20                      TR0150
0881 C                     Z-ADDDCODEG    X                               TR0150
0882 C                     SETOF                     848586               TR0150
0883 C           X         COMP 0                    848485               TR0150
0884 C   85                Z-ADD1         X                               TR0150
0885 C   85                GOTO \S7561                                    TR0150
0886 C   84                GOTO \S7561                                    TR0150
0887 C*----------------------------------------------------               TR0150
0888 C           \S7561    TAG                                            TR0150
0889 C*----------------------------------------------------               TR0150
0890 C                     SETOF                     848586               TR0150
0891 C           X         COMP 01                   848485               TR0150
0892 C   85                GOTO \S7710                                    TR0150
0893 C   84                GOTO \S7810                                    TR0150
0894 C           \S7810    TAG                                            TR0150
0895 C                     SETOF                     848586               TR0150
0896 C           X         COMP 02                   848485               TR0150
0897 C   85                GOTO \S7720                                    TR0150
0898 C   84                GOTO \S7820                                    TR0150
0899 C           \S7820    TAG                                            TR0150
0900 C                     SETOF                     848586               TR0150
0901 C           X         COMP 03                   848485               TR0150
0902 C   85                GOTO \S7730                                    TR0150
0903 C   84                GOTO \S7830                                    TR0150
0904 C           \S7830    TAG                                            TR0150
0905 C                     SETOF                     848586               TR0150
0906 C           X         COMP 04                   848485               TR0150
0907 C   85                GOTO \S7740                                    TR0150
0908 C   84                GOTO \S7840                                    TR0150
0909 C           \S7840    TAG                                            TR0150
0910 C                     SETOF                     848586               TR0150
0911 C           X         COMP 05                   848485               TR0150
0912 C   85                GOTO \S7750                                    TR0150
0913 C   84                GOTO \S7850                                    TR0150
0914 C           \S7850    TAG                                            TR0150
0915 C                     SETOF                     848586               TR0150
0916 C           X         COMP 06                   848485               TR0150
0917 C   85                GOTO \S7760                                    TR0150
0918 C   84                GOTO \S7860                                    TR0150
0919 C           \S7860    TAG                                            TR0150
0920 C                     SETOF                     848586               TR0150
0921 C           X         COMP 07                   848485               TR0150
0922 C   85                GOTO \S7770                                    TR0150
0923 C   84                GOTO \S7870                                    TR0150
0924 C           \S7870    TAG                                            TR0150
0925 C                     SETOF                     848586               TR0150
0926 C           X         COMP 08                   848485               TR0150
     C   85                GOTO \S7780                                    TR0150
0928 C   84                GOTO \S7880                                    TR0150
0929 C           \S7880    TAG                                            TR0150
0930 C                     SETOF                     848586               TR0150
0931 C           X         COMP 09                   848485               TR0150
0932 C   85                GOTO \S7790                                    TR0150
0933 C   84                GOTO \S7890                                    TR0150
0934 C           \S7890    TAG                                            TR0150
0935 C                     SETOF                     848586               TR0150
0936 C           X         COMP 10                   848485               TR0150
0937 C   85                GOTO \S77A0                                    TR0150
     C*93/09/09 ¬≤∂
     C   84                GOTO \S78A0
     C           \S78A0    TAG
     C                     SETOF                     848586
     C           X         COMP 11                   848485
     C   85                GOTO \S77B0
     C   84                GOTO \S78B0
     C           \S78B0    TAG
     C                     SETOF                     848586
     C           X         COMP 12                   848485
     C   85                GOTO \S77C0
     C   84                GOTO \S78C0
     C           \S78C0    TAG
     C                     SETOF                     848586
     C           X         COMP 13                   848485
     C   85                GOTO \S77D0
     C   84                GOTO \S78D0
     C           \S78D0    TAG
     C                     SETOF                     848586
     C           X         COMP 14                   848485
     C   85                GOTO \S77E0
     C   84                GOTO \S78E0
     C           \S78E0    TAG
     C                     SETOF                     848586
     C           X         COMP 15                   848485
     C   85                GOTO \S77F0
     C   84                GOTO \S78F0
     C           \S78F0    TAG
     C                     SETOF                     848586
     C           X         COMP 16                   848485
     C   85                GOTO \S77G0
     C   84                GOTO \S78G0
     C           \S78G0    TAG
     C                     SETOF                     848586
     C           X         COMP 17                   848485
     C   85                GOTO \S77H0
     C*
0938 C   84                SETON                     H4                   TR0150
0939 C           \S7710    TAG                                            TR0150
0940 C                     Z-ADDUPD01J    G                               TR0150
0941 C                     GOTO \S7900                                    TR0150
0942 C           \S7720    TAG                                            TR0150
0943 C                     Z-ADDUPD02J    G                               TR0150
0944 C                     GOTO \S7900                                    TR0150
0945 C           \S7730    TAG                                            TR0150
0946 C                     Z-ADDUPD03J    G                               TR0150
0947 C                     GOTO \S7900                                    TR0150
0948 C           \S7740    TAG                                            TR0150
0949 C                     Z-ADDUPD04J    G                               TR0150
0950 C                     GOTO \S7900                                    TR0150
0951 C           \S7750    TAG                                            TR0150
0952 C                     Z-ADDUPD05J    G                               TR0150
0953 C                     GOTO \S7900                                    TR0150
0954 C           \S7760    TAG                                            TR0150
0955 C                     Z-ADDUPD06J    G                               TR0150
0956 C                     GOTO \S7900                                    TR0150
0957 C           \S7770    TAG                                            TR0150
0958 C                     Z-ADDUPD07J    G                               TR0150
0959 C                     GOTO \S7900                                    TR0150
0960 C           \S7780    TAG                                            TR0150
0961 C                     Z-ADDUPD08J    G                               TR0150
0962 C                     GOTO \S7900                                    TR0150
0963 C           \S7790    TAG                                            TR0150
0964 C                     Z-ADDUPD09J    G                               TR0150
0965 C                     GOTO \S7900                                    TR0150
0966 C           \S77A0    TAG                                            TR0150
0967 C                     Z-ADDUPD10J    G                               TR0150
0968 C                     GOTO \S7900                                    TR0150
     C*93/09/09 ¬≤∂
0939 C           \S77B0    TAG                                            TR0150
0940 C                     Z-ADDUPD11J    G                               TR0150
0941 C                     GOTO \S7900                                    TR0150
0942 C           \S77C0    TAG                                            TR0150
0943 C                     Z-ADDUPD12J    G                               TR0150
0944 C                     GOTO \S7900                                    TR0150
0945 C           \S77D0    TAG                                            TR0150
0946 C                     Z-ADDUPD13J    G                               TR0150
0947 C                     GOTO \S7900                                    TR0150
0948 C           \S77E0    TAG                                            TR0150
0949 C                     Z-ADDUPD14J    G                               TR0150
0950 C                     GOTO \S7900                                    TR0150
0951 C           \S77F0    TAG                                            TR0150
0952 C                     Z-ADDUPD15J    G                               TR0150
0953 C                     GOTO \S7900                                    TR0150
0954 C           \S77G0    TAG                                            TR0150
0955 C                     Z-ADDUPD16J    G                               TR0150
0956 C                     GOTO \S7900                                    TR0150
0957 C           \S77H0    TAG                                            TR0150
0958 C                     Z-ADDUPD17J    G                               TR0150
0959 C                     GOTO \S7900                                    TR0150
     C*
0969 C           \S7900    TAG                                            TR0150
     C           CUSNR2    IFEQ '0X 00'
     C           CUSNR2    OREQ '0X 01'
     C           CUSNR2    OREQ '0X 02'
     C                     Z-ADD0         G
     C                     ENDIF
     C*
0970 C           G         ADD  WTANKM    G                               TR0150
0970 C           QUANT7    MULT G         H                               TR0150
0971 C                     GOTO \S7600                                    TR0150
0972 C*----------------------------------------------------               TR0150
0973 C           \S7600    TAG                                            TR0150
0974 C*----------------------------------------------------               TR0150
     C                     MOVEL*BLANK    P#RTC1
     C                     SETOF                     28
     C           A1        IFEQ 'E'
     C           A2        IFEQ 0
     C           GSAKS7    IFEQ ' '
     C                     EXSR #PART
     C                     SETON                     99
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*ÉTÉuÉãÅ[É`ÉììríÜÇ≈î≤ÇØÇΩÇÁRTC1=1
     C           P#RTC1    IFEQ '1'
     C                     Z-ADDP#TANK    TANKA8
     C                     Z-ADDP#KING    KINGA8
     C                     GOTO \S8XX1
     C                     ELSE
     C*ÉTÉuÉãÅ[É`Éìí ÇÍÇŒ28 ON
     C           *IN28     IFEQ '1'
     C                     MOVELP#JUNO    WJUTN1  60
     C                     MOVE P#RJUN    WSEQNO
1731 C                     SETON                     94
     C                     EXCPT                           àÛç¸
     C                     SETOF                     94
     C                     SETON                     99
     C                     GOTO \SC111
     C                     ENDIF
     C                     ENDIF
     C*âÊñ ÇWï\é¶
0975 C                     EXSR #SETOF                                    TR0150
     C                     EXSR #REP                                      TR0150
     C                     MOVELGLCLA7    WLCLA7
     C                     MOVELGSCLA7    WSCLA7
     C*
     C           P#RECD    IFEQ 'NG'
     C                     SETON                     80
     C                     ELSE
     C                     SETOF                     80
     C                     ENDIF
     C*
0976 C                     SETON                     57                   TR0150
0977 C                     EXCPT                           GAMEN8         TR0150
0978 C                     SETOF                     57                   TR0150
0979 C                     GOTO END                                       TR0150
0980 C*****************************************************               TR0150
0981 C           \SF08     TAG                                            TR0150
0982 C*****************************************************               TR0150
0984 C                     EXSR #SETOF                                    TR0150
0985 C   KD                GOTO \S8XX1                                    TR0150
0986 C  NKD                GOTO \S8XXX                                    TR0150
0987 C*----------------------------------------------------               TR0150
0988 C           \S8XX1    TAG                                            TR0150
0989 C*----------------------------------------------------               TR0150
0990 C                     SETOF                     848586               TR0150
0991 C           A1        COMP 'A'                  848485               TR0150
0992 C   85                SETON                     78                   TR0150
0993 C   85                EXCPT                                          TR0150
0994 C   85                SETOF                     78                   TR0150
0995 C   85                GOTO \S8XX2                                    TR0150
0996 C   84                GOTO \S8XX2                                    TR0150
0997 C*----------------------------------------------------               TR0150
0998 C           \S8XX2    TAG                                            TR0150
0999 C*----------------------------------------------------               TR0150
1000 C                     SETOF                     848586               TR0150
1001 C           KINGA8    COMP 0                    848485               TR0150
1002 C   85                Z-ADDTANKA8    G                               TR0150
1003 C   85      G         MULT QUANT7    H                               TR0150
1004 C   85                GOTO \S8001                                    TR0150
1005 C   84                Z-ADDTANKA8    G                               TR0150
1006 C   84                Z-ADDKINGA8    H                               TR0150
1007 C   84                GOTO \S8001                                    TR0150
1008 C           \S8001    TAG                                            TR0150
1009 C                     EXSR #SETOF                                    TR0150
     C                     MOVEL*BLANK    GSAKS7
     C                     MOVEL*BLANK    TOTAM7
     C                     MOVEL*BLANK    CODE17
     C                     MOVEL*BLANK    TOKSS7
     C                     EXSR #PG7
1010 C                     SETON                     56                   TR0150
1011 C                     EXCPT                           GAMEN7         TR0150
1012 C                     SETOF                     56                   TR0150
1013 C                     GOTO END                                       TR0150
1014 C*----------------------------------------------------               TR0150
1015 C           \S8XXX    TAG                                            TR0150
1016 C*----------------------------------------------------               TR0150
1017 C                     SETOF                     848586               TR0150
1018 C                     SETOF                     878889               TR0150
1019 C           INPNM8    COMP 0                    848485               TR0150
1020 C   85                GOTO \S8100                                    TR0150
1021 C   84      INPNM8    COMP 1                    848486               TR0150
1022 C   86      E         ADD  F         F                               TR0150
1023 C   86                Z-ADD0         E                               TR0150
1024 C   86                GOTO \S8100                                    TR0150
1025 C   84                SETON                     8081                 TR0150
1026 C   84                GOTO \S8100                                    TR0150
     C*----------------------------------------------------               TR0150
1028 C           \S8100    TAG                                            TR0150
1029 C*----------------------------------------------------               TR0150
     C   80                MOVELGLCLA7    WLCLA7
     C   80                MOVELGSCLA7    WSCLA7
     C   80                EXSR #REP
1030 C   80                SETON                     57                   TR0150
1031 C   80                EXCPT                           GAMEN8         TR0150
1032 C   80                SETOF                     57                   TR0150
1033 C   80                GOTO END                                       TR0150
1034 C  N80                GOTO \S8200                                    TR0150
1035 C*----------------------------------------------------               TR0150
1036 C           \S8200    TAG                                            TR0150
1037 C*----------------------------------------------------               TR0150
1038 C                     SETOF                     848586               TR0150
1039 C                     SETOF                     878889               TR0150
1040 C           TANKA8    COMP G                    848485               TR0150
1041 C   85                GOTO \S8210                                    TR0150
1042 C   84                GOTO \S8220                                    TR0150
1043 C           \S8210    TAG                                            TR0150
1044 C                     SETOF                     848586               TR0150
1045 C           KINGA8    COMP H                    848485               TR0150
1046 C   85                GOTO \S8300                                    TR0150
1047 C   84                GOTO \S8230                                    TR0150
1048 C           \S8220    TAG                                            TR0150
1049 C                     SETOF                     848586               TR0150
1050 C           KINGA8    COMP H                    848485               TR0150
1051 C   85                GOTO \S8240                                    TR0150
1052 C   84                GOTO \S8250                                    TR0150
1053 C           \S8230    TAG                                            TR0150
1054 C                     Z-ADDKINGA8    H                               TR0150
1055 C                     GOTO \S8300                                    TR0150
1056 C           \S8240    TAG                                            TR0150
1057 C                     Z-ADDTANKA8    G                               TR0150
1058 C           G         MULT QUANT7    H                               TR0150
1059 C                     GOTO \S8300                                    TR0150
1060 C           \S8250    TAG                                            TR0150
1061 C                     Z-ADDTANKA8    G                               TR0150
1062 C                     Z-ADDKINGA8    H                               TR0150
1063 C                     GOTO \S8300                                    TR0150
1064 C*----------------------------------------------------               TR0150
1065 C           \S8300    TAG                                            TR0150
1066 C*----------------------------------------------------               TR0150
     C           GSEBA8    IFEQ ' '
     C           GSEBA8    ANDNE'O'
     C           GSEBA8    ANDNE'K'
     C           GSEBA8    ANDNE'C'
     C                     MOVELGLCLA7    WLCLA7
     C                     MOVELGSCLA7    WSCLA7
     C                     EXSR #REP
0500 C                     SETON                     57                   TR0150
0501 C                     EXCPT                           GAMEN8         TR0150
0502 C                     SETOF                     57                   TR0150
0503 C                     GOTO END                                       TR0150
     C                     ENDIF
     C*
1067 C                     EXSR #SETOF                                    TR0150
     C                     MOVELGLCLA7    WLCLA7
     C                     MOVELGSCLA7    WSCLA7
     C*
     C           P#RECD    IFEQ 'NG'
     C                     SETON                     80
     C                     ELSE
     C                     SETOF                     80
     C                     ENDIF
     C*
1068 C                     SETON                     58                   TR0150
1069 C                     EXCPT                           GAMEN9         TR0150
1070 C                     SETOF                     58                   TR0150
1071 C                     GOTO END                                       TR0150
1072 C*****************************************************               TR0150
1073 C           \SF09     TAG                                            TR0150
1074 C*****************************************************               TR0150
1076 C                     EXSR #SETOF                                    TR0150
1077 C   KD                GOTO \S9XX1                                    TR0150
1078 C  NKD                GOTO \S9XXX                                    TR0150
1079 C*----------------------------------------------------               TR0150
1080 C           \S9XX1    TAG                                            TR0150
1081 C*----------------------------------------------------               TR0150
1082 C                     GOTO \S9XX2                                    TR0150
1083 C*----------------------------------------------------               TR0150
1084 C           \S9XX2    TAG                                            TR0150
1085 C*----------------------------------------------------               TR0150
1086 C                     EXSR #SETOF                                    TR0150
     C                     MOVEL*BLANK    AIRCD8
     C                     MOVELGLCLA7    WLCLA7
     C                     MOVELGSCLA7    WSCLA7
     C                     EXSR #REP
1087 C                     SETON                     57                   TR0150
1088 C                     EXCPT                           GAMEN8         TR0150
1089 C                     SETOF                     57                   TR0150
1090 C                     GOTO END                                       TR0150
1091 C*----------------------------------------------------               TR0150
1092 C           \S9XXX    TAG                                            TR0150
1093 C*----------------------------------------------------               TR0150
1097 C           A1        IFEQ 'B'                                       TR0150
1097 C           A1        OREQ 'C'                                       TR0150
1097 C           A1        OREQ 'D'                                       TR0150
     C*  ƒ∏º≠À›…  ﬁ±≤À›”∏∫∞ƒﬁ
     C*
0832 C           A1        IFEQ 'B'                                       TR0150
     C                     SETOF                     90
     C           WITNBR    CHAINDMR0040              90
     C           *IN90     IFEQ '0'
     C                     MOVELITCODJ    L
     C                     ELSE
1094 C                     MOVEL'00000000'L      14                       TR0150
1094 C                     MOVE '000000'  L                               TR0150
     C                     ENDIF
     C                     ELSE
1094 C                     MOVEL'00000000'L                               TR0150
1094 C                     MOVE '000000'  L                               TR0150
     C                     ENDIF
     C*
     C                     ENDIF
     C*
1095 C                     SETOF                     848586               TR0150
1096 C                     SETOF                     878889               TR0150
1097 C           A1        COMP 'B'                  848485               TR0150
1098 C   85                GOTO \S9100                                    TR0150
1099 C   84      A1        COMP 'E'                  848486               TR0150
1100 C   86                GOTO \S9200                                    TR0150
1101 C   84                GOTO \S9300                                    TR0150
1102 C*----------------------------------------------------               TR0150
1103 C           \S9100    TAG                                            TR0150
1104 C*----------------------------------------------------               TR0150
1106 C                     EXSR #SETOF                                    TR0150
1107 C                     MOVE '      '  AAA     6                       TR0150
1108 C                     SETOF                     848586               TR0150
1109 C                     MOVE ' '       XXX     1                       TR0150
1110 C                     MOVELCUNR12    XXX                             TR0150
1111 C                     SETOF                     848586               TR0150
1112 C                     SETOF                     95                   TR0150
1113 C           1         CHAINDTR0060              95                   TR0150
1114 C   95                SETON                     H1                   TR0150
1115 C  N95                GOTO \S9YY1                                    TR0150
1116 C*----------------------------------------------------               TR0150
1117 C           \S9YY1    TAG                                            TR0150
1118 C*----------------------------------------------------               TR0150
1119 C                     Z-ADD0         BBB     40                      TR0150
1120 C                     Z-ADD0         CCC     40                      TR0150
     C                     Z-ADD0         FLAG99  10
     C*
     C                     SETOF                     9091
     C           MSG3      IFEQ 'ø … ¿'                    EÇÃèÍçá
     C           2         CHAINDTR0060              90
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         FLAG99
     C*--------------------------------------------------
     C           BCNTEP    IFEQ 0
     C           1         ADD  BCNTEP    BCNTEP
     C                     ENDIF
     C           ECNTEP    IFEQ 0
     C           1         ADD  ECNTEP    ECNTEP
     C                     ENDIF
     C*--------------------------------------------------
     C*
1121 C                     Z-ADDBCNTEP    BBB                             TR0150
1122 C                     Z-ADDECNTEP    CCC                             TR0150
     C                     ENDIF
     C*
     C                     ELSE                            BÇÃèÍçá
     C           1         CHAINDTR0060              91
     C           *IN91     IFEQ '0'
     C*--------------------------------------------------
     C           BCNTEP    IFEQ 0
     C           1         ADD  BCNTEP    BCNTEP
     C                     ENDIF
     C           ECNTEP    IFEQ 0
     C           1         ADD  ECNTEP    ECNTEP
     C                     ENDIF
     C*--------------------------------------------------
     C                     Z-ADD2         FLAG99
1121 C                     Z-ADDBCNTEP    BBB                             TR0150
1122 C                     Z-ADDECNTEP    CCC                             TR0150
     C                     ENDIF
     C                     ENDIF
     C*
     C*
     C                     SELEC
1124 C           XXX       WHEQ '0'                                       TR0150
     C                     SELEC
     C           FLAG99    WHEQ 1
1125 C                     MOVEL'PB'      AAA                             TR0150
     C           FLAG99    WHEQ 2
1125 C                     MOVEL'B '      AAA                             TR0150
     C                     ENDSL
     C*
1126 C                     MOVE BCNTEP    AAA                             TR0150
     C           1         ADD  BBB       BBB                             TR0150
     C*----------------------------------------------
     C                     SETOF                     95
     C           D0050     CHAINDTR0058              95
     C           *IN95     IFEQ '0'
     C*DTR0060 UPDATE
1134 C                     SETON                     49                   TR0150
1135 C                     EXCPT                                          TR0150
1136 C                     SETOF                     49                   TR0150
     C*
1132 C                     GOTO \S9YY1                                    TR0150
     C                     ENDIF
     C*----------------------------------------------
1128 C                     GOTO \S9YY2                                    TR0150
     C           XXX       WHNE '0'
     C*
     C                     SELEC
     C           FLAG99    WHEQ 1
1125 C                     MOVEL'PE'      AAA                             TR0150
     C           FLAG99    WHEQ 2
1125 C                     MOVEL'E '      AAA                             TR0150
     C                     ENDSL
     C*
1130 C                     MOVE ECNTEP    AAA                             TR0150
1131 C           1         ADD  CCC       CCC                             TR0150
     C*----------------------------------------------
     C                     SETOF                     95
     C           D0050     CHAINDTR0058              95
     C           *IN95     IFEQ '0'
     C*DTR0060 UPDATE
1134 C                     SETON                     49                   TR0150
1135 C                     EXCPT                                          TR0150
1136 C                     SETOF                     49                   TR0150
     C*
1132 C                     GOTO \S9YY1                                    TR0150
     C                     ENDIF
     C*----------------------------------------------
1132 C                     GOTO \S9YY2                                    TR0150
     C                     ENDSL
     C*DTR0060 UPDATE
1133 C           \S9YY2    TAG                                            TR0150
1134 C                     SETON                     49                   TR0150
1135 C                     EXCPT                                          TR0150
1136 C                     SETOF                     49                   TR0150
     C*   ﬂ∞¬ñºÇ»Ç«ÇÃ∆≠≥ÿÆ∏ GAMEN13
     C                     EXSR #RTN3                       ﬂ∞¬ñºÇ»Ç«
     C*
     C                     MOVELITNBR7    WITN25 25
     C                     MOVEL' '       P#RTC3
     C                     SETOF                     90
     C           WITN25    CHAINDMR0171              90
     C           *IN90     IFEQ '0'
     C                     EXSR #GA13
     C                     ENDIF
     C*ÉTÉuRTNí Ç¡ÇΩÇÁRTC3=2
     C           P#RTC3    IFEQ '2'
     C                     GOTO \SC111
     C                     ELSE
     C*âÊñ ÇPÇRï\é¶B-1
     C                     MOVEL*BLANK    GBUKUM
1137 C                     SETON                     62                   TR0150
1138 C                     EXCPT                                          TR0150
1139 C                     SETOF                     62                   TR0150
1140 C                     GOTO END                                       TR0150
     C                     ENDIF
1141 C*----------------------------------------------------               TR0150
1142 C           \S9200    TAG                                            TR0150
1143 C*----------------------------------------------------               TR0150
1144 C                     EXSR #SETOF                                    TR0150
1145 C                     SETON                     65                   TR0150
1146 C                     EXCPT                                          TR0150
1147 C                     SETOF                     65                   TR0150
1148 C                     GOTO END                                       TR0150
1149 C*----------------------------------------------------               TR0150
1150 C           \S9300    TAG                                            TR0150
1151 C*----------------------------------------------------               TR0150
1152 C                     SETOF                     848586               TR0150
1153 C                     SETOF                     878889               TR0150
1154 C           A1        COMP 'A'                  848485               TR0150
1155 C   84                GOTO \S9400                                    TR0150
1156 C   85                GOTO \S9500                                    TR0150
1157 C*----------------------------------------------------               TR0150
1158 C           \S9400    TAG                                            TR0150
1159 C*----------------------------------------------------               TR0150
1160 C                     Z-ADD0         J       80                      TR0150
1161 C                     MOVELA         J                               TR0150
1162 C                     MOVE Z2        J                               TR0150
1163 C                     SETOF                     9596                 TR0150
1164 C           J         CHAINDTR0020              95                   TR0150
1165 C   95                GOTO \S9410                                    TR0150
1166 C  N95                GOTO \S9411                                    TR0150
1167 C*----------------------------------------------------               TR0150
1168 C           \S9410    TAG                                            TR0150
1169 C*----------------------------------------------------               TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8  80
     C                     Z-ADD*DATE     WREDY8  80
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8  80
     C                     ENDIF
     C*0020 WRITE
     C                     EXSR #TRS
1170 C                     SETON                     77                   TR0150
1171 C                     EXCPT                                          TR0150
1172 C                     SETOF                     77                   TR0150
     C                     EXSR #DOJ
     C*
1173 C                     MOVE 01        J                               TR0150
1174 C           J         CHAINDTR0020              96                   TR0150
1175 C   96                GOTO \S941A                                    TR0150
1176 C  N96                SETON                     H2                   TR0150
1177 C           \S941A    TAG                                            TR0150
     C           REDY86    IFEQ 999999
     C****                 Z-ADD99999999  WREDY8  80
     C                     Z-ADD*DATE     WREDY8  80
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8  80
     C                     ENDIF
     C*
     C                     EXSR #TRS
1178 C                     SETON                     75                   TR0150
1179 C                     EXCPT                                          TR0150
1180 C                     SETOF                     75                   TR0150
     C                     EXSR #DOJ
     C*àÛç¸
1181 C                     SETON                     93                   TR0150
1182 C                     EXCPT                                          TR0150
1183 C                     SETOF                     93                   TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
1184 C                     SETON                     52    GAMEN3         TR0150
1185 C                     EXCPT                                          TR0150
1186 C                     SETOF                     52                   TR0150
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
     C*
     C***        WWITH     IFEQ 'W'
     C***                  SETOF                     90
     C***        J         CHAINDKK0630              90
     C***        *IN90     IFEQ '1'
     C***                  Z-ADDJ         JUNO3
     C***                  MOVEL'*'       TOGER
     C***                  Z-ADDUDATE     TODAY
     C***                  WRITERDKK0630
     C***                  ENDIF
     C***                  ENDIF
     C* /*  DKK0380  */
     C           TOKSS7    IFNE *BLANK
     C*
     C                     SETOF                     90
     C           J         CHAINDKK0380              90
     C           *IN90     IFEQ '1'
     C                     MOVEL'N1'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C*
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVELWTOTAM    TOTAMZ
     C*
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C                     ELSE
     C                     MOVEL'N1'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C*
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C                     Z-ADDW#TOK5    TOKSEZ
     C*
     C                     MOVELWTOTAM    TOTAMZ
     C*
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C*
     C                     ENDIF
1187 C                     EXSR #SETL1                                    TR0150
1188 C                     GOTO END                                       TR0150
1189 C*----------------------------------------------------               TR0150
1190 C           \S9411    TAG                                            TR0150
1191 C*----------------------------------------------------               TR0150
1192 C                     Z-ADD0         K       20                      TR0150
1193 C           DETCNL    ADD  1         K                               TR0150
1194 C                     SETON                     76                   TR0150
1195 C                     EXCPT                                          TR0150
1196 C                     SETOF                     76                   TR0150
1197 C                     SETOF                     9596                 TR0150
1198 C                     MOVE DETCNL    J                               TR0150
1199 C           J         CHAINDTR0020              95                   TR0150
1200 C   95                GOTO \S941B                                    TR0150
1201 C  N95                SETON                     H1                   TR0150
1202 C           \S941B    TAG                                            TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8
     C                     Z-ADD*DATE     WREDY8
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8
     C                     ENDIF
     C                     EXSR #TRS
1203 C                     SETON                     75                   TR0150
1204 C                     EXCPT                                          TR0150
1205 C                     SETOF                     75                   TR0150
     C                     EXSR #DOJ
     C*àÛç¸
1206 C                     SETON                     93                   TR0150
1207 C                     EXCPT                                          TR0150
1208 C                     SETOF                     93                   TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
1209 C                     SETON                     52    GAMEN3         TR0150
1210 C                     EXCPT                                          TR0150
1211 C                     SETOF                     52                   TR0150
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C* /*  DKK0380  */
     C           TOKSS7    IFNE *BLANK
     C*
     C                     SETOF                     90
     C           J         CHAINDKK0380              90
     C           *IN90     IFEQ '1'
     C                     MOVEL'N2'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C*
     C                     ELSE
     C                     MOVEL'N2'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C                     ENDIF
     C*-------
     C***        WWITH     IFEQ 'W'
     C*
     C***                  SETOF                     90
     C***        J         CHAINDKK0630              90
     C***        *IN90     IFEQ '1'
     C***                  Z-ADDJ         JUNO3
     C***                  MOVEL'*'       TOGER
     C***                  Z-ADDUDATE     TODAY
     C***                  WRITERDKK0630
     C***                  ENDIF
     C*
     C***                  ENDIF
1212 C                     EXSR #SETL1                                    TR0150
1213 C                     GOTO END                                       TR0150
1214 C*----------------------------------------------------               TR0150
1215 C           \S9500    TAG                                            TR0150
1216 C*----------------------------------------------------               TR0150
1217 C                     SETOF                     848586               TR0150
1218 C                     SETOF                     878889               TR0150
1219 C                     Z-ADD0         M       70                      TR0150
1220 C                     Z-ADD0         N       70                      TR0150
1221 C                     Z-ADD0         O       70                      TR0150
1222 C                     Z-ADD0         P       70                      TR0150
1223 C                     Z-ADD0         Q       70                      TR0150
1224 C                     Z-ADD0         N2      70                      TR0150
1225 C                     Z-ADD0         P2      70                      TR0150
1226 C                     Z-ADD0         N1      70                      TR0150
     C                     Z-ADD0         P1      70                      TR0150
1228 C                     Z-ADDQTYRDK    N1                              TR0150
1229 C                     Z-ADDQTYORK    P1                              TR0150
1230 C                     Z-ADDQTYRMK    N2                              TR0150
1231 C                     Z-ADDQTYOMK    P2                              TR0150
1232 C                     Z-ADDQTYOHK    M                               TR0150
1233 C                     Z-ADDQTYRSK    N                               TR0150
1234 C                     Z-ADDQTYRTK    O                               TR0150
1235 C                     Z-ADDQTYOBK    P                               TR0150
1236 C                     Z-ADDQTYOTK    Q                               TR0150
1237 C                     SETOF                     848586               TR0150
1238 C                     SETOF                     878889               TR0150
1239 C           A3        COMP 0                    848485               TR0150
1240 C           E         COMP 0                    868787               TR0150
1241 C   87 84             GOTO \S9601                                    TR0150
1242 C   87 85             GOTO \S9600                                    TR0150
1243 C   86      F         COMP 0                    888989               TR0150
1244 C   89 84             GOTO \S9701                                    TR0150
1245 C   89 85             GOTO \S9700                                    TR0150
1246 C   88 84             GOTO \S9801                                    TR0150
1247 C   88 85             GOTO \S9800                                    TR0150
1248 C*----------------------------------------------------               TR0150
1249 C           \S9600    TAG                                            TR0150
1250 C*----------------------------------------------------               TR0150
1251 C           F         ADD  P         P                               TR0150
1252 C           F         ADD  Q         Q                               TR0150
1253 C                     MOVE 2         A5                              TR0150
1254 C                     GOTO \S9900                                    TR0150
1255 C*----------------------------------------------------               TR0150
1256 C           \S9700    TAG                                            TR0150
1257 C*----------------------------------------------------               TR0150
1258 C           M         SUB  E         M                               TR0150
1259 C           N         ADD  E         N                               TR0150
1260 C           O         ADD  E         O                               TR0150
1261 C                     MOVE 1         A5                              TR0150
1262 C                     GOTO \S9900                                    TR0150
1263 C*----------------------------------------------------               TR0150
1264 C           \S9800    TAG                                            TR0150
1265 C*----------------------------------------------------               TR0150
1266 C           M         SUB  E         M                               TR0150
1267 C           E         ADD  N         N                               TR0150
1268 C           E         ADD  O         O                               TR0150
1269 C           F         ADD  P         P                               TR0150
     C           F         ADD  Q         Q                               TR0150
     C                     MOVE 3         A5                              TR0150
     C                     GOTO \S9900                                    TR0150
     C*----------------------------------------------------               TR0150
     C           \S9601    TAG                                            TR0150
     C*----------------------------------------------------               TR0150
     C           F         ADD  P1        P1                              TR0150
     C           F         ADD  Q         Q                               TR0150
     C                     MOVE 2         A5                              TR0150
     C                     GOTO \S9900                                    TR0150
     C*----------------------------------------------------               TR0150
1281 C           \S9701    TAG                                            TR0150
1282 C*----------------------------------------------------               TR0150
1283 C           M         SUB  E         M                               TR0150
1284 C           N1        ADD  E         N1                              TR0150
1285 C           O         ADD  E         O                               TR0150
1286 C                     MOVE 1         A5                              TR0150
1287 C                     GOTO \S9900                                    TR0150
1288 C*----------------------------------------------------               TR0150
1289 C           \S9801    TAG                                            TR0150
1290 C*----------------------------------------------------               TR0150
1291 C           M         SUB  E         M                               TR0150
1292 C           E         ADD  N1        N1                              TR0150
1293 C           E         ADD  O         O                               TR0150
1294 C           F         ADD  P1        P1                              TR0150
1295 C           F         ADD  Q         Q                               TR0150
1296 C                     MOVE 3         A5                              TR0150
1296 C*                                                                   TR0150
1297 C                     GOTO \S9900                                    TR0150
1298 C*----------------------------------------------------               TR0150
1299 C           \S9900    TAG                                            TR0150
1300 C*----------------------------------------------------               TR0150
1301 C                     SETON                     74                   TR0150
1302 C                     EXCPT                                          TR0150
1303 C                     SETOF                     74                   TR0150
1304 C                     Z-ADD0         J       80                      TR0150
1305 C                     MOVELA         J                               TR0150
1306 C                     MOVE Z2        J                               TR0150
1307 C                     SETOF                     9596                 TR0150
1308 C                     MOVELITCODJ    L                               TR0150
1309 C           J         CHAINDTR0020              95                   TR0150
1310 C   95                GOTO \S9910                                    TR0150
1311 C  N95                GOTO \S9911                                    TR0150
1312 C*----------------------------------------------------               TR0150
1313 C           \S9910    TAG                                            TR0150
1314 C*----------------------------------------------------               TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8  80
     C                     Z-ADD*DATE     WREDY8  80
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8  80
     C                     ENDIF
     C                     EXSR #TRS
1315 C                     SETON                     77                   TR0150
1316 C                     EXCPT                                          TR0150
1317 C                     SETOF                     77                   TR0150
     C                     EXSR #DOJ
1318 C                     MOVE 01        J                               TR0150
1319 C                     SETOF                     95                   TR0150
1320 C           J         CHAINDTR0020              95                   TR0150
     C   95                EXSR #TRS
1321 C   95                SETON                     75                   TR0150
1322 C   95                EXCPT                                          TR0150
1323 C   95                SETOF                     75                   TR0150
     C   95                EXSR #DOJ
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
     C***        WWITH     IFEQ 'W'
     C*
     C***                  SETOF                     90
     C***        J         CHAINDKK0630              90
     C***        *IN90     IFEQ '1'
     C***                  Z-ADDJ         JUNO3
     C***                  MOVEL'*'       TOGER
     C***                  Z-ADDUDATE     TODAY
     C***                  WRITERDKK0630
     C***                  ENDIF
     C***                  ENDIF
     C* /*  DKK0380  */
     C           TOKSS7    IFNE *BLANK
     C*
     C                     EXSR #RTN5
     C*
     C                     SETOF                     90
     C           J         CHAINDKK0380              90
     C           *IN90     IFEQ '1'
     C                     MOVEL'N3'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C*
     C                     ELSE
     C                     MOVEL'N3'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C   95                EXSR #TANI                                     TR0150
     C   95                GOTO \S9912                                    TR0150
1328 C  N95                SETON                     H3                   TR0150
1329 C*----------------------------------------------------               TR0150
1330 C           \S9912    TAG                                            TR0150
1331 C*----------------------------------------------------               TR0150
1332 C                     SETOF                     95                   TR0150
1333 C           J         CHAINDTR0040              95                   TR0150
1334 C   95                SETON                     73                   TR0150
1335 C   95                EXCPT                                          TR0150
1336 C   95                SETOF                     73                   TR0150
     C*
     C                     MOVELJ         WKJUTN  60
     C                     MOVE J         WKSEQN  20
     C*
     C   95                EXSR #TR010                     DTR0040
     C*àÛç¸
1324 C   95                SETON                     93                   TR0150
1325 C   95                EXCPT                                          TR0150
1326 C   95                SETOF                     93                   TR0150
     C*
1337 C   95                GOTO \S9913                                    TR0150
1338 C  N95                SETON                     H4                   TR0150
1339 C*----------------------------------------------------               TR0150
1340 C           \S9913    TAG                                            TR0150
1341 C*----------------------------------------------------               TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
1342 C                     SETON                     52    GAMEN3         TR0150
1343 C                     EXCPT                                          TR0150
1344 C                     SETOF                     52                   TR0150
1345 C                     EXSR #SETL1                                    TR0150
1346 C                     GOTO END                                       TR0150
1347 C*----------------------------------------------------               TR0150
1348 C           \S9911    TAG                                            TR0150
1349 C*----------------------------------------------------               TR0150
1350 C                     Z-ADD0         K       20                      TR0150
1351 C           DETCNL    ADD  1         K                               TR0150
1352 C                     SETON                     76                   TR0150
1353 C                     EXCPT                                          TR0150
1354 C                     SETOF                     76                   TR0150
1355 C                     SETOF                     95                   TR0150
1356 C                     MOVE DETCNL    J                               TR0150
1357 C           J         CHAINDTR0020              95                   TR0150
     C   95      REDY86    IFEQ 999999
     C*  95                Z-ADD99999999  WREDY8
     C   95                Z-ADD*DATE     WREDY8
     C                     ELSE
     C   95      20000000  ADD  REDY86    WREDY8
     C                     ENDIF
     C   95                EXSR #TRS
1358 C   95                SETON                     75                   TR0150
1359 C   95                EXCPT                                          TR0150
1360 C   95                SETOF                     75                   TR0150
     C   95                EXSR #DOJ
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
     C***        WWITH     IFEQ 'W'
     C*
     C***                  SETOF                     90
     C***        J         CHAINDKK0630              90
     C***        *IN90     IFEQ '1'
     C***                  Z-ADDJ         JUNO3
     C***                  MOVEL'*'       TOGER
     C***                  Z-ADDUDATE     TODAY
     C***                  WRITERDKK0630
     C***                  ENDIF
     C***                  ENDIF
     C* /*  DKK0380  */
     C           TOKSS7    IFNE *BLANK
     C*
     C                     SETOF                     90
     C           J         CHAINDKK0380              90
     C           *IN90     IFEQ '1'
     C                     MOVEL'N4'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C*
     C                     ELSE
     C                     MOVEL'N4'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C   95                EXSR #TANI                                     TR0150
1364 C   95                GOTO \S9930                                    TR0150
1365 C  N95                SETON                     H1                   TR0150
1366 C*----------------------------------------------------               TR0150
1367 C           \S9930    TAG                                            TR0150
1368 C*----------------------------------------------------               TR0150
1369 C                     SETOF                     95                   TR0150
1370 C           J         CHAINDTR0040              95                   TR0150
1371 C   95                GOTO \S993A                                    TR0150
1372 C  N95                SETON                     H5                   TR0150
1373 C           \S993A    TAG                                            TR0150
1374 C                     SETON                     73                   TR0150
1375 C                     EXCPT                                          TR0150
1376 C                     SETOF                     73                   TR0150
     C*
     C                     MOVELJ         WKJUTN  60
     C                     MOVE J         WKSEQN  20
     C*
     C                     EXSR #TR010                     DTR0040
     C*
1361 C   95                SETON                     93                   TR0150
1362 C   95                EXCPT                                          TR0150
1363 C   95                SETOF                     93                   TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     SETOF                     27
     C           DOJCD3    IFEQ '*'
     C                     SETON                     27
     C                     ENDIF
     C                     EXSR #DOJC                                     TR0150
1377 C                     SETON                     52    GAMEN3         TR0150
1378 C                     EXCPT                                          TR0150
1379 C                     SETOF                     52                   TR0150
1380 C                     EXSR #SETL1                                    TR0150
1381 C                     GOTO END                                       TR0150
1382 C*****************************************************               TR0150
1383 C           \SF10     TAG                                            TR0150
1384 C*****************************************************               TR0150
1386 C                     EXSR #SETOF                                    TR0150
     C*âÊñ ÇTï\é¶
1387 C   KD                SETON                     54                   TR0150
1388 C   KD                EXCPT                                          TR0150
1389 C   KD                SETOF                     54                   TR0150
1390 C   KD                GOTO END                                       TR0150
1391 C  NKD                GOTO \SAXXX                                    TR0150
1392 C*----------------------------------------------------               TR0150
1393 C           \SAXXX    TAG                                            TR0150
1394 C*----------------------------------------------------               TR0150
     C                     MOVELCODE1A    WCODE7
     C*
     C                     SELEC
     C           WCOA11    WHNE *BLANK
     C           WCOA12    ANDNE*BLANK
     C                     MOVELCODE1A    WCODE7
     C*
     C           WCOA11    WHNE *BLANK
     C           WCOA12    ANDEQ*BLANK
     C                     MOVEL'0'       WCODE7
     C                     MOVE WCOD11    WCODE7
     C           WCOA11    WHEQ *BLANK
     C           WCOA12    ANDEQ*BLANK
     C                     MOVEL'0'       WCODE7
     C                     MOVE '0'       WCODE7
     C                     ENDSL
     C*
     C                     MOVELSHICDA    WSHICD
     C*
1395 C                     SETOF                     848586               TR0150
1396 C                     SETOF                     878889               TR0150
1397 C           QUANTA    COMP 0                    848485               TR0150
1398 C   85                SETON                     8082                 TR0150
1399 C   85                GOTO \SA100                                    TR0150
1400 C   84                GOTO \SA100                                    TR0150
1401 C*----------------------------------------------------               TR0150
1402 C           \SA100    TAG                                            TR0150
1403 C*----------------------------------------------------               TR0150
1404 C                     SETOF                     848586               TR0150
1405 C                     SETOF                     878889               TR0150
1406 C           A1        COMP 'A'                  848485               TR0150
1407 C   84                GOTO \SA120                                    TR0150
1408 C   85                GOTO \SA110                                    TR0150
1409 C*----------------------------------------------------               TR0150
1410 C           \SA110    TAG                                            TR0150
1411 C*----------------------------------------------------               TR0150
     C                     MOVEL*BLANK    WITNB7 25
     C                     SETOF                     90
     C           ITNB1A    CHAINDMR0070              90
     C           *IN90     IFEQ '0'
     C                     Z-ADD1         A6
     C                     MOVELNITNB     ITNB1A
     C                     MOVELNITNB     ITNBRA
     C                     GOTO \SA111
     C                     ELSE
     C                     MOVELITNB1A    ITNB1A
     C                     MOVELITNB1A    ITNBRA
     C                     GOTO \SA111
     C                     ENDIF
1409 C*----------------------------------------------------               TR0150
1410 C           \SA111    TAG                                            TR0150
1411 C*----------------------------------------------------               TR0150
1412 C                     SETOF                     95                   TR0150
1413 C           ITNB1A    CHAINDMR0040              95                   TR0150
1414 C   95                SETON                     8081                 TR0150
1415 C   95                GOTO \SA120                                    TR0150
1416 C  N95                GOTO \SA12X                                    TR0150
1417 C           \SA12X    TAG                                            TR0150
     C*
     C                     SETOF                     82
     C                     Z-ADD0         WTANKM  50
     C                     Z-ADD0         WKINKM  90
     C                     Z-ADD0         WKEKIN  90
     C*
     C           WW26      IFEQ 'T'                        *********
     C*                                                            *
     C                     ELSE                            --------*
     C           WW26      IFEQ 'K'                        ******* *
     C           MAISU1    IFEQ ' '                        ***** * *
     C*                    Z-ADDKEKIN     WTANKM               * * *
     C                     ELSE                            ----* * *
     C           MAISU1    IFEQ '2'                            * * *
     C           KEKIN     MULT 2         WKEKIN               * * *
     C*                    Z-ADDWKEKIN    WTANKM               * * *
     C                     ELSE                                * * *
     C           MAISU1    IFEQ '3'                            * * *
     C           KEKIN     MULT 3         WKEKIN               * * *
     C*                    Z-ADDWKEKIN    WTANKM               * * *
     C                     ELSE                                * * *
     C                     ENDIF                               * * *
     C*                                                        * * *
     C                     ENDIF                               * * *
     C*                                                        * * *
     C                     ENDIF                           ***** * *
     C*                                                          * *
     C                     ENDIF                           ******* *
     C*                                                            *
     C                     ENDIF                           *********
     C*
1418 C                     SETOF                     848586               TR0150
1419 C           SIKOMJ    COMP 0                    848485               TR0150
1420 C   84                SETON                     8081                 TR0150
1421 C   84                GOTO \SA120                                    TR0150
1422 C   85                GOTO \SA120                                    TR0150
1423 C*----------------------------------------------------               TR0150
1424 C           \SA120    TAG                                            TR0150
1425 C*----------------------------------------------------               TR0150
1426 C   80                GOTO \SA130                                    TR0150
     C  N80                GOTO \SA140                                    TR0150
1428 C*----------------------------------------------------               TR0150
1429 C           \SA130    TAG                                            TR0150
1430 C*----------------------------------------------------               TR0150
     C                     MOVEL'00'      CODE1A                          TR0150
     C                     MOVEL*BLANK    SHICDA                          TR0150
1431 C                     SETON                     59                   TR0150
1432 C                     EXCPT                                          TR0150
1433 C                     SETOF                     59                   TR0150
1434 C                     GOTO END                                       TR0150
1435 C*----------------------------------------------------               TR0150
1436 C           \SA140    TAG                                            TR0150
1437 C*----------------------------------------------------               TR0150
1438 C                     Z-ADD0         G       70                      TR0150
1439 C                     Z-ADD0         H       90                      TR0150
     C* /*  ﬂ-¬ À›“≤ œ≤≈Ω */
     C*
1440 C                     SETOF                     848586               TR0150
1441 C                     SETOF                     878889               TR0150
1442 C           A2        COMP 2                    848485               TR0150
1443 C   85                Z-SUBQUANTA    QUANTA                          TR0150
     C   85                EXSR #RTN2
1444 C   85                GOTO \SA150                                    TR0150
     C   84                EXSR #RTN2
1445 C   84                GOTO \SA150                                    TR0150
1446 C*----------------------------------------------------               TR0150
1447 C           \SA150    TAG                                            TR0150
1448 C*----------------------------------------------------               TR0150
1449 C                     SETOF                     848586               TR0150
1450 C                     SETOF                     878889               TR0150
1451 C           A1        COMP 'A'                  848485               TR0150
1452 C   85                GOTO \SA160                                    TR0150
1453 C   84                GOTO \SA170                                    TR0150
1454 C*----------------------------------------------------               TR0150
1455 C           \SA160    TAG                                            TR0150
1456 C*----------------------------------------------------               TR0150
1457 C                     Z-ADD0         X       20                      TR0150
1458 C                     Z-ADDDCODEG    X                               TR0150
1459 C                     SETOF                     8485                 TR0150
1460 C           X         COMP 0                    848485               TR0150
1461 C   85                Z-ADD1         X                               TR0150
1462 C   85                GOTO \SA161                                    TR0150
1463 C   84                GOTO \SA161                                    TR0150
1464 C*----------------------------------------------------               TR0150
1465 C           \SA161    TAG                                            TR0150
1466 C*----------------------------------------------------               TR0150
1467 C                     SETOF                     848586               TR0150
1468 C           X         COMP 01                   848485               TR0150
1469 C   85                GOTO \SA710                                    TR0150
1470 C   84                GOTO \SA810                                    TR0150
1471 C           \SA810    TAG                                            TR0150
1472 C                     SETOF                     848586               TR0150
1473 C           X         COMP 02                   848485               TR0150
     C   85                GOTO \SA720                                    TR0150
1475 C   84                GOTO \SA820                                    TR0150
     C           \SA820    TAG                                            TR0150
1477 C                     SETOF                     848586               TR0150
1478 C           X         COMP 03                   848485               TR0150
1479 C   85                GOTO \SA730                                    TR0150
1480 C   84                GOTO \SA830                                    TR0150
1481 C           \SA830    TAG                                            TR0150
1482 C                     SETOF                     848586               TR0150
1483 C           X         COMP 04                   848485               TR0150
1484 C   85                GOTO \SA740                                    TR0150
1485 C   84                GOTO \SA840                                    TR0150
1486 C           \SA840    TAG                                            TR0150
1487 C                     SETOF                     848586               TR0150
1488 C           X         COMP 05                   848485               TR0150
1489 C   85                GOTO \SA750                                    TR0150
1490 C   84                GOTO \SA850                                    TR0150
1491 C           \SA850    TAG                                            TR0150
1492 C                     SETOF                     848586               TR0150
1493 C           X         COMP 06                   848485               TR0150
1494 C   85                GOTO \SA760                                    TR0150
1495 C   84                GOTO \SA860                                    TR0150
1496 C           \SA860    TAG                                            TR0150
1497 C                     SETOF                     848586               TR0150
1498 C           X         COMP 07                   848485               TR0150
1499 C   85                GOTO \SA770                                    TR0150
1500 C   84                GOTO \SA870                                    TR0150
1501 C           \SA870    TAG                                            TR0150
1502 C                     SETOF                     848586               TR0150
1503 C           X         COMP 08                   848485               TR0150
1504 C   85                GOTO \SA780                                    TR0150
1505 C   84                GOTO \SA880                                    TR0150
1506 C           \SA880    TAG                                            TR0150
1507 C                     SETOF                     848586               TR0150
1508 C           X         COMP 09                   848485               TR0150
1509 C   85                GOTO \SA790                                    TR0150
1510 C   84                GOTO \SA890                                    TR0150
1511 C           \SA890    TAG                                            TR0150
1512 C                     SETOF                     848586               TR0150
1513 C           X         COMP 10                   848485               TR0150
1514 C   85                GOTO \SA7A0                                    TR0150
     C*93/09/09 ¬≤∂
     C   84                GOTO \SA8A0
     C           \SA8A0    TAG
     C                     SETOF                     848586
     C           X         COMP 11                   848485
     C   85                GOTO \SA7B0
     C   84                GOTO \SA8B0
     C           \SA8B0    TAG
     C                     SETOF                     848586
     C           X         COMP 12                   848485
     C   85                GOTO \SA7C0
     C   84                GOTO \SA8C0
     C           \SA8C0    TAG
     C                     SETOF                     848586
     C           X         COMP 13                   848485
     C   85                GOTO \SA7D0
     C   84                GOTO \SA8D0
     C           \SA8D0    TAG
     C                     SETOF                     848586
     C           X         COMP 14                   848485
     C   85                GOTO \SA7E0
     C   84                GOTO \SA8E0
     C           \SA8E0    TAG
     C                     SETOF                     848586
     C           X         COMP 15                   848485
     C   85                GOTO \SA7F0
     C   84                GOTO \SA8F0
     C           \SA8F0    TAG
     C                     SETOF                     848586
     C           X         COMP 16                   848485
     C   85                GOTO \SA7G0
     C   84                GOTO \SA8G0
     C           \SA8G0    TAG
     C                     SETOF                     848586
     C           X         COMP 17                   848485
     C   85                GOTO \SA7H0
     C*
1515 C   84                SETON                     H4                   TR0150
1516 C           \SA710    TAG                                            TR0150
1517 C                     Z-ADDUPD01J    G                               TR0150
1518 C                     GOTO \SA900                                    TR0150
1519 C           \SA720    TAG                                            TR0150
1520 C                     Z-ADDUPD02J    G                               TR0150
1521 C                     GOTO \SA900                                    TR0150
1522 C           \SA730    TAG                                            TR0150
1523 C                     Z-ADDUPD03J    G                               TR0150
1524 C                     GOTO \SA900                                    TR0150
1525 C           \SA740    TAG                                            TR0150
1526 C                     Z-ADDUPD04J    G                               TR0150
     C                     GOTO \SA900                                    TR0150
1528 C           \SA750    TAG                                            TR0150
1529 C                     Z-ADDUPD05J    G                               TR0150
1530 C                     GOTO \SA900                                    TR0150
1531 C           \SA760    TAG                                            TR0150
1532 C                     Z-ADDUPD06J    G                               TR0150
1533 C                     GOTO \SA900                                    TR0150
1534 C           \SA770    TAG                                            TR0150
1535 C                     Z-ADDUPD07J    G                               TR0150
1536 C                     GOTO \SA900                                    TR0150
1537 C           \SA780    TAG                                            TR0150
1538 C                     Z-ADDUPD08J    G                               TR0150
1539 C                     GOTO \SA900                                    TR0150
1540 C           \SA790    TAG                                            TR0150
1541 C                     Z-ADDUPD09J    G                               TR0150
1542 C                     GOTO \SA900                                    TR0150
1543 C           \SA7A0    TAG                                            TR0150
1544 C                     Z-ADDUPD10J    G                               TR0150
1545 C                     GOTO \SA900                                    TR0150
     C*93/09/09 ¬≤∂
1516 C           \SA7B0    TAG                                            TR0150
1517 C                     Z-ADDUPD11J    G                               TR0150
1518 C                     GOTO \SA900                                    TR0150
1519 C           \SA7C0    TAG                                            TR0150
1520 C                     Z-ADDUPD12J    G                               TR0150
1521 C                     GOTO \SA900                                    TR0150
1522 C           \SA7D0    TAG                                            TR0150
1523 C                     Z-ADDUPD13J    G                               TR0150
1524 C                     GOTO \SA900                                    TR0150
1525 C           \SA7E0    TAG                                            TR0150
1526 C                     Z-ADDUPD14J    G                               TR0150
     C                     GOTO \SA900                                    TR0150
1528 C           \SA7F0    TAG                                            TR0150
1529 C                     Z-ADDUPD15J    G                               TR0150
1530 C                     GOTO \SA900                                    TR0150
1531 C           \SA7G0    TAG                                            TR0150
1532 C                     Z-ADDUPD16J    G                               TR0150
1533 C                     GOTO \SA900                                    TR0150
1534 C           \SA7H0    TAG                                            TR0150
1535 C                     Z-ADDUPD17J    G                               TR0150
1536 C                     GOTO \SA900                                    TR0150
     C*
1546 C           \SA900    TAG                                            TR0150
     C           G         ADD  WTANKM    G
1547 C           G         MULT QUANTA    H                               TR0150
1548 C                     GOTO \SA170                                    TR0150
1549 C*----------------------------------------------------               TR0150
1550 C           \SA170    TAG                                            TR0150
1551 C*----------------------------------------------------               TR0150
     C                     MOVEL*BLANK    P#RTC1
     C                     SETOF                     28
     C           A1        IFEQ 'E'
     C           A2        IFEQ 1
     C           A2        OREQ 2
     C                     EXSR #PAR1
     C                     SETON                     99
     C                     ENDIF
     C                     ENDIF
     C*ÉTÉuÉãÅ[É`ÉììríÜÇ≈î≤ÇØÇΩÇÁRTC1=1
     C           P#RTC1    IFEQ '1'
     C                     Z-ADDP#TANK    TANKAB
     C                     Z-ADDP#KING    KINGAB
     C                     GOTO \SF11X
     C                     ELSE
     C*ÉTÉuÉãÅ[É`Éìí ÇÍÇŒ28 ON
     C           *IN28     IFEQ '1'
     C                     MOVELP#JUNO    WJUTN1
     C                     MOVE P#RJUN    WSEQNO
     C*
     C           WSEQNO    IFEQ 0
     C                     ADD  1         WSEQNO
     C                     ENDIF
     C*
     C                     SETON                     94
     C                     EXCPT                           àÛç¸
     C                     SETOF                     94
     C                     SETON                     99
     C                     GOTO \SC111
     C                     ENDIF
     C                     ENDIF
     C*âÊñ ÇPÇPï\é¶
1552 C                     SETON                     60                   TR0150
1553 C                     EXCPT                           GAMEN11        TR0150
1554 C                     SETOF                     60                   TR0150
1555 C                     GOTO END                                       TR0150
1556 C*****************************************************               TR0150
1557 C           \SF11     TAG                                            TR0150
1558 C*****************************************************               TR0150
1560 C                     EXSR #SETOF                                    TR0150
1561 C   KD                GOTO \SF11X                                    TR0150
1568 C  NKD                GOTO \SBXXX                                    TR0150
1569 C*----------------------------------------------------               TR0150
1570 C           \SF11X    TAG                                            TR0150
1571 C*----------------------------------------------------               TR0150
1561 C                     SETOF                     848586               TR0150
1562 C           A2        COMP 2                    848485               TR0150
1563 C      85             Z-SUBQUANTA    QUANTA                          TR0150
     C                     MOVEL'00'      CODE1A                          TR0150
     C                     MOVEL*BLANK    SHICDA                          TR0150
     C*âÊñ ÇPÇOï\é¶
1564 C                     SETON                     59                   TR0150
1565 C                     EXCPT                                          TR0150
1566 C                     SETOF                     59                   TR0150
1567 C                     GOTO END                                       TR0150
1569 C*----------------------------------------------------               TR0150
1570 C           \SBXXX    TAG                                            TR0150
1571 C*----------------------------------------------------               TR0150
1572 C                     SETOF                     848586               TR0150
1573 C                     SETOF                     878889               TR0150
1574 C*                    SETOF                     848586               TR0150
1575 C*          KINGAB    COMP 0                    848485               TR0150
1576 C                     Z-ADDTANKAB    G                               TR0150
1577 C           G         MULT QUANTA    H                               TR0150
1578 C                     GOTO \SB001                                    TR0150
1579 C*  84                Z-ADDTANKAB    G                               TR0150
1580 C*  84                Z-ADDKINGAB    H                               TR0150
1581 C*  84                GOTO \SB001                                    TR0150
1582 C           \SB001    TAG                                            TR0150
1583 C                     SETON                     61                   TR0150
1584 C                     EXCPT                           GAMEN12        TR0150
1585 C                     SETOF                     61                   TR0150
1586 C                     GOTO END                                       TR0150
1587 C*****************************************************               TR0150
1588 C           \SF12     TAG                                            TR0150
1589 C*****************************************************               TR0150
1591 C                     EXSR #SETOF                                    TR0150
1592 C   KD                SETON                     60                   TR0150
1593 C   KD                EXCPT                           GAMEN11        TR0150
1594 C   KD                SETOF                     60                   TR0150
1595 C   KD                GOTO END                                       TR0150
1596 C  NKD                GOTO \SCXXX                                    TR0150
1597 C*----------------------------------------------------               TR0150
1598 C           \SCXXX    TAG                                            TR0150
1599 C*----------------------------------------------------               TR0150
1600 C                     MOVEL'00000000'L      14                       TR0150
1600 C                     MOVE '000000'  L                               TR0150
1601 C                     SETOF                     848586               TR0150
1602 C                     SETOF                     878889               TR0150
1603 C           A1        COMP 'A'                  848485               TR0150
1604 C   84                GOTO \SC100                                    TR0150
1605 C   85                MOVELITCODJ    L                               TR0150
1606 C   85      A2        COMP 2                    868687               TR0150
1607 C   86                GOTO \SC100                                    TR0150
1608 C   87                GOTO \SC200                                    TR0150
1609 C*----------------------------------------------------               TR0150
1610 C           \SC100    TAG                                            TR0150
1611 C*----------------------------------------------------               TR0150
1612 C                     Z-ADD0         J                               TR0150
1613 C                     MOVELA         J                               TR0150
1614 C                     MOVE Z2        J                               TR0150
1615 C                     SETOF                     95                   TR0150
1616 C           J         CHAINDTR0020              95                   TR0150
1617 C   95                GOTO \SC110                                    TR0150
1618 C  N95                GOTO \SC120                                    TR0150
1619 C*----------------------------------------------------               TR0150
1620 C           \SC110    TAG                                            TR0150
1621 C*----------------------------------------------------               TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8  80
     C                     Z-ADD*DATE     WREDY8  80
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8  80
     C                     ENDIF
     C                     EXSR #TRS
1622 C                     SETON                     77                   TR0150
1623 C                     EXCPT                                          TR0150
1624 C                     SETOF                     77                   TR0150
     C                     EXSR #DOJ
1625 C                     MOVE 01        J                               TR0150
1626 C                     SETOF                     95                   TR0150
     C           J         CHAINDTR0020              95                   TR0150
     C   95                EXSR #TRS
1628 C   95                SETON                     98                   TR0150
1629 C   95                EXCPT                                          TR0150
1630 C   95                SETOF                     98                   TR0150
     C   95                EXSR #DOJ
1631 C   95                SETON                     92                   TR0150
1632 C   95                EXCPT                                          TR0150
1633 C   95                SETOF                     92                   TR0150
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C* DMR0030 º≠Ø∂ª∑
     C                     EXSR #MOV3
     C*
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*  Õ›Àﬂ›… ﬁ±≤
     C*DTR0050 UPDATE
     C           NBNBRA    IFNE *BLANK
     C                     MOVELNBNBRA    P#SBSB
     C                     Z-ADDQUANTA    P#QUAN
     C                     CALL '@TR0230' PAR120
     C                     ENDIF
     C*
1634 C   95                GOTO \SC111                                    TR0150
1635 C  N95                SETON                     H1                   TR0150
1636 C*----------------------------------------------------               TR0150
1637 C           \SC111    TAG                                            TR0150
1638 C*----------------------------------------------------               TR0150
1639 C                     EXSR #SETOF                                    TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
1640 C                     SETON                     52    GAMEN3         TR0150
1641 C                     EXCPT                                          TR0150
1642 C                     SETOF                     52                   TR0150
1643 C                     EXSR #SETL1                                    TR0150
1644 C                     GOTO END                                       TR0150
1645 C*----------------------------------------------------               TR0150
1646 C           \SC120    TAG                                            TR0150
1647 C*----------------------------------------------------               TR0150
1648 C                     Z-ADD0         K                               TR0150
1649 C           DETCNL    ADD  1         K                               TR0150
1650 C                     SETON                     76                   TR0150
1651 C                     EXCPT                                          TR0150
1652 C                     SETOF                     76                   TR0150
1653 C                     MOVE DETCNL    J                               TR0150
1654 C                     SETOF                     95                   TR0150
1655 C           J         CHAINDTR0020              95                   TR0150
     C   95      REDY86    IFEQ 999999
     C*  95                Z-ADD99999999  WREDY8
     C   95                Z-ADD*DATE     WREDY8
     C                     ELSE
     C   95      20000000  ADD  REDY86    WREDY8
     C                     ENDIF
     C   95                EXSR #TRS
1656 C   95                SETON                     98                   TR0150
1657 C   95                EXCPT                                          TR0150
1658 C   95                SETOF                     98                   TR0150
     C   95                EXSR #DOJ
1659 C   95                SETON                     92                   TR0150
1660 C   95                EXCPT                                          TR0150
1661 C   95                SETOF                     92                   TR0150
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
1662 C   95                GOTO \SC121                                    TR0150
1663 C  N95                SETON                     H6                   TR0150
1664 C*----------------------------------------------------               TR0150
1665 C           \SC121    TAG                                            TR0150
1666 C*----------------------------------------------------               TR0150
1667 C                     EXSR #SETOF                                    TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
1668 C                     SETON                     52    GAMEN3         TR0150
1669 C                     EXCPT                                          TR0150
1670 C                     SETOF                     52                   TR0150
1671 C                     EXSR #SETL1                                    TR0150
1672 C                     GOTO END                                       TR0150
1673 C*----------------------------------------------------               TR0150
1674 C           \SC200    TAG                                            TR0150
1675 C*----------------------------------------------------               TR0150
1676 C                     SETOF                     95                   TR0150
1677 C           ITCODJ    CHAINDTR0010              95                   TR0150
1678 C   95                SETON                     H1                   TR0150
1679 C  N95                GOTO \SC210                                    TR0150
1680 C*----------------------------------------------------               TR0150
1681 C           \SC210    TAG                                            TR0150
1682 C*----------------------------------------------------               TR0150
1683 C                     Z-ADD0         M       70                      TR0150
1684 C                     Z-ADD0         N       70                      TR0150
1685 C                     Z-ADD0         O       70                      TR0150
1686 C                     Z-ADD0         P       70                      TR0150
1687 C                     Z-ADD0         Q       70                      TR0150
1688 C                     Z-ADD0         N2      70                      TR0150
1689 C                     Z-ADD0         P2      70                      TR0150
1690 C                     Z-ADD0         N1      70                      TR0150
1691 C                     Z-ADD0         P1      70                      TR0150
1692 C                     Z-ADDQTYRDK    N1                              TR0150
1693 C                     Z-ADDQTYORK    P1                              TR0150
1694 C                     Z-ADDQTYRMK    N2                              TR0150
1695 C                     Z-ADDQTYOMK    P2                              TR0150
1696 C                     Z-ADDQTYOHK    M                               TR0150
1697 C                     Z-ADDQTYRSK    N                               TR0150
1698 C                     Z-ADDQTYRTK    O                               TR0150
1699 C                     Z-ADDQTYOBK    P                               TR0150
1700 C                     Z-ADDQTYOTK    Q                               TR0150
1701 C           QTYOHK    SUB  QUANTA    M                               TR0150
1702 C                     SETON                     74                   TR0150
1703 C                     EXCPT                                          TR0150
1704 C                     SETOF                     74                   TR0150
1705 C                     GOTO \SC100                                    TR0150
1706 C*****************************************************               TR0150
1707 C           \SF13     TAG                                            TR0150
1708 C*****************************************************               TR0150
1710 C                     EXSR #SETOF                                    TR0150
     C   KD                MOVELGLCLA7    WLCLA7
     C   KD                MOVELGSCLA7    WSCLA7
1711 C   KD                SETON                     58                   TR0150
1712 C   KD                EXCPT                           GAMEN9         TR0150
1713 C   KD                SETOF                     58                   TR0150
1714 C   KD                GOTO END                                       TR0150
1715 C  NKD                GOTO \SDXXX                                    TR0150
1716 C*----------------------------------------------------               TR0150
1717 C           \SDXXX    TAG                                            TR0150
1718 C*----------------------------------------------------               TR0150
1719 C                     SETOF                     848586               TR0150
1720 C           SIKYNC    COMP 0                    848485               TR0150
1721 C   85                GOTO \SD001                                    TR0150
1722 C   84      SIKYNC    COMP 1                    848486               TR0150
1723 C   86                GOTO \SD002                                    TR0150
1724 C   84                SETON                     8081                 TR0150
1725 C   84                GOTO \SD001                                    TR0150
1726 C           \SD002    TAG                                            TR0150
1728 C                     SETOF                     848586               TR0150
1729 C           A1        COMP 'E'                  848485               TR0150
1730 C   85                SETON                     8081                 TR0150
1731 C   85                GOTO \SD001                                    TR0150
1732 C   84                GOTO \SD001                                    TR0150
1733 C           \SD001    TAG                                            TR0150
1739 C   80                SETON                     8081                 TR0150
1735 C   80                GOTO \SD003                                    TR0150
1736 C  N80                GOTO \SD100                                    TR0150
1737 C           \SD003    TAG                             ¥◊∞            TR0150
     C*     ﬂ∞¬∆≠≥ÿÆ∏GAMEN13Õ
     C                     EXSR #RTN3
     C*âÊñ ÇPÇRï\é¶
1740 C                     SETON                     62                   TR0150
1741 C                     EXCPT                                          TR0150
1742 C                     SETOF                     62                   TR0150
1743 C                     GOTO END                                       TR0150
1744 C*----------------------------------------------------               TR0150
1745 C           \SD100    TAG                                            TR0150
1746 C*----------------------------------------------------               TR0150
1748 C                     Z-ADD1         A6                              TR0150
1749 C                     SETOF                     848586               TR0150
1750 C           SIKYNC    COMP 1                    848485               TR0150
1751 C   85                GOTO \SD110                                    TR0150
1752 C   84                GOTO \SD200                                    TR0150
1753 C*----------------------------------------------------               TR0150
1754 C           \SD110    TAG                                            TR0150
1755 C*----------------------------------------------------               TR0150
     C                     Z-ADD0         J                               TR0150
     C                     MOVELA         J                               TR0150
     C                     MOVE Z2        J                               TR0150
1757 C                     MOVE 1         A4                              TR0150
1758 C                     SETON                     63                   TR0150
1759 C                     EXCPT                           GAMEN14        TR0150
1760 C                     SETOF                     63                   TR0150
1761 C                     GOTO END                                       TR0150
1762 C*----------------------------------------------------               TR0150
1763 C           \SD200    TAG                                            TR0150
1764 C*----------------------------------------------------               TR0150
1772 C                     Z-ADD0         J       80                      TR0150
1773 C                     MOVELA         J                               TR0150
1774 C                     MOVE Z2        J                               TR0150
     C*ïîëgêªïiÇÃì¸óÕ
     C           GBUKUM    IFEQ '1'
     C                     EXSR #BUKM
     C           P#RTC2    IFEQ 1
     C                     GOTO \SD003
     C                     ENDIF
     C                     ENDIF
     C*
1766 C                     SETOF                     95                   TR0150
1767 C           AAA       CHAINDTR0050              95                   TR0150
1768 C   95                GOTO \SD201                                    TR0150
1768 C  N95                SETON                     H1                   TR0150
1770 C           \SD201    TAG                                            TR0150
1772 C                     Z-ADD0         J       80                      TR0150
1773 C                     MOVELA         J                               TR0150
1774 C                     MOVE Z2        J                               TR0150
1775 C                     SETOF                     9596                 TR0150
1776 C           J         CHAINDTR0020              95                   TR0150
1777 C   95                GOTO \SD410                                    TR0150
1778 C  N95                GOTO \SD411                                    TR0150
1779 C*----------------------------------------------------               TR0150
1780 C           \SD410    TAG                                            TR0150
1781 C*----------------------------------------------------               TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8  80
     C                     Z-ADD*DATE     WREDY8  80
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8  80
     C                     ENDIF
     C                     EXSR #TRS
1783 C                     SETON                     77                   TR0150
1784 C                     EXCPT                                          TR0150
1785 C                     SETOF                     77                   TR0150
     C                     EXSR #DOJ
1786 C                     MOVE 01        J                               TR0150
1787 C           J         CHAINDTR0020              96                   TR0150
1788 C   96                GOTO \SD41A                                    TR0150
1789 C  N96                SETON                     H7                   TR0150
1790 C           \SD41A    TAG                                            TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8  80
     C                     Z-ADD*DATE     WREDY8  80
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8  80
     C                     ENDIF
     C                     EXSR #TRS
1791 C                     SETON                     75                   TR0150
1792 C                     EXCPT                                          TR0150
1793 C                     SETOF                     75                   TR0150
     C                     EXSR #DOJ
     C*DTR0070 UPDATE
     C                     MOVELAAA       P#NBN2
     C                     MOVE J         P#JUT2
     C                     CALL '@TR0170' PAR040
     C*
     C           WDEL      IFGE 90
     C                     MOVEL19        WDELEV  80
     C                     ELSE
     C                     MOVEL20        WDELEV
     C                     ENDIF
     C                     MOVE DELEVC    WDELEV
     C*
     C                     Z-ADD0         WSEHAD  80
     C                     Z-ADD0         WFIDAY  80
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
     C           TOKSS7    IFNE *BLANK
     C*
     C                     EXSR #RTN5
     C*
     C                     SETOF                     90
     C           J         CHAINDKK0380              90
     C           *IN90     IFEQ '1'
     C                     MOVEL'N5'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVEAWK4       TOKSSZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C*
     C                     ELSE
     C                     MOVEL'N5'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVEAWK4       TOKSSZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C                     ENDIF
     C*DTR0050 WRITE
     C                     SETOF                     95
     C           AAA       CHAINDTR0050              95
1797 C   95                SETON                     71                   TR0150
1798 C   95                EXCPT                                          TR0150
1799 C   95                SETOF                     71                   TR0150
     C*---SPD
     C                     EXSR #SPD
     C*BàÛç¸
1794 C                     SETON                     93                   TR0150
1795 C                     EXCPT                           àÛç¸         TR0150
1796 C                     SETOF                     93                   TR0150
1800 C                     SETON                     48                   TR0150
1801 C                     EXCPT                                          TR0150
1802 C                     SETOF                     48                   TR0150
1803 C                     SETON                     47                   TR0150
1804 C                     EXCPT                                          TR0150
1805 C                     SETOF                     47                   TR0150
1806 C                     SETON                     46                   TR0150
1807 C                     EXCPT                                          TR0150
1808 C                     SETOF                     46                   TR0150
1809 C                     SETON                     41                   TR0150
1810 C                     EXCPT                                          TR0150
1811 C                     SETOF                     41                   TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
1812 C                     SETON                     52    GAMEN3         TR0150
1813 C                     EXCPT                                          TR0150
1814 C                     SETOF                     52                   TR0150
1815 C                     EXSR #SETL1                                    TR0150
1816 C                     GOTO END                                       TR0150
1817 C*----------------------------------------------------               TR0150
1818 C           \SD411    TAG                                            TR0150
1819 C*----------------------------------------------------               TR0150
1821 C                     Z-ADD0         K       20                      TR0150
1822 C           DETCNL    ADD  1         K                               TR0150
1823 C                     SETON                     76                   TR0150
1824 C                     EXCPT                           DTR0020 DETCL  TR0150
1825 C                     SETOF                     76                   TR0150
1826 C                     SETOF                     9596                 TR0150
     C                     MOVE DETCNL    J                               TR0150
1828 C           J         CHAINDTR0020              95                   TR0150
1829 C   95                GOTO \SD41B                                    TR0150
1830 C  N95                SETON                     H1                   TR0150
1831 C           \SD41B    TAG                                            TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD9999999   WREDY8
     C                     Z-ADD*DATE     WREDY8
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8
     C                     ENDIF
     C                     EXSR #TRS
1832 C                     SETON                     75                   TR0150
1833 C                     EXCPT                                          TR0150
1834 C                     SETOF                     75                   TR0150
     C                     EXSR #DOJ
1835 C                     SETON                     93                   TR0150
1836 C                     EXCPT                                          TR0150
1837 C                     SETOF                     93                   TR0150
     C*
     C                     MOVELAAA       P#NBN2
     C                     MOVE J         P#JUT2
     C                     CALL '@TR0170' PAR040
     C*
     C           WDEL      IFGE 90
     C                     MOVEL19        WDELEV  80
     C                     ELSE
     C                     MOVEL20        WDELEV
     C                     ENDIF
     C                     MOVE DELEVC    WDELEV
     C*
     C                     Z-ADD0         WSEHAD  80
     C                     Z-ADD0         WFIDAY  80
     C*
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
     C           TOKSS7    IFNE *BLANK
     C*
     C                     EXSR #RTN5
     C*
     C                     SETOF                     90
     C           J         CHAINDKK0380              90
     C           *IN90     IFEQ '1'
     C                     MOVEL'N6'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVEAWK4       TOKSSZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C*
     C                     ELSE
     C                     MOVEL'N6'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVEAWK4       TOKSSZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C                     ENDIF
     C*-------
     C                     SETOF                     95
     C           AAA       CHAINDTR0050              95
1838 C   95                SETON                     71                   TR0150
1839 C   95                EXCPT                                          TR0150
1840 C   95                SETOF                     71                   TR0150
     C*---SPD
     C                     EXSR #SPD
     C*BàÛç¸
1841 C                     SETON                     48                   TR0150
1842 C                     EXCPT                                          TR0150
1843 C                     SETOF                     48                   TR0150
1844 C                     SETON                     47                   TR0150
1845 C                     EXCPT                                          TR0150
1846 C                     SETOF                     47                   TR0150
1847 C                     SETON                     46                   TR0150
1848 C                     EXCPT                                          TR0150
1849 C                     SETOF                     46                   TR0150
1850 C                     SETON                     41                   TR0150
1851 C                     EXCPT                                          TR0150
1852 C                     SETOF                     41                   TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
1853 C                     SETON                     52    GAMEN3         TR0150
1854 C                     EXCPT                                          TR0150
1855 C                     SETOF                     52                   TR0150
1856 C                     EXSR #SETL1                                    TR0150
1857 C                     GOTO END                                       TR0150
1858 C*****************************************************               TR0150
1859 C           \SF14     TAG                                            TR0150
1860 C*****************************************************               TR0150
1862 C                     EXSR #SETOF                                    TR0150
1864 C   KD                GOTO \SE001                                    TR0150
1865 C  NKD                GOTO \SEXXX                                    TR0150
1866 C           \SE001    TAG                                            TR0150
1868 C                     MOVE '        'DDD     8                       TR0150
1869 C                     MOVELAAA       DDD                             TR0150
1870 C                     MOVE Z2        DDD                             TR0150
1871 C                     SETOF                     95                   TR0150
1872 C           DDD       CHAINDTR0070              95                   TR0150
1874 C   95                GOTO \SE002                                    TR0150
1875 C  N95                GOTO \SE003                                    TR0150
1876 C           \SE002    TAG                                            TR0150
1877 C                     SETON                     80                   TR0150
1878 C                     SETON                     63                   TR0150
1879 C                     EXCPT                           GAMEN14        TR0150
1880 C                     SETOF                     63                   TR0150
1881 C                     EXSR #SETL2                                    TR0150
1882 C                     GOTO END                                       TR0150
1883 C           \SE003    TAG                                            TR0150
1884 C                     MOVEL'00000000'L                               TR0150
1884 C                     MOVE '000000'  L                               TR0150
1885 C                     SETOF                     848586               TR0150
1886 C                     SETOF                     878889               TR0150
1887 C           A1        COMP 'A'                  848485               TR0150
1888 C   84                GOTO \SE900                                    TR0150
1889 C   85                MOVELITCODJ    L                               TR0150
1890 C   85                GOTO \SE900                                    TR0150
1891 C*----------------------------------------------------               TR0150
1892 C           \SE900    TAG                                            TR0150
1893 C*----------------------------------------------------               TR0150
1894 C                     Z-ADD0         J                               TR0150
1895 C                     MOVELA         J                               TR0150
1896 C                     MOVE Z2        J                               TR0150
1897 C                     SETOF                     95                   TR0150
1898 C           J         CHAINDTR0020              95                   TR0150
1899 C   95                GOTO \SE910                                    TR0150
1900 C  N95                GOTO \SE920                                    TR0150
1901 C*----------------------------------------------------               TR0150
1902 C           \SE910    TAG                                            TR0150
1903 C*----------------------------------------------------               TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8  80
     C                     Z-ADD*DATE     WREDY8  80
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8  80
     C                     ENDIF
     C                     EXSR #TRS
1904 C                     SETON                     77                   TR0150
1905 C                     EXCPT                                          TR0150
1906 C                     SETOF                     77                   TR0150
     C                     EXSR #DOJ
1907 C                     MOVE 01        J                               TR0150
1908 C                     SETOF                     95                   TR0150
1909 C           J         CHAINDTR0020              95                   TR0150
     C   95                EXSR #TRS
1910 C   95                SETON                     75                   TR0150
1911 C   95                EXCPT                                          TR0150
1912 C   95                SETOF                     75                   TR0150
     C   95                EXSR #DOJ
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
     C           TOKSS7    IFNE *BLANK
     C*
     C                     EXSR #RTN5
     C*
     C                     SETOF                     90
     C           J         CHAINDKK0380              90
     C           *IN90     IFEQ '1'
     C                     MOVEL'N7'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVEAWK4       TOKSSZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C*
     C                     ELSE
     C                     MOVEL'N7'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVEAWK4       TOKSSZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C                     ENDIF
     C*-------
1913 C   95                SETON                     93                   TR0150
1914 C   95                EXCPT                                          TR0150
1915 C   95                SETOF                     93                   TR0150
1916 C   95                GOTO \SEXYZ                                    TR0150
1917 C  N95                SETON                     H1                   TR0150
1918 C*----------------------------------------------------               TR0150
1919 C           \SE920    TAG                                            TR0150
1920 C*----------------------------------------------------               TR0150
1921 C                     Z-ADD0         K                               TR0150
1922 C           DETCNL    ADD  1         K                               TR0150
1923 C                     SETON                     76                   TR0150
1924 C                     EXCPT                                          TR0150
1925 C                     SETOF                     76                   TR0150
1926 C                     MOVE DETCNL    J                               TR0150
     C                     SETOF                     95                   TR0150
1928 C           J         CHAINDTR0020              95                   TR0150
     C   95      REDY86    IFEQ 999999
     C*  95                Z-ADD9999999   WREDY8
     C   95                Z-ADD*DATE     WREDY8
     C                     ELSE
     C   95      20000000  ADD  REDY86    WREDY8
     C                     ENDIF
     C   95                EXSR #TRS
1929 C   95                SETON                     75                   TR0150
1930 C   95                EXCPT                                          TR0150
1931 C   95                SETOF                     75                   TR0150
     C   95                EXSR #DOJ
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
     C           TOKSS7    IFNE *BLANK
     C*
     C                     EXSR #RTN5
     C*
     C                     SETOF                     90
     C           J         CHAINDKK0380              90
     C           *IN90     IFEQ '1'
     C                     MOVEL'N8'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVEAWK4       TOKSSZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C*
     C                     ELSE
     C                     MOVEL'N8'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDJ         JUSENZ
     C                     Z-ADD0         TOKSEZ
     C                     EXSR #RTN4
     C                     Z-ADDW#TOK5    TOKSEZ
     C                     MOVEAWK4       TOKSSZ
     C                     MOVELWTOTAM    TOTAMZ
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C                     ENDIF
     C*-------
1932 C   95                SETON                     93                   TR0150
1933 C   95                EXCPT                                          TR0150
1934 C   95                SETOF                     93                   TR0150
1935 C   95                GOTO \SEXYZ                                    TR0150
1936 C  N95                SETON                     H8                   TR0150
1937 C           \SEXYZ    TAG                                            TR0150
1938 C                     SETOF                     95                   TR0150
1939 C           AAA       CHAINDTR0050              95                   TR0150
1940 C   95                SETON                     H8                   TR0150
1941 C  N95                GOTO \SE901                                    TR0150
1942 C           \SE901    TAG                                            TR0150
1943 C                     SETON                     17                   TR0150
1944 C                     EXCPT                                          TR0150
1945 C                     SETOF                     17                   TR0150
     C*
     C                     MOVELAAA       P#NBN2
     C                     MOVE J         P#JUT2
     C                     CALL '@TR0170' PAR040
     C*
1946 C                     GOTO \SE903                                    TR0150
1947 C           \SE903    TAG                                            TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
1948 C                     SETON                     52    GAMEN3         TR0150
1949 C                     EXCPT                                          TR0150
1950 C                     SETOF                     52                   TR0150
1951 C                     EXSR #SETL1                                    TR0150
1952 C                     GOTO END                                       TR0150
1953 C*----------------------------------------------------               TR0150
1954 C           \SEXXX    TAG                                            TR0150
1955 C*----------------------------------------------------               TR0150
1957 C                     SETOF                     95                   TR0150
1958 C           ITNBRD    CHAINDMR0040              95                   TR0150
1959 C   95                SETON                     8081                 TR0150
1960 C   95                GOTO \SE100                                    TR0150
1961 C  N95                GOTO \SE100                                    TR0150
1962 C*----------------------------------------------------               TR0150
1963 C           \SE100    TAG                                            TR0150
1964 C*----------------------------------------------------               TR0150
1965 C                     SETOF                     848586               TR0150
1966 C           SIKOMJ    COMP 0                    848485               TR0150
1967 C   84                SETON                     8081                 TR0150
1968 C   84                GOTO \SE1XY                                    TR0150
1969 C   85                GOTO \SE1XY                                    TR0150
1970 C           \SE1XY    TAG                                            TR0150
1971 C                     SETOF                     848586               TR0150
1972 C           QUANTD    COMP 0                    848485               TR0150
1973 C   85                SETON                     8082                 TR0150
1974 C   85                GOTO \SE110                                    TR0150
1975 C   84                GOTO \SE110                                    TR0150
1976 C*----------------------------------------------------               TR0150
1977 C           \SE110    TAG                                            TR0150
1978 C*----------------------------------------------------               TR0150
1979 C   80                GOTO \SE11A                                    TR0150
1980 C  N80                GOTO \SE200                                    TR0150
1981 C           \SE11A    TAG                                            TR0150
1982 C                     SETON                     63                   TR0150
1983 C                     EXCPT                           GAMEN14        TR0150
1984 C                     SETOF                     63                   TR0150
1985 C                     EXSR #SETL2                                    TR0150
1986 C                     GOTO END                                       TR0150
1987 C*----------------------------------------------------               TR0150
1988 C           \SE200    TAG                                            TR0150
1989 C*----------------------------------------------------               TR0150
1990 C                     Z-ADD0         YY     140                      TR0150
1991 C                     SETOF                     95                   TR0150
1992 C           ITCODJ    CHAINDTR0010              95                   TR0150
1993 C   95                SETON                     H9                   TR0150
1994 C  N95                GOTO \SE210                                    TR0150
1995 C*----------------------------------------------------               TR0150
1996 C           \SE210    TAG                                            TR0150
1997 C*----------------------------------------------------               TR0150
1998 C                     Z-ADDITCODJ    YY                              TR0150
1999 C                     Z-ADD0         M                               TR0150
2000 C                     Z-ADD0         N                               TR0150
2001 C                     Z-ADD0         O                               TR0150
2002 C                     Z-ADD0         P                               TR0150
2003 C                     Z-ADD0         Q                               TR0150
2004 C                     Z-ADD0         N2                              TR0150
2005 C                     Z-ADD0         P2                              TR0150
2006 C                     Z-ADD0         N1                              TR0150
2007 C                     Z-ADD0         P1                              TR0150
2008 C                     Z-ADDQTYRDK    N1                              TR0150
2009 C                     Z-ADDQTYORK    P1                              TR0150
2010 C                     Z-ADDQTYRMK    N2                              TR0150
2011 C                     Z-ADDQTYOMK    P2                              TR0150
2012 C                     Z-ADDQTYOHK    M                               TR0150
2013 C                     Z-ADDQTYRSK    N                               TR0150
2014 C                     Z-ADDQTYRTK    O                               TR0150
2015 C                     Z-ADDQTYOBK    P                               TR0150
2016 C                     Z-ADDQTYOTK    Q                               TR0150
2017 C                     Z-ADD0         E                               TR0150
2018 C                     Z-ADD0         F                               TR0150
2019 C                     Z-ADD0         R       70                      TR0150
2020 C                     Z-ADD0         S       70                      TR0150
2021 C                     SETOF                     848586               TR0150
2022 C                     SETOF                     878889               TR0150
2023 C           QTYOHK    SUB  QTYOTK    R                               TR0150
2024 C           R         COMP 0                    848585               TR0150
2025 C   85                GOTO \SE300                                    TR0150
2026 C   84      R         SUB  QUANTD    S                               TR0150
     C   84      S         COMP 0                    868786               TR0150
2028 C   87                GOTO \SE310                                    TR0150
2029 C   86                GOTO \SE320                                    TR0150
2030 C*----------------------------------------------------               TR0150
2031 C           \SE300    TAG                                            TR0150
2032 C*----------------------------------------------------               TR0150
2033 C                     MOVE 2         A5                              TR0150
2034 C                     Z-ADDQUANTD    F                               TR0150
2035 C           P2        ADD  QUANTD    P2                              TR0150
2036 C           Q         ADD  QUANTD    Q                               TR0150
2037 C                     GOTO \SE400                                    TR0150
2038 C*----------------------------------------------------               TR0150
2039 C           \SE310    TAG                                            TR0150
2040 C*----------------------------------------------------               TR0150
2041 C           M         SUB  R         M                               TR0150
2042 C                     Z-ADDR         E                               TR0150
2043 C           N2        ADD  R         N2                              TR0150
2044 C           O         ADD  R         O                               TR0150
2045 C                     Z-ADD0         I                               TR0150
2046 C                     Z-SUBS         I                               TR0150
2047 C                     Z-ADDI         F                               TR0150
2048 C           I         ADD  P2        P2                              TR0150
2049 C           I         ADD  Q         Q                               TR0150
2050 C                     MOVE 3         A5                              TR0150
2051 C                     GOTO \SE400                                    TR0150
2052 C*----------------------------------------------------               TR0150
2053 C           \SE320    TAG                                            TR0150
2054 C*----------------------------------------------------               TR0150
2055 C                     MOVE 1         A5                              TR0150
2056 C                     Z-ADDQUANTD    E                               TR0150
2057 C           M         SUB  QUANTD    M                               TR0150
2058 C           N2        ADD  QUANTD    N2                              TR0150
2059 C           O         ADD  QUANTD    O                               TR0150
2060 C                     GOTO \SE400                                    TR0150
2061 C*----------------------------------------------------               TR0150
2062 C           \SE400    TAG                                            TR0150
2063 C*----------------------------------------------------               TR0150
2064 C                     SETON                     74                   TR0150
2065 C                     EXCPT                                          TR0150
2066 C                     SETOF                     74                   TR0150
2067 C                     SETOF                     95                   TR0150
2068 C           AAA       CHAINDTR0050              95                   TR0150
     C*
     C           WDEL      IFGE 90
     C                     MOVEL19        WDELEV
     C                     ELSE
     C                     MOVEL20        WDELEV
     C                     ENDIF
     C                     MOVE DELEVC    WDELEV
     C                     Z-ADD0         WSEHAD  80
     C                     Z-ADD0         WFIDAY  80
     C*
2069 C   95                SETON                     71                   TR0150
2070 C   95                EXCPT                                          TR0150
2071 C   95                SETOF                     71                   TR0150
     C*---SPD
     C   95                EXSR #SPD
     C*BàÛç¸-
2072 C   95                SETON                     48                   TR0150
2073 C   95                EXCPT                                          TR0150
2074 C   95                SETOF                     48                   TR0150
2075 C   95                SETON                     47                   TR0150
2076 C   95                EXCPT                                          TR0150
2077 C   95                SETOF                     47                   TR0150
2078 C   95                SETON                     46                   TR0150
2079 C   95                EXCPT                                          TR0150
2080 C   95                SETOF                     46                   TR0150
2081 C   95                SETON                     41                   TR0150
2082 C   95                EXCPT                                          TR0150
2083 C   95                SETOF                     41                   TR0150
2084 C   95                GOTO \SE410                                    TR0150
2085 C  N95                GOTO \SE500                                    TR0150
2086 C*---------------------------------------------------                TR0150
2087 C           \SE410    TAG                                            TR0150
2088 C*----------------------------------------------------               TR0150
2089 C                     MOVE '        'DDD                             TR0150
2090 C                     MOVELAAA       DDD                             TR0150
2091 C                     MOVE Z2        DDD                             TR0150
2091 C                     Z-ADD0         WJUSEN  80                      TR0150
2091 C                     Z-ADDJ         WJUSEN  80                      TR0150
2092 C                     SETOF                     95                   TR0150
2093 C           DDD       CHAINDTR0070              95                   TR0150
2094 C   95                GOTO \SE41A                                    TR0150
2095 C  N95                SETON                     H1                   TR0150
2096 C           \SE41A    TAG                                            TR0150
2097 C                     SETON                     69                   TR0150
2098 C                     EXCPT                           WRITE DTR0070  TR0150
2099 C                     SETOF                     69                   TR0150
     C*
     C                     Z-ADDZ2        WKSEQ2  20
     C                     EXSR #TR011                     DTR0070
     C*
2100 C                     SETON                     72                   TR0150
2101 C                     EXCPT                                          TR0150
2102 C                     SETOF                     72                   TR0150
2103 C                     SETON                     63                   TR0150
2104 C                     EXCPT                           GAMEN14        TR0150
2105 C                     SETOF                     63                   TR0150
2106 C                     EXSR #SETL2                                    TR0150
2107 C                     GOTO END                                       TR0150
2108 C*----------------------------------------------------               TR0150
2109 C           \SE500    TAG                                            TR0150
2110 C*----------------------------------------------------               TR0150
2111 C                     Z-ADD0         EEE     20                      TR0150
2112 C           1         ADD  DETCNO    EEE                             TR0150
2113 C                     SETON                     68                   TR0150
2114 C                     EXCPT                                          TR0150
2115 C                     SETOF                     68                   TR0150
     C*
2116 C                     MOVE DETCNO    DDD                             TR0150
2116 C                     Z-ADDDETCNO    WKSEQ2                          TR0150
     C*
2091 C                     Z-ADD0         WJUSEN  80                      TR0150
2091 C                     Z-ADDJ         WJUSEN  80                      TR0150
2117 C                     SETOF                     95                   TR0150
2118 C           DDD       CHAINDTR0070              95                   TR0150
2119 C   95                GOTO \SE50A                                    TR0150
2120 C  N95                SETON                     H2                   TR0150
2121 C           \SE50A    TAG                                            TR0150
2122 C                     SETON                     69                   TR0150
2123 C                     EXCPT                           WRITE DTR0070  TR0150
2124 C                     SETOF                     69                   TR0150
     C*
     C                     EXSR #TR011                     DTR0070
     C*
2125 C                     SETON                     72                   TR0150
2126 C                     EXCPT                                          TR0150
     C                     SETOF                     72                   TR0150
2128 C                     SETON                     63                   TR0150
2129 C                     EXCPT                           GAMEN14        TR0150
2130 C                     SETOF                     63                   TR0150
2131 C                     EXSR #SETL2                                    TR0150
2132 C                     GOTO END                                       TR0150
2133 C*****************************************************               TR0150
2134 C           \SF15     TAG                                            TR0150
2135 C*****************************************************               TR0150
     C   KD                MOVELGLCLA7    WLCLA7
     C   KD                MOVELGSCLA7    WSCLA7
2137 C   KD                SETON                     58                   TR0150
2138 C   KD                EXCPT                           GAMEN9         TR0150
2139 C   KD                SETOF                     58                   TR0150
2140 C   KD                GOTO END                                       TR0150
2141 C  NKD                GOTO \SFXXX                                    TR0150
2142 C           \SFXXX    TAG                                            TR0150
2144 C                     SETOF                     848586               TR0150
2145 C           KETYNE    COMP 0                    848485               TR0150
2146 C   85                GOTO \SF100                                    TR0150
2147 C   84      KETYNE    COMP 1                    848486               TR0150
2148 C   86                GOTO \SF100                                    TR0150
2149 C   84                SETON                     8081                 TR0150
2150 C   84                GOTO \SF100                                    TR0150
2151 C           \SF100    TAG                                            TR0150
2153 C   80                SETON                     65                   TR0150
2154 C   80                EXCPT                                          TR0150
2155 C   80                SETOF                     65                   TR0150
2156 C   80                GOTO END                                       TR0150
2157 C  N80                GOTO \SF200                                    TR0150
2158 C           \SF200    TAG                                            TR0150
2160 C                     SETOF                     8485                 TR0150
2161 C           KETYNE    COMP 1                    848485               TR0150
2162 C   85                Z-ADD1         A6                              TR0150
2163 C   85                GOTO \S9100                                    TR0150
2164 C   84                GOTO \SF500                                    TR0150
2165 C           \SF500    TAG                                            TR0150
2167 C                     Z-ADD0         J       80                      TR0150
2168 C                     MOVELA         J                               TR0150
2169 C                     MOVE Z2        J                               TR0150
2170 C                     SETOF                     9596                 TR0150
2171 C           J         CHAINDTR0020              95                   TR0150
2172 C   95                GOTO \SF410                                    TR0150
2173 C  N95                GOTO \SF411                                    TR0150
2174 C*----------------------------------------------------               TR0150
2175 C           \SF410    TAG                                            TR0150
2176 C*----------------------------------------------------               TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8
     C                     Z-ADD*DATE     WREDY8
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8
     C                     ENDIF
     C                     EXSR #TRS
2178 C                     SETON                     77                   TR0150
2179 C                     EXCPT                                          TR0150
2180 C                     SETOF                     77                   TR0150
     C                     EXSR #DOJ
2181 C                     MOVE 01        J                               TR0150
2182 C           J         CHAINDTR0020              96                   TR0150
2183 C   96                GOTO \SF41A                                    TR0150
2184 C  N96                SETON                     H2                   TR0150
2185 C           \SF41A    TAG                                            TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8
     C                     Z-ADD*DATE     WREDY8
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8
     C                     ENDIF
     C                     EXSR #TRS
2186 C                     SETON                     75                   TR0150
2187 C                     EXCPT                                          TR0150
2188 C                     SETOF                     75                   TR0150
     C                     EXSR #DOJ
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
     C***                  SETOF                     90
     C***        J         CHAINDKK0380              90
     C***        *IN90     IFEQ '1'
     C***                  MOVEL'N9'      RECCDZ
     C***                  MOVEL*BLANK    ACRECZ
     C***                  Z-ADDJ         JUSENZ
     C***                  Z-ADD0         TOKSEZ
     C***                  EXSR #RTN4
     C***                  MOVEAWK4       TOKSSZ
     C***                  MOVELWTOTAM    TOTAMZ
     C***                  WRITERDKK0380
     C***                  ELSE
     C***                  MOVEL'N9'      RECCDZ
     C***                  MOVEL*BLANK    ACRECZ
     C***                  Z-ADDJ         JUSENZ
     C***                  Z-ADD0         TOKSEZ
     C***                  MOVEAWK4       TOKSSZ
     C***                  MOVELWTOTAM    TOTAMZ
     C***                  UPDATRDKK0380
     C****                 ENDIF
     C*-------
2189 C                     SETON                     93                   TR0150
2190 C                     EXCPT                                          TR0150
2191 C                     SETOF                     93                   TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
2192 C                     SETON                     52    GAME3          TR0150
2193 C                     EXCPT                                          TR0150
2194 C                     SETOF                     52                   TR0150
2195 C                     EXSR #SETL1                                    TR0150
2196 C                     GOTO END                                       TR0150
2197 C*----------------------------------------------------               TR0150
2198 C           \SF411    TAG                                            TR0150
2199 C*----------------------------------------------------               TR0150
2201 C                     Z-ADD0         K       20                      TR0150
2202 C           DETCNL    ADD  1         K                               TR0150
2203 C                     SETON                     76                   TR0150
2204 C                     EXCPT                                          TR0150
2205 C                     SETOF                     76                   TR0150
2206 C                     SETOF                     9596                 TR0150
2207 C                     MOVE DETCNL    J                               TR0150
2208 C           J         CHAINDTR0020              95                   TR0150
2209 C   95                GOTO \SF41B                                    TR0150
2210 C  N95                SETON                     H1                   TR0150
2211 C           \SF41B    TAG                                            TR0150
     C           REDY86    IFEQ 999999
     C***                  Z-ADD99999999  WREDY8
     C                     Z-ADD*DATE     WREDY8
     C                     ELSE
     C           20000000  ADD  REDY86    WREDY8
     C                     ENDIF
     C                     EXSR #TRS
2212 C                     SETON                     75                   TR0150
2213 C                     EXCPT                                          TR0150
2214 C                     SETOF                     75                   TR0150
     C                     EXSR #DOJ
     C* --- DTR0120 ---
     C                     SETOF                     90
     C           J         CHAINDTR0120              90
     C           *IN90     IFEQ '1'
     C                     MOVELJ         JUTNOV
     C                     MOVELGSEBA8    SHOCDV
     C                     MOVELWSHP11    SHPNRV
     C                     MOVELWYUBIN    YUBINV
     C                     MOVELWSHPN1    SHPNMV
     C                     MOVELWSHIP1    SHIP1V
     C                     MOVELWSHIP2    SHIP2V
     C                     MOVELWBUSYO    BUSYOV
     C                     MOVELWBIKO1    BIKO1V
     C                     MOVELWBIKO2    BIKO2V
     C                     MOVELWSHTEL    SHTELV
     C                     Z-ADDWDUEDY    DUEDYV
     C                     MOVELWTIMCD    TIMCDV
     C                     Z-ADDWSAGCD    SAGCDV
     C                     MOVELJ         JUTN2V
     C                     MOVE J         SEQN2V
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     EXSR #TEL4
     C                     ENDIF
     C*-------
     C***                  SETOF                     90
     C***        J         CHAINDKK0380              90
     C***        *IN90     IFEQ '1'
     C***                  MOVEL'NB'      RECCDZ
     C***                  MOVEL*BLANK    ACRECZ
     C***                  Z-ADDJ         JUSENZ
     C***                  Z-ADD0         TOKSEZ
     C***                  EXSR #RTN4
     C***                  MOVEAWK4       TOKSSZ
     C***                  MOVELWTOTAM    TOTAMZ
     C***                  WRITERDKK0380
     C***                  ELSE
     C***                  MOVEL'NB'      RECCDZ
     C***                  MOVEL*BLANK    ACRECZ
     C***                  Z-ADDJ         JUSENZ
     C***                  Z-ADD0         TOKSEZ
     C***                  MOVEAWK4       TOKSSZ
     C***                  MOVELWTOTAM    TOTAMZ
     C***                  UPDATRDKK0380
     C****                 ENDIF
     C*-------
2215 C                     SETON                     93                   TR0150
2216 C                     EXCPT                                          TR0150
2217 C                     SETOF                     93                   TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
2218 C                     SETON                     52    GAME3          TR0150
2219 C                     EXCPT                                          TR0150
2220 C                     SETOF                     52                   TR0150
2221 C                     EXSR #SETL1                                    TR0150
2222 C                     GOTO END                                       TR0150
2223 C*****************************************************               TR0150
2224 C           \SF16     TAG                                            TR0150
2225 C*****************************************************               TR0150
22   C                     EXSR #SETOF                                    TR0150
2228 C   KD                GOTO \SH001                                    TR0150
2229 C  NKD                GOTO \SHXXX                                    TR0150
2230 C           \SH001    TAG                                            TR0150
     C                     MOVELCUSID3    WCUSID                          TR0150
     C                     EXSR #DOJC                                     TR0150
2231 C                     SETON                     52    GAME3          TR0150
2232 C                     EXCPT                                          TR0150
2233 C                     SETOF                     52                   TR0150
2234 C                     EXSR #SETL1                                    TR0150
2235 C                     GOTO END                                       TR0150
2236 C           \SHXXX    TAG                                            TR0150
2237 C                     SETOF                     858687               TR0150
2238 C           INP11F    COMP 0                    858586               TR0150
2239 C   86                SETON                     8081                 TR0150
2240 C   86                GOTO \SH200                                    TR0150
2241 C   85                GOTO \SH100                                    TR0150
2242 C*----------------------------------------------------               TR0150
2243 C           \SH100    TAG                                            TR0150
2244 C*----------------------------------------------------               TR0150
2245 C                     Z-ADD0         B                               TR0150
2246 C                     MOVE INPN1F    B                               TR0150
2247 C                     MOVELA         B                               TR0150
2248 C                     SETOF                     95                   TR0150
2249 C           B         CHAINDTR0020              95                   TR0150
2250 C   95                SETON                     8081                 TR0150
2251 C   95                GOTO \SH200                                    TR0150
2252 C  N95                SETON                     67                   TR0150
2253 C  N95                EXCPT                                          TR0150
2254 C  N95                SETOF                     67                   TR0150
2255 C  N95                GOTO \SH200                                    TR0150
2256 C*----------------------------------------------------               TR0150
2257 C           \SH200    TAG                                            TR0150
2258 C*-----------------------------------------------------              TR0150
2259 C                     SETOF                     858687               TR0150
2260 C           INP22F    COMP 0                    858586               TR0150
2261 C   86                SETON                     8081                 TR0150
2262 C   86                GOTO \SH300                                    TR0150
2263 C   85                GOTO \SH250                                    TR0150
2264 C*----------------------------------------------------               TR0150
2265 C           \SH250    TAG                                            TR0150
2266 C*----------------------------------------------------               TR0150
2267 C                     Z-ADD0         B                               TR0150
2268 C                     MOVE INPN2F    B                               TR0150
2269 C                     MOVELA         B                               TR0150
     C                     SETOF                     95                   TR0150
     C           B         CHAINDTR0020              95                   TR0150
     C   95                SETON                     8081                 TR0150
     C   95                GOTO \SH300                                    TR0150
     C  N95                SETON                     67                   TR0150
     C  N95                EXCPT                                          TR0150
     C  N95                SETOF                     67                   TR0150
     C  N95                GOTO \SH300                                    TR0150
     C*----------------------------------------------------               TR0150
     C           \SH300    TAG                                            TR0150
2280 C*----------------------------------------------------               TR0150
2281 C   80                GOTO \SH301                                    TR0150
2282 C  N80                GOTO \SH302                                    TR0150
2283 C           \SH301    TAG                                            TR0150
2284 C                     SETON                     66                   TR0150
2285 C                     EXCPT                                          TR0150
2286 C                     SETOF                     66                   TR0150
2287 C                     EXSR #SETL1                                    TR0150
2288 C                     GOTO END                                       TR0150
2289 C           \SH302    TAG                                            TR0150
2290 C                     GOTO \SH400                                    TR0150
2291 C*----------------------------------------------------               TR0150
2292 C           \SH400    TAG                                            TR0150
2293 C*----------------------------------------------------               TR0150
2294 C                     Z-ADD0         B                               TR0150
2295 C                     MOVE INPN1F    B                               TR0150
2296 C                     MOVELA         B                               TR0150
2297 C                     SETOF                     95                   TR0150
2298 C           INPN1F    CHAINDTR0020              95                   TR0150
2299 C   95                SETON                     H8                   TR0150
2300 C  N95                SETON                     70                   TR0150
2301 C  N95                EXCPT                                          TR0150
2302 C  N95                SETOF                     70                   TR0150
2303 C  N95                SETON                     91                   TR0150
2304 C  N95                EXCPT                                          TR0150
2305 C  N95                SETOF                     91                   TR0150
2306 C  N95                GOTO \SH410                                    TR0150
2307 C*----------------------------------------------------               TR0150
2308 C           \SH410    TAG                                            TR0150
2309 C*----------------------------------------------------               TR0150
2310 C                     Z-ADD0         B                               TR0150
2311 C                     MOVE INPN2F    B                               TR0150
2312 C                     MOVELA         B                               TR0150
2313 C                     SETOF                     95                   TR0150
2314 C           INPN2F    CHAINDTR0020              95                   TR0150
2315 C   95                SETON                     H8                   TR0150
2316 C  N95                SETON                     70                   TR0150
2317 C  N95                EXCPT                                          TR0150
2318 C  N95                SETOF                     70                   TR0150
2319 C  N95                SETON                     91                   TR0150
2320 C  N95                EXCPT                                          TR0150
2321 C  N95                SETOF                     91                   TR0150
2322 C  N95                GOTO \SH420                                    TR0150
2323 C*----------------------------------------------------               TR0150
2324 C           \SH420    TAG                                            TR0150
2325 C*----------------------------------------------------               TR0150
2326 C                     SETOF                     858687               TR0150
23   C           INP33F    COMP 0                    858586               TR0150
2328 C   86                GOTO \SH440                                    TR0150
2329 C   85                GOTO \SH430                                    TR0150
2330 C*----------------------------------------------------               TR0150
2331 C           \SH430    TAG                                            TR0150
2332 C*----------------------------------------------------               TR0150
2333 C                     Z-ADD0         B                               TR0150
2334 C                     MOVE INPN3F    B                               TR0150
2335 C                     MOVELA         B                               TR0150
2336 C                     SETOF                     95                   TR0150
2337 C           B         CHAINDTR0020              95                   TR0150
2338 C   95                GOTO \SH440                                    TR0150
2339 C  N95                SETON                     70                   TR0150
2340 C  N95                EXCPT                                          TR0150
2341 C  N95                SETOF                     70                   TR0150
2342 C  N95                SETON                     91                   TR0150
2343 C  N95                EXCPT                                          TR0150
2344 C  N95                SETOF                     91                   TR0150
2345 C  N95                GOTO \SH440                                    TR0150
2346 C*----------------------------------------------------               TR0150
2347 C           \SH440    TAG                                            TR0150
2348 C*----------------------------------------------------               TR0150
2349 C                     SETOF                     858687               TR0150
2350 C           INP44F    COMP 0                    858586               TR0150
2351 C   86                GOTO \SH540                                    TR0150
2352 C   85                GOTO \SH530                                    TR0150
2353 C*----------------------------------------------------               TR0150
2354 C           \SH530    TAG                                            TR0150
2355 C*----------------------------------------------------               TR0150
2356 C                     Z-ADD0         B                               TR0150
2357 C                     MOVE INPN4F    B                               TR0150
2358 C                     MOVELA         B                               TR0150
2359 C                     SETOF                     95                   TR0150
2360 C           B         CHAINDTR0020              95                   TR0150
2361 C   95                GOTO \SH540                                    TR0150
2362 C  N95                SETON                     70                   TR0150
2363 C  N95                EXCPT                                          TR0150
2364 C  N95                SETOF                     70                   TR0150
2365 C  N95                SETON                     91                   TR0150
2366 C  N95                EXCPT                                          TR0150
2367 C  N95                SETOF                     91                   TR0150
2368 C  N95                GOTO \SH540                                    TR0150
2369 C*----------------------------------------------------               TR0150
2370 C           \SH540    TAG                                            TR0150
2371 C*----------------------------------------------------               TR0150
2372 C                     SETOF                     858687               TR0150
2373 C           INP55F    COMP 0                    858586               TR0150
2374 C   86                GOTO \SH640                                    TR0150
2375 C   85                GOTO \SH630                                    TR0150
2376 C*----------------------------------------------------               TR0150
2377 C           \SH630    TAG                                            TR0150
2378 C*----------------------------------------------------               TR0150
2379 C                     Z-ADD0         B                               TR0150
2380 C                     MOVE INPN5F    B                               TR0150
2381 C                     MOVELA         B                               TR0150
2382 C                     SETOF                     95                   TR0150
2383 C           B         CHAINDTR0020              95                   TR0150
2384 C   95                GOTO \SH640                                    TR0150
2385 C  N95                SETON                     70                   TR0150
2386 C  N95                EXCPT                                          TR0150
2387 C  N95                SETOF                     70                   TR0150
2388 C  N95                SETON                     91                   TR0150
2389 C  N95                EXCPT                                          TR0150
2390 C  N95                SETOF                     91                   TR0150
2391 C  N95                GOTO \SH640                                    TR0150
2392 C*----------------------------------------------------               TR0150
2393 C           \SH640    TAG                                            TR0150
2394 C*----------------------------------------------------               TR0150
2395 C                     SETOF                     858687               TR0150
2396 C           INP66F    COMP 0                    858586               TR0150
2397 C   86                GOTO \SH740                                    TR0150
2398 C   85                GOTO \SH730                                    TR0150
2399 C*----------------------------------------------------               TR0150
2400 C           \SH730    TAG                                            TR0150
2401 C*----------------------------------------------------               TR0150
2402 C                     Z-ADD0         B                               TR0150
2403 C                     MOVE INPN6F    B                               TR0150
2404 C                     MOVELA         B                               TR0150
2405 C                     SETOF                     95                   TR0150
2406 C           B         CHAINDTR0020              95                   TR0150
2407 C   95                GOTO \SH740                                    TR0150
2408 C  N95                SETON                     70                   TR0150
2409 C  N95                EXCPT                                          TR0150
2410 C  N95                SETOF                     70                   TR0150
2411 C  N95                SETON                     91                   TR0150
2412 C  N95                EXCPT                                          TR0150
2413 C  N95                SETOF                     91                   TR0150
2414 C  N95                GOTO \SH740                                    TR0150
2415 C*----------------------------------------------------               TR0150
2416 C           \SH740    TAG                                            TR0150
2417 C*----------------------------------------------------               TR0150
2418 C                     SETON                     66                   TR0150
2419 C                     EXCPT                                          TR0150
2420 C                     SETOF                     66                   TR0150
2421 C                     EXSR #SETL1                                    TR0150
2422 C                     GOTO END                                       TR0150
2423 C           END       TAG                                            TR0150
2424 C*----------------------------------------------------               TR0150
4052 C           #SETL1    BEGSR                                          TR0150
24   C                     Z-ADD10        SLN                             TR0150
2428 C                     Z-ADD0         B       80                      TR0150
2429 C                     MOVELA         B                               TR0150
2430 C           B         SETLLDTR0020L                                  TR0150
2431 C                     GOTO \#S1                                      TR0150
2432 C*----------------------------------------------------               TR0150
2433 C           \#S1      TAG                                            TR0150
2434 C*----------------------------------------------------               TR0150
2435 C                     SETOF                     954243               TR0150
2436 C                     READ DTR0020L                 95               TR0150
2437 C   95                GOTO \#SEND                                    TR0150
2438 C  N95                GOTO \#S2                                      TR0150
2439 C*----------------------------------------------------               TR0150
2440 C           \#S2      TAG                                            TR0150
2441 C*----------------------------------------------------               TR0150
2442 C                     SETOF                     9596                 TR0150
2443 C           A         COMP JUTNOS               959596               TR0150
2444 C   95                GOTO \#SEND                                    TR0150
2445 C   96                GOTO \#S33                                     TR0150
2446 C*----------------------------------------------------               TR0150
2447 C           \#S33     TAG                                            TR0150
2448 C*----------------------------------------------------               TR0150
2449 C   43                GOTO \#S1                                      TR0150
2450 C   42                GOTO \#S4                                      TR0150
2451 C*----------------------------------------------------               TR0150
2452 C           \#S4      TAG                                            TR0150
2453 C*----------------------------------------------------               TR0150
2454 C                     SETOF                     9596                 TR0150
2455 C           SEQNOS    COMP 0                    959596               TR0150
2456 C   96                GOTO \#S1                                      TR0150
2457 C   95                GOTO \#S5                                      TR0150
2458 C*----------------------------------------------------               TR0150
2459 C           \#S5      TAG                                            TR0150
2460 C*----------------------------------------------------               TR0150
     C                     SETOF                     9230
     C           A2S       IFNE 2
     C*
0520 C           JUSENS    CHAINDTR0120              92                   TR1021
     C           *IN92     IFEQ '0'
0520 C           SHPNRS    IFNE SHPNRV                                    TR1021
0512 C                     SETON                     30                   TR1021
     C                     ELSE
0512 C                     SETOF                     30                   TR1021
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C*----------------------------------------------------------
2461 C           1         ADD  SLN       SLN                             TR0150
2462 C                     SETOF                     9596                 TR0150
2463 C           SLN       COMP 17                   959695               TR0150
2464 C   95                GOTO \#SEND                                    TR0150
2465 C   96                GOTO \#S6                                      TR0150
2466 C*----------------------------------------------------               TR0150
2467 C           \#S6      TAG                                            TR0150
2468 C*----------------------------------------------------               TR0150
2469 C                     SETON                     53                   TR0150
2470 C                     EXCPT                                          TR0150
2471 C                     SETOF                     53                   TR0150
2472 C                     GOTO \#S1                                      TR0150
2473 C           \#SEND    ENDSR                                          TR0150
     C*----------------------------------------------------               TR0150
2475 C           #SETL2    BEGSR                                          TR0150
2477 C                     Z-ADD7         SLN                             TR0150
2478 C                     MOVE '        'DDD     8                       TR0150
2479 C                     MOVELAAA       DDD                             TR0150
2480 C           DDD       SETLLDTR0070L                                  TR0150
2481 C                     GOTO \#SE1                                     TR0150
2482 C*----------------------------------------------------               TR0150
2483 C           \#SE1     TAG                                            TR0150
2484 C*----------------------------------------------------               TR0150
2485 C                     SETOF                     844445               TR0150
2486 C                     READ DTR0070L                 84               TR0150
2487 C   84                GOTO \#1END                                    TR0150
2488 C  N84                GOTO \#SE2                                     TR0150
2489 C*----------------------------------------------------               TR0150
2490 C           \#SE2     TAG                                            TR0150
2491 C*----------------------------------------------------               TR0150
2492 C                     SETOF                     848586               TR0150
2493 C           AAA       COMP NBNBRT               848485               TR0150
2494 C   85                GOTO \#SE3X                                    TR0150
2495 C   84                GOTO \#1END                                    TR0150
2496 C*----------------------------------------------------               TR0150
2497 C           \#SE3X    TAG                                            TR0150
2498 C*----------------------------------------------------               TR0150
2499 C   45                GOTO \#SE1                                     TR0150
2500 C   44                GOTO \#SE4                                     TR0150
2501 C*----------------------------------------------------               TR0150
2502 C           \#SE4     TAG                                            TR0150
2503 C*----------------------------------------------------               TR0150
2504 C           1         ADD  SLN       SLN                             TR0150
2505 C                     SETOF                     848586               TR0150
2506 C           SLN       COMP 18                   848584               TR0150
2507 C   84                GOTO \#1END                                    TR0150
2508 C   85                SETON                     64                   TR0150
2509 C   85                EXCPT                                          TR0150
2510 C   85                SETOF                     64                   TR0150
2511 C   85                GOTO \#SE1                                     TR0150
2512 C           \#1END    ENDSR                                          TR0150
2513 C*----------------------------------------------------               TR0150
2514 C           #SETOF    BEGSR                                          TR0150
2516 C                     SETOF                     808182               TR0150
2517 C                     SETOF                     83                   TR0150
2518 C                     ENDSR                                          TR0150
     C*----------------------------------------------------               TR0150
     C           #ZIP      BEGSR
     C                     MOVELWZIP1     GYUB1
     C                     MOVELWZIP2     GYUB2
     C                     MOVELWZIP3     GYUB3
     C                     MOVEL'-'       GYUB4
     C                     MOVELWZIP4     GYUB5
     C                     MOVELWZIP5     GYUB6
     C                     MOVELWZIP6     GYUB7
     C                     MOVELWZIP7     GYUB8
     C                     ENDSR
     C*----------------------------------------------------               TR0150
     C           #CHKY     BEGSR
     C                     MOVELGYUB1     WYB     1
     C                     EXSR #CYB
     C                     MOVELGYUB2     WYB
     C                     EXSR #CYB
     C                     MOVELGYUB3     WYB
     C                     EXSR #CYB
     C                     MOVELGYUB5     WYB
     C                     EXSR #CYB
     C                     MOVELGYUB6     WYB
     C                     EXSR #CYB
     C                     MOVELGYUB7     WYB
     C                     EXSR #CYB
     C                     MOVELGYUB8     WYB
     C                     EXSR #CYB
     C*
     C           GYUB4     IFNE '-'
     C                     SETON                     8083
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------               TR0150
     C           #CYB      BEGSR
     C           WYB       IFEQ '1'
     C           WYB       OREQ '2'
     C           WYB       OREQ '3'
     C           WYB       OREQ '4'
     C           WYB       OREQ '5'
     C           WYB       OREQ '6'
     C           WYB       OREQ '7'
     C           WYB       OREQ '8'
     C           WYB       OREQ '9'
     C           WYB       OREQ '0'
     C                     ELSE
     C                     SETON                     8083
     C                     ENDIF
     C                     ENDSR
2519 C*----------------------------------------------------               TR0150
2520 C           #FIRST    BEGSR                                          TR0150
     C                     Z-ADD1000      KEKIN   90
2522 C                     MOVE ' '       B1      1                       TR0150
2522 C                     MOVE '1'       B11     1                       TR0150
2523 C                     MOVE '   '     B3      3                       TR0150
2524 C                     MOVE '  '      B2      2                       TR0150
2525 C                     MOVE '     '   B5      5                       TR0150
2526 C                     MOVE '      '  B6      6                       TR0150
25   C                     MOVE '       ' B7      7                       TR0150
2528 C                     MOVE '        'B8      8                       TR0150
2529 C                     MOVEL*BLANK    B9      9                       TR0150
2530 C                     MOVEL*BLANK    B71     7                       TR0150
2530 C                     MOVEL*BLANK    B72     9                       TR0150
2531 C                     MOVEL*BLANK    B15    15                       TR0150
2533 C                     MOVEL*BLANK    B25    25                       TR0150
2535 C                     MOVEL*BLANK    B30    30                       TR0150
2537 C                     MOVEL*BLANK    B40    40                       TR0150
2533 C                     MOVEL*BLANK    B301   30                       TR0150
2533 C                     MOVEL*BLANK    B251   25                       TR0150
2533 C                     MOVEL*BLANK    B252   25                       TR0150
2533 C                     MOVEL*BLANK    B254   25                       TR0150
2533 C                     MOVEL*BLANK    B2544  14                       TR0150
2533 C                     MOVEL*BLANK    B255   25                       TR0150
2539 C                     Z-ADD0         Z1      10                      TR0150
2539 C                     Z-ADD0         Z2      20                      TR0150
2539 C                     Z-ADD0         Z3      50                      TR0150
2540 C                     Z-ADD0         Z7      70                      TR0150
2541 C                     Z-ADD0         Z9      90                      TR0150
2542 C                     MOVEL'00000000'Z14    14                       TR0150
2542 C                     MOVE '000000'  Z14    14                       TR0150
2543 C                     Z-ADD0         Z8      80                      TR0150
2544 C                     Z-ADD0         Z6      60                      TR0150
2545 C                     Z-ADD0         Z2      20                      TR0150
2546 C                     Z-ADD1         Z11     20                      TR0150
2547 C                     Z-ADD0         Z5      50                      TR0150
2548 C                     Z-ADD2         Z21     20                      TR0150
2549 C                     Z-ADD0         TIME    60                      TR0150
2549 C                     Z-ADD0         ZZ9     90                      TR0150
2549 C                     Z-ADD0         ZZ6     60                      TR0150
2549 C                     Z-ADD0         ZZ5     60                      TR0150
     C                     MOVEL*BLANK    SAKB1   6
     C                     Z-ADD0         SURY1   70
     C                     MOVEL'C'       GSEBA8
     C                     MOVEL*BLANK    TOKSS7
     C                     MOVEL*BLANK    CODE17
     C                     MOVEL*BLANK    SHICD7
     C                     MOVEL*BLANK    GSAKS7
     C                     Z-ADD0         WJUTNO  80
     C                     Z-ADD0         WMADEL  60
     C                     MOVEL'00'      WCODE7  2
     C                     MOVEL*BLANK    NBNBRA
     C                     MOVEL*BLANK    GTRACE
     C                     TIME           TIME                            TR0150
     C                     Z-ADD0         WSEQNO  20                      TR0150
     C                     MOVEL*BLANK    WTOKSS
     C                     MOVEL*BLANK    WTOTAM
     C                     MOVEL*BLANK    WTOTAN
     C                     MOVEA*BLANK    WK3
     C                     MOVEA*BLANK    WK4
     C                     MOVEL*BLANK    WLCLA7  5
     C                     MOVEL*BLANK    WMCLA7  5
     C                     MOVEL*BLANK    WSCLA7  5
     C                     MOVE *ALL'0'   SURY99 15
     C                     MOVEL*BLANK    WCUSID  6
     C*
     C                     SETOF                     90
     C           'KEY'     CHAINDTR9900              90
     C           *IN90     IFEQ '0'
     C                     Z-ADDETIMEX    WKTIME  60
     C                     ENDIF
     C*LOG
     C                     Z-ADDW#SYMD    WCRTD2  80
     C                     Z-ADDW#SHMS    WCRTT2  60
     C                     MOVELS#USR     WUSID2  4
     C                     MOVELS#JOB     WJBID2  4
     C                     MOVELS#PGID    WPGID2 10
     C                     Z-ADD0         WKSEHA  60
     C                     Z-ADD0         WKNSEQ  20
     C                     Z-ADD0         WKOUTQ  50
     C                     Z-ADD0         WKOWQU  50
     C                     Z-ADD0         WKFIQU  50
     C                     MOVEL*BLANK    WKFNAI  1
     C                     Z-ADD0         WKBUNN  20
     C                     Z-ADD0         WKFIDA  60
     C*
2551 C                     SETON                     OF                   TR0150
2552 C                     ENDSR                                          TR0150
     C*---------------------------------------------
     C           #NOKI     BEGSR
     C           CLOCK     IFLE WKTIME
     C*
     C                     SETOF                     95
     C           W#SYMD    CHAINDTP1110              95
     C           *IN95     IFEQ '0'
     C*
     C           BIKO1R    IFEQ '*'
     C*---------------------------------------------
     C*âcã∆ì˙
     C                     Z-ADDW#SYMD    P#DAY1
     C                     Z-ADD1         P#DATE
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR110
     C                     MOVE P#DAY2    REDY86
     C*
     C                     ELSE
     C           TANA1R    IFEQ '*'
     C*âcã∆ì˙
     C                     Z-ADDW#SYMD    P#DAY1
     C                     Z-ADD0         P#DATE
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR110
     C                     MOVE P#DAY2    REDY86
     C                     ELSE
     C                     Z-ADDUDATE     REDY86
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ELSE
     C*---------------------------------------------
     C*âcã∆ì˙
     C                     SETOF                     95
     C           W#SYMD    CHAINDTP1110              95
     C           *IN95     IFEQ '0'
     C                     Z-ADDW#SYMD    P#DAY1
     C*
     C           TANA1R    IFEQ '*'
     C                     Z-ADD0         P#DATE
     C                     ELSE
     C                     Z-ADD1         P#DATE
     C                     ENDIF
     C                     ENDIF
     C*
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR110
     C*
     C                     MOVE P#DAY2    REDY86
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #RTN1     BEGSR
     C                     SETOF                     9081
     C           A1        IFEQ 'E'
     C                     MOVEA*BLANK    WK1
     C                     MOVEA*BLANK    WK2
     C                     MOVEL'00000000'L
     C                     MOVE '000000'  L
     C           ITDS14    CHAINDTR5170              90
     C           *IN90     IFEQ '0'
     C           ACRECA    IFEQ *BLANK
     C           UNPRI     ANDNE0
     C*23/09/27
     C                     MOVELITDS14    P#ITCD
     C                     MOVEL' '       P#HAIK
     C                     CALL '@SS0171' PAR160
     C           P#HAIK    IFEQ '*'
     C                     SETON                     8183
     C                     GOTO \S7300
     C                     ENDIF
     C*
     C                     MOVEAITNBR7    WK1
     C                     MOVELDESNO     L
     C           WKCUS     IFEQ '0'
     C                     MOVEAITDSJ     WK2
     C                     ELSE
     C                     MOVEAITDSE     WK2
     C                     ENDIF
     C*
     C                     Z-ADD1         Y       20
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C                     MOVE WK1,Y     WKITD1  1                    +
     C           WKITD1    IFEQ *BLANK                     *********   +
     C                     Z-ADD1         Z       20                   +
     C           Y         ADD  1         Y                            +
     C*                                                                +
     C                     Z-ADD0         FLAG11  10                   +
     C           FLAG11    DOWEQ0                          +++++++     +
     C           Y         IFLE 30                         ***** +     +
     C                     MOVE WK2,Z     WK1,Y                * +     +
     C           Y         ADD  1         Y                    * +     +
     C           Z         ADD  1         Z                    * +     +
     C                     ELSE                            ----* +     +
     C                     MOVEAWK1       ITNBR7               * +     +
     C                     Z-ADD0         Z                    * +     +
     C                     Z-ADD0         Y                    * +     +
     C                     Z-ADD1         FLAG11               * +     +
     C                     Z-ADD1         FLAG10               * +     +
     C                     ENDIF                           ***** +     +
     C*                                                          +     +
     C                     ENDDO                           +++++++     +
     C*                                                            *   +
     C                     ELSE                            --------*   +
     C           Y         ADD  1         Y                        *   +
     C                     ENDIF                           *********   +
     C*                                                                +
     C                     ENDDO                           +++++++++++++
     C*
     C           WKCUS2    IFNE '0K'
     C                     Z-ADDUNPRI     G
     C           UNPRI     MULT QUANT7    H
     C                     ELSE
     C                     Z-ADDUNPR1     G
     C           UNPR1     MULT QUANT7    H
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETON                     81
     C                     GOTO \S7300
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETOF                     90
     C           ITDS14    CHAINDTR5178              90
     C           *IN90     IFEQ '0'
     C*
     C           ACRECB    IFEQ *BLANK
     C           UNPRI     ANDNE0
     C                     MOVELITDS14    L
     C                     ELSE
     C                     SETON                     81
     C                     GOTO \S7300
     C                     ENDIF
     C*
     C                     ELSE
     C*
     C           ACRECB    IFEQ *BLANK
     C           UNPRI     ANDNE0
     C*
     C                     SETOF                     90
     C           ITDS14    CHAINNPR0100              90
     C           *IN90     IFEQ '0'
     C                     MOVELITDS14    L
     C                     ELSE
     C*
     C                     SETOF                     90
     C           ITDS14    CHAINDMP0100              90
     C           *IN90     IFEQ '0'
     C                     MOVELITDS14    L
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETON                     81
     C                     GOTO \S7300
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #RTN2     BEGSR
     C                     SETOF                     90
     C           A1        IFEQ 'E'
     C                     MOVEA*BLANK    WK1
     C                     MOVEA*BLANK    WK2
     C                     MOVEL'00000000'L
     C                     MOVE '000000'  L
     C           ITD14A    CHAINDTR5170              90
     C           *IN90     IFEQ '0'
     C                     MOVELDESNO     L
     C                     MOVEAITNBRA    WK1
     C           WKCUS     IFEQ '0'
     C                     MOVEAITDSJ     WK2
     C                     ELSE
     C                     MOVEAITDSE     WK2
     C                     ENDIF
     C*
     C                     Z-ADD1         Y       20
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C                     MOVE WK1,Y     WKITD1  1                    +
     C           WKITD1    IFEQ *BLANK                     *********   +
     C                     Z-ADD1         Z       20                   +
     C           Y         ADD  1         Y                            +
     C*                                                                +
     C                     Z-ADD0         FLAG11  10                   +
     C           FLAG11    DOWEQ0                          +++++++     +
     C           Y         IFLE 30                         ***** +     +
     C                     MOVE WK2,Z     WK1,Y                * +     +
     C           Y         ADD  1         Y                    * +     +
     C           Z         ADD  1         Z                    * +     +
     C                     ELSE                            ----* +     +
     C                     MOVEAWK1       ITNBRA               * +     +
     C                     Z-ADD0         Z                    * +     +
     C                     Z-ADD0         Y                    * +     +
     C                     Z-ADD1         FLAG11               * +     +
     C                     Z-ADD1         FLAG10               * +     +
     C                     ENDIF                           ***** +     +
     C*                                                          +     +
     C                     ENDDO                           +++++++     +
     C*                                                            *   +
     C                     ELSE                            --------*   +
     C           Y         ADD  1         Y                        *   +
     C                     ENDIF                           *********   +
     C                     ENDDO                           +++++++++++++
     C*
     C                     Z-ADDUNPRI     G
     C           UNPRI     MULT QUANTA    H
     C                     ELSE
     C                     SETOF                     90
     C           ITD14A    CHAINDTR5178              90
     C           *IN90     IFEQ '0'
     C                     MOVELITD14A    L
     C                     ELSE
     C                     SETOF                     90
     C           ITD14A    CHAINNPR0100              90
     C           *IN90     IFEQ '0'
     C                     MOVELITD14A    L
     C                     ELSE
     C*
     C                     SETOF                     90
     C           ITDS14    CHAINDMP0100              90
     C           *IN90     IFEQ '0'
     C                     MOVELITDS14    L
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDSR
     C*--------------------------------------------------------
     C           #RTN3     BEGSR
     C                     MOVEL*BLANK    B25              KATA3
     C                     MOVEL*BLANK    B251             ê}î‘
     C                     MOVEL*BLANK    B252             ïiñº
     C                     MOVEL*BLANK    B254
     C                     MOVEL*BLANK    B255             PE.∫›Œﬂ≥
     C                     MOVEL*BLANK    B71
     C                     MOVEL*BLANK    B72
     C                     MOVEL*BLANK    B301
     C                     MOVEL*BLANK    WITNBX 14
     C                     MOVELL         WITNBX
     C*
     C                     SETOF                     29
     C                     MOVEL*BLANK    B256   25
     C                     MOVEL*BLANK    B257   25
     C                     MOVEL*BLANK    B258   25
     C*ÉGÉAîÃÇÃèÍçá
     C           A1        IFEQ 'B'
     C           A2        IFEQ 0
     C           AIRCD8    IFEQ '1'
     C                     EXSR #RTN31
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C           A1        IFEQ 'E'
     C           A2        IFEQ 0
     C           AIRCD8    IFEQ '1'
     C                     EXSR #RTN31
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*  --- ∑›∂ﬁ∏ ----
     C                     Z-ADD0         WWKING  70
     C                     Z-ADD0         WWKIN2  90
     C                     SETOF                     90
     C           WITNBR    CHAINDMR0040              90
     C           *IN90     IFEQ '0'
     C                     Z-ADDTANKA8    WWKING
     C                     Z-ADDLSTPCJ    WWKIN2
     C                     MOVE WWKING    B71
     C                     MOVE WWKIN2    B72
     C                     ELSE
     C                     Z-ADDTANKA8    WWKING
     C                     Z-ADDWWKING    WWKIN2
     C                     MOVE WWKING    B71
     C                     MOVE WWKIN2    B72
     C                     ENDIF
     C*    --- êVÉ}ÉXÉ^Å[
     C                     SETOF                     90
     C           WITNBX    CHAINNPR0100              90
     C           *IN90     IFEQ '0'
     C           PLACE1    IFEQ 'K'
     C                     MOVELLOCAK1    B301
     C                     ELSE
     C                     MOVELLOCAO1    B301
     C                     ENDIF
     C*
     C                     MOVELWITNBX    B251
     C                     MOVELITDSC1    B252
     C                     MOVEL'∫ﬁ≥π≤'   B2544
     C                     MOVE ' ∫√ ≤'   B2544
     C*
     C                     Z-ADD0         W#GOK
     C           QUANT7    MULT UNPCS     W#GOK   50
     C                     MOVE W#GOK     W#QU3
     C                     SELEC
     C           W#GOK     WHLE 9
     C                     MOVEL'    '    W#QU3
     C           W#GOK     WHLE 99
     C                     MOVEL'   '     W#QU3
     C           W#GOK     WHLE 999
     C                     MOVEL'  '      W#QU3
     C           W#GOK     WHLE 9999
     C                     MOVEL' '       W#QU3
     C                     ENDSL
     C*
     C                     MOVELB2544     B254
     C                     MOVEL'PE.∫›Œﬂ≥'B255
     C                     MOVELTBL01,1   B25
     C*
     C                     MOVE UNPCS     W#QU1
     C                     SELEC
     C           UNPCS     WHLE 9
     C                     MOVEL'   '     W#QU1
     C           UNPCS     WHLE 99
     C                     MOVEL'  '      W#QU1
     C           UNPCS     WHLE 999
     C                     MOVEL' '       W#QU1
     C           UNPCS     WHLE 9999
     C                     ENDSL
     C*
     C                     MOVE QUANT7    W#QU2
     C                     SELEC
     C           QUANT7    WHLE 9
     C                     MOVEL'   '     W#QU2
     C           QUANT7    WHLE 99
     C                     MOVEL'  '      W#QU2
     C           QUANT7    WHLE 999
     C                     MOVEL' '       W#QU2
     C           QUANT7    WHLE 9999
     C                     ENDSL
     C*
     C                     ELSE
     C*    --- ãåÉ}ÉXÉ^Å[
     C                     SETOF                     90
     C           WITNBX    CHAINDMP0100              90
     C           *IN90     IFEQ '0'
     C                     MOVELWITNBX    B251
     C                     MOVELITDSCW    B252
     C                     MOVEL'∫ﬁ≥π≤'   B2544
     C                     MOVE ' ∫√ ≤'   B2544
     C                     MOVELB2544     B254
     C                     MOVEL'PE.∫›Œﬂ≥'B255
     C*
     C                     MOVELTBL01,1   B25
     C*
     C                     MOVE UNPCS     W#QU1
     C                     SELEC
     C           UNPCS     WHLE 9
     C                     MOVEL'   '     W#QU1
     C           UNPCS     WHLE 99
     C                     MOVEL'  '      W#QU1
     C           UNPCS     WHLE 999
     C                     MOVEL' '       W#QU1
     C           UNPCS     WHLE 9999
     C                     ENDSL
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*-------------------------------------------------------
     C           #RTN31    BEGSR
     C                     MOVEL'º≠≥ÿÀ›∂›'AR1    16
     C                     MOVE 'æ≤Ω– -¥±'AR1
     C                     MOVELAR1       AR2    19
     C                     MOVE ' ›∞'     AR2
     C                     MOVELAR2       B256
     C                     MOVEL'¥± ›÷ÿ:' B257
     C                     MOVEL'ºÆ≥“≤ºÆ:'B258
     C                     SETON                     29
     C                     ENDSR
     C*----------------------------------------------------------
     C* ƒŸ∏æØƒ
     C           #RTN4     BEGSR
     C           TOKSS7    IFNE *BLANK
     C                     SETOF                     90
     C*
     C                     MOVEA*BLANK    WK3
     C                     MOVEA*BLANK    WK4
     C                     MOVEATOKSS7    WK3
     C*
     C           WK3,1     IFEQ *BLANK
     C                     MOVEAWK3       WK4
     C                     ELSE
     C*
     C                     Z-ADD1         Y
     C                     Z-ADD1         Z
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C           WK3,Y     IFEQ *BLANK                     *********   +
     C           Y         ORGT 11                         *********   +
     C           Y         SUB  1         Y
     C           12        SUB  Y         Z
     C*
     C           Z         IFEQ 0
     C                     Z-ADD1         Z
     C                     ENDIF
     C*
     C                     MOVEAWK3       WK4,Z
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C           Y         ADD  1         Y
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEA*BLANK    WK3
     C                     MOVEA*BLANK    WK4
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C* ƒŸ∏æØƒ
     C           #RTN5     BEGSR
     C                     MOVEL*BLANK    W#TOK1  6
     C                     MOVEL*BLANK    W#TOK2  7
     C                     Z-ADD0         W#TOK3  90
     C                     Z-ADD0         W#TOK4  90
     C                     Z-ADD0         W#TOK5  93
     C                     Z-ADD0         W#TOK6  93
     C           TOKSS7    IFNE *BLANK
     C                     SETOF                     90
     C*
     C                     MOVEA*BLANK    WT1
     C                     MOVEA*BLANK    WT2              êÆêî
     C                     MOVEA*BLANK    WT3
     C                     MOVEA*BLANK    WT4              è¨êî
     C*
     C                     MOVEATOKSS7    WT1
     C*
     C           '.'       SCAN WTOKSS    W       10
     C*
     C           WT1,1     IFEQ *BLANK
     C                     MOVEAWT1       WK4
     C                     ELSE
     C*
     C                     Z-ADD1         Y
     C                     Z-ADD1         Z
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C           WT1,Y     IFEQ *BLANK                     *********   +
     C           WT1,Y     OREQ '.'                        *********   +
     C           Y         ORGT 6                          *********   +
     C           Y         SUB  1         Y
     C           7         SUB  Y         Z
     C*
     C           Z         IFEQ 0
     C                     Z-ADD1         Z
     C                     ENDIF
     C*
     C                     MOVEAWT1       WT2,Z
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C           Y         ADD  1         Y
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDIF
     C*
     C           W         IFNE 0
     C*
     C           W         ADD  1         Y
     C                     Z-ADD1         Z
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C           WT1,Y     IFEQ *BLANK                     *********   +
     C*
     C           Z         IFEQ 0
     C                     Z-ADD1         Z
     C                     ENDIF
     C*
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C                     MOVEAWT1,Y     WT3,Z
     C           Y         ADD  1         Y
     C           Z         ADD  1         Z
     C                     ENDIF
     C                     ENDDO
     C*--------------------------------
     C                     Z-ADD1         Y
     C                     Z-ADD1         Z
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C           WT3,Y     IFEQ *BLANK                     *********   +
     C           WT1,Y     OREQ '.'                        *********   +
     C           Y         ORGT 6                          *********   +
     C           Y         SUB  1         Y
     C           7         SUB  Y         Z
     C*
     C           Z         IFEQ 0
     C                     Z-ADD1         Z
     C                     ENDIF
     C*
     C                     MOVEAWT3       WT4,Z
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C           Y         ADD  1         Y
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDIF
     C*
     C                     MOVEAWT2       W#TOK1
     C                     MOVEAWT4       W#TOK2
     C                     MOVE W#TOK1    W#TOK3
     C                     MOVE W#TOK2    W#TOK4
     C*
     C                     SELEC
     C           W#TOK4    WHGE 1
     C           W#TOK4    ANDLT10
     C           W#TOK4    DIV  10        W#TOK6
     C           W#TOK4    WHGE 10
     C           W#TOK4    ANDLT100
     C           W#TOK4    DIV  100       W#TOK6
     C           W#TOK4    WHGE 100
     C           W#TOK4    ANDLT1000
     C           W#TOK4    DIV  1000      W#TOK6
     C                     ENDSL
     C*
     C           W#TOK3    ADD  W#TOK6    W#TOK5
     C*ÉgÉãÉNíPà ämîF
     C*6/12                SETOF                     8087
     C                     SETOF                     87
     C           WTOTAM    IFEQ TOTAMJ
     C*
     C           UPPERJ    IFNE 0
     C           LOWERJ    ANDNE0
     C           W#TOK5    IFGE LOWERJ
     C           W#TOK5    ANDLEUPPERJ
     C*6/12                SETOF                     8087
     C                     SETOF                     87
     C                     ELSE
     C                     SETON                     8087
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEA*BLANK    WT1
     C                     MOVEA*BLANK    WT2
     C                     MOVEA*BLANK    WT3
     C                     MOVEA*BLANK    WT4
     C                     ENDIF
     C                     ENDSR
     C*-------------------------------------------------------
     C           #SPD      BEGSR
     C                     MOVEL' '       P#KOSN
     C                     MOVEL'7'       P#SBTP
     C                     MOVELWAA1      P#KEY1
     C                     MOVELWAA2      P#KEY2
     C                     MOVE WAA4      P#KEY3
     C                     MOVEL*BLANK    P#KEY4
     C                     MOVEL*BLANK    P#ITCD
     C                     Z-ADDQUANT7    P#MFIQ
     C                     MOVE J         P#JUTN
     C                     MOVELITNBR7    P#IDSC
     C                     MOVEL' '       P#ITNO
     C                     MOVEL*BLANK    P#RTCD                           *  +
     C                     CALL 'CT5000R' PAR050
     C                     ENDSR
     C*-------------------------------------------------------
     C           #TR010    BEGSR
     C                     MOVEL*BLANK    P#DELC
     C                     Z-ADD1         P#SELC
     C                     MOVELINPN28    P#KOSN
     C                     Z-ADDWKJUTN    P#JUT4
     C                     Z-ADDWKSEQN    P#SEQ4
     C                     MOVEL*BLANK    P#NBNB
     C                     MOVEL*BLANK    P#NB11
     C                     MOVEL*BLANK    P#NB21
     C                     MOVEL*BLANK    P#NB31
     C                     MOVEL*BLANK    P#NB41
     C                     MOVEL*BLANK    P#NB51
     C                     Z-ADD0         P#DE11
     C                     Z-ADD0         P#DE21
     C                     Z-ADD0         P#DE31
     C                     Z-ADD0         P#DE41
     C                     Z-ADD0         P#DE51
     C                     MOVEL*BLANK    P#RECD
     C                     CALL '@TR0010' PAR010           é©ìÆà¯ìñ
     C*
     C                     MOVEL*BLANK    W1NB11  6
     C                     MOVEL*BLANK    W1NB21  6
     C                     MOVEL*BLANK    W1NB31  6
     C                     Z-ADD0         W1DE11  60
     C                     Z-ADD0         W1DE21  60
     C                     Z-ADD0         W1DE31  60
     C*
     C                     MOVELP#NB11    W1NB11
     C                     MOVELP#NB21    W1NB21
     C                     MOVELP#NB31    W1NB31
     C                     Z-ADDP#DE11    W1DE11
     C                     Z-ADDP#DE21    W1DE21
     C                     Z-ADDP#DE31    W1DE31
     C                     ENDSR
     C*-------------------------------------------------------
     C           #TR011    BEGSR
     C                     MOVEL*BLANK    P#DELC
     C                     Z-ADD2         P#SELC
     C                     MOVEL*BLANK    P#KOSN
     C                     Z-ADD0         P#JUT4
     C                     Z-ADDWKSEQ2    P#SEQ4
     C                     MOVELAAA       P#NBNB
     C                     MOVEL*BLANK    P#NB11
     C                     MOVEL*BLANK    P#NB21
     C                     MOVEL*BLANK    P#NB31
     C                     MOVEL*BLANK    P#NB41
     C                     MOVEL*BLANK    P#NB51
     C                     Z-ADD0         P#DE11
     C                     Z-ADD0         P#DE21
     C                     Z-ADD0         P#DE31
     C                     Z-ADD0         P#DE41
     C                     Z-ADD0         P#DE51
     C                     MOVEL*BLANK    P#RECD
     C                     CALL '@TR0010' PAR010
     C*
     C                     MOVEL*BLANK    W2NB11  6
     C                     MOVEL*BLANK    W2NB21  6
     C                     MOVEL*BLANK    W2NB31  6
     C                     Z-ADD0         W2DE11  60
     C                     Z-ADD0         W2DE21  60
     C                     Z-ADD0         W2DE31  60
     C*
     C                     MOVELP#NB11    W2NB11
     C                     MOVELP#NB21    W2NB21
     C                     MOVELP#NB31    W2NB31
     C                     Z-ADDP#DE11    W2DE11
     C                     Z-ADDP#DE21    W2DE21
     C                     Z-ADDP#DE31    W2DE31
     C                     ENDSR
     C*-----------------------------------------------------
     C           #TANI     BEGSR
     C                     MOVEL*BLANK    WTOTAN  6
     C                     SELEC
     C           WTOTAM    WHEQ '1'
     C                     MOVEL'KGF.CM'  WTOTAN
     C           WTOTAM    WHEQ '2'
     C                     MOVEL'KGF.M '  WTOTAN
     C           WTOTAM    WHEQ '3'
     C                     MOVEL'CN.M  '  WTOTAN
     C           WTOTAM    WHEQ '4'
     C                     MOVEL'N.M   '  WTOTAN
     C           WTOTAM    WHEQ '5'
     C                     MOVEL'LBF.IN'  WTOTAN
     C           WTOTAM    WHEQ '6'
     C                     MOVEL'LBF.FT'  WTOTAN
     C           WTOTAM    WHEQ '7'
     C                     MOVEL'CMKP  '  WTOTAN
     C           WTOTAM    WHEQ '8'
     C                     MOVEL'OZF.IN'  WTOTAN
     C                     ENDSL
     C                     ENDSR
     C*-----------------------------------------------------
     C           #PART     BEGSR
     C                     SETOF                     9995
     C           ITNB14    CHAINDTR5170              95
     C           *IN95     IFEQ '0'
     C           LANKU     IFEQ '*'
     C                     MOVELCUSNR2    P#CUSN
     C                     MOVELSHPNR3    P#SHPN
     C                     MOVELORDNO3    P#ODNO
     C                     Z-ADDJUTDY3    P#JUDY
     C                     Z-ADDSLSNR3    P#SLSN
     C                     Z-ADDINPN25    P#INPN
     C                     Z-ADDBUNYN6    P#BUYN
     C                     Z-ADDDELCD6    P#DECD
     C                     Z-ADDDELDY6    P#DEDY
     C                     Z-ADDSHCCD6    P#SHCD
     C                     MOVELITNBR7    P#ITNB
     C                     Z-ADDQUANT7    P#QUAN
     C                     MOVELCODE17    P#GCOD
     C                     MOVEL*BLANK    P#RTC1
     C                     MOVELA         P#JUNO
     C                     MOVE 0         P#JUNO
     C                     Z-ADD0         P#TANK
     C                     Z-ADD0         P#KING
     C                     MOVELITNB17    P#ITNR
     C                     MOVELWJUTK1    P#JUTK
     C                     MOVELWSHP11    P#SHP1
     C                     MOVELWSHPN1    P#SHPM
     C                     MOVELWYUBIN    P#YUBI
     C                     MOVELWSHIP1    P#SHI1
     C                     MOVELWSHIP2    P#SHI2
     C                     MOVELWBIKO1    P#BIKO
     C                     MOVELWBIKO2    P#BIK2
     C                     MOVELWBUSYO    P#BUSY
     C                     MOVELWSHTEL    P#SHTE
     C                     Z-ADDWDUEDY    P#DUDY
     C                     MOVELWTIMCD    P#TMCD
     C                     Z-ADDWSAGCD    P#SAGC
     C                     Z-ADD0         P#RJUN
     C                     Z-ADDWKTIME    P#CLOK
     C                     MOVELDOJCD3    P#DJCD
     C                     MOVELGTRACE    P#TGCD
     C***                  CALL '@TR0153' PAR020            ﬂ∞¬ºÆÿ
     C                     CALL '@TR0154' PAR020            ﬂ∞¬ºÆÿ
     C                     MOVEL'  '      GTRACE
     C           P#RTC1    IFEQ '9'
     C                     ELSE
     C                     SETON                     28
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #PAR1     BEGSR
     C                     SETOF                     9995
     C           ITN14A    CHAINDTR5170              95
     C           *IN95     IFEQ '0'
     C           LANKU     IFEQ '*'
     C                     MOVELCUSNR2    P#CUSN
     C                     MOVELSHPNR3    P#SHPN
     C                     MOVELORDNO3    P#ODNO
     C                     Z-ADDJUTDY3    P#JUDY
     C                     Z-ADDSLSNR3    P#SLSN
     C                     Z-ADDINPN25    P#INPN
     C                     Z-ADD0         P#BUYN
     C                     Z-ADD0         P#DECD
     C                     Z-ADD0         DELDY6
     C                     Z-ADDDELDY6    P#DEDY
     C                     Z-ADD0         P#SHCD
     C                     MOVELITNBRA    P#ITNB
     C                     Z-ADDQUANTA    P#QUAN
     C                     MOVELCODE1A    P#GCOD
     C                     MOVEL*BLANK    P#RTC1
     C                     MOVELA         P#JUNO
     C                     MOVE 0         P#JUNO
     C                     Z-ADDG         P#TANK
     C                     Z-ADDH         P#KING
     C                     MOVELITNB1A    P#ITNR
     C                     MOVELWJUTK1    P#JUTK
     C                     MOVELWSHP11    P#SHP1
     C                     MOVELWSHPN1    P#SHPM
     C                     MOVELWYUBIN    P#YUBI
     C                     MOVELWSHIP1    P#SHI1
     C                     MOVELWSHIP2    P#SHI2
     C                     MOVELWBIKO1    P#BIKO
     C                     MOVELWBIKO2    P#BIK2
     C                     MOVELWBUSYO    P#BUSY
     C                     MOVELWSHTEL    P#SHTE
     C                     Z-ADDWDUEDY    P#DUDY
     C                     MOVELWTIMCD    P#TMCD
     C                     Z-ADDWSAGCD    P#SAGC
     C                     Z-ADD0         P#RJUN
     C                     Z-ADDWKTIME    P#CLOK
     C                     MOVELDOJCD3    P#DJCD
     C                     MOVELGTRACE    P#TGCD
     C***                  CALL '@TR0153' PAR020
     C                     CALL '@TR0154' PAR020
     C                     MOVEL'  '      GTRACE
     C           P#RTC1    IFEQ '9'
     C                     ELSE
     C                     SETON                     28
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #BUKM     BEGSR
     C                     MOVELITNBR7    P#ITN1
     C                     MOVE QUANT7    P#QUNT
     C                     MOVELAAA       P#NBN1
     C                     MOVELJ         P#JUT1
     C                     MOVEL*BLANK    P#JUK1
     C                     Z-ADD0         P#DETC
     C                     Z-ADD0         P#RTC2
     C                     CALL '@TR0160' PAR030
     C*
     C           P#RTC2    IFEQ 0
     C                     MOVELP#JUK1    WJUTK1
     C                     Z-ADDP#DETC    Z11
     C                     MOVEL'1'       ZAISIC
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #PLACE    BEGSR
     C                     MOVELWITNBR    W#ITNB 14
     C                     SETOF                     90
     C           W#ITNB    CHAINDTR5170              90
     C           *IN90     IFEQ '0'
     C*
     C           PLACE     IFNE ' '
     C                     MOVELPLACE     GSEBA8
     C                     ELSE
     C                     MOVEL'O'       GSEBA8
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETOF                     90
     C           W#ITNB    CHAINDTR5178              90
     C           *IN90     IFEQ '0'
     C*
     C           PLACE     IFNE ' '
     C                     MOVELPLACE     GSEBA8
     C                     ELSE
     C                     MOVEL'O'       GSEBA8
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEL'O'       GSEBA8
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MOV3     BEGSR
     C                     SETOF                     96
0449 C           SHPNR3    CHAINDMR0030              96                   TR0150
     C           *IN96     IFEQ '0'
     C                     MOVELSHPNR3    WSHP11
     C                     MOVELAREASB    WYUBIN
     C*ï∂éöóÒëÄçÏÅiâÔé–ñºÅj
     C                     MOVEL*BLANK    WSHPN1
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD50        P#LENG
     C                     MOVELSHPNMB    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    WSHPN1
     C*ï∂éöóÒëÄçÏÅièZèäÇPÅj
     C                     MOVEL*BLANK    WSHIP1
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD60        P#LENG
     C                     MOVELSHIP1B    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    WSHIP1
     C*ï∂éöóÒëÄçÏÅièZèäÇQÅj
     C                     MOVEL*BLANK    WSHIP2
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD60        P#LENG
     C                     MOVELSHIP2B    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    WSHIP2
     C*
     C                     MOVEL*BLANK    WBUSYO
     C                     MOVEL*BLANK    WBIKO1
     C                     MOVEL*BLANK    WBIKO2
     C                     MOVELSHTELB    WSHTEL
     C*
     C                     Z-ADD0         WDUEDY
     C                     Z-ADD0         WSAGCD
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #PG7      BEGSR
     C                     MOVEL*BLANK    TOKSS7                          TR0150
     C                     MOVEL*BLANK    TOTAM7                          TR0150
     C                     MOVEL*BLANK    CODE17                          TR0150
     C                     MOVEL*BLANK    SHICD7                          TR0150
     C                     MOVEL*BLANK    GSAKS7                          TR0150
     C                     MOVEL*BLANK    GLCLA7                          TR0150
     C                     MOVEL*BLANK    GSCLA7                          TR0150
     C           INPN15    IFEQ 'B'
     C                     MOVELWLCLA7    GLCLA7                          TR0150
     C                     MOVELWSCLA7    GSCLA7                          TR0150
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #REP      BEGSR
     C                     MOVEL*BLANK    WCMTDS 30
     C                     SETOF                     903132
     C           ITNB17    CHAINDMR0040              90
     C           *IN90     IFEQ '0'
     C                     SELEC
     C           ZZ0178    WHEQ '*  '                      ∂∂∏∂≤√≤
     C                     SETON                     31
     C           ZZ0178    WHEQ '   '
     C                     OTHER
     C*∫“›ƒ
     C                     MOVELZZ0178    WCMTCD  1
     C                     SETOF                     91
     C           WCMTCD    CHAINDMR0390              91
     C           *IN91     IFEQ '0'
     C                     MOVELCMTDS9    WCMTDS
     C                     SETON                     32
     C                     ENDIF
     C*
     C                     ENDSL
     C*
     C                     ELSE
     C                     SETOF                     903132
     C           ITNB47    CHAINDTR5170              90
     C           *IN90     IFEQ '0'
     C*
     C*∫“›ƒ
     C                     MOVELCMTCD7    WCMTCD  1
     C                     SETOF                     91
     C           WCMTCD    CHAINDMR0390              91
     C           *IN91     IFEQ '0'
     C                     MOVELCMTDS9    WCMTDS
     C                     SETON                     32
     C                     ENDIF
     C*
     C           WCMTCD    IFEQ '*'
     C                     MOVEL*BLANK    WCMTDS
     C                     MOVELBIKOU     WCMTDS
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #YUBIN    BEGSR
     C                     MOVELGSHPNM    GSHNM1
     C                     Z-ADD0         FLAG02  10
     C           FLAG02    DOWEQ0
     C                     MOVEL*BLANK    GYUBI1
     C                     EXFMTGAMEN19
     C           *IN04     IFEQ '1'
     C                     Z-ADD1         FLAG02
     C                     ELSE
     C*
     C                     SETOF                     90
     C           GZIPCD    CHAINDMR0320              90
     C           *IN90     IFEQ '0'
     C*ï∂éöóÒëÄçÏÅièZèäÇPÅj
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD42        P#LENG
     C                     MOVELADRS1B    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    GSHP11
     C*
     C*ï∂éöóÒëÄçÏÅièZèäÇQÅj
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD42        P#LENG
     C                     MOVELADRS2B    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    GSHP12
     C*
     C           OFFICB    IFNE *BLANK
     C*ï∂éöóÒëÄçÏÅiâÔé–ñºÅj
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD42        P#LENG
     C                     MOVELOFFICB    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    GSHNM1
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVEL'-'       YUB2
     C                     MOVELGZIPCD    YUB1
     C                     MOVE GZIPCD    YUB3
     C                     MOVELYUBIN8    GYUBI1
     C*
     C                     Z-ADD0         FLAG03  10
     C           FLAG03    DOWEQ0
     C                     EXFMTGAMEN20
     C           *IN04     IFEQ '1'
     C                     Z-ADD1         FLAG03
     C                     MOVEL*BLANK    GYUBI1
     C                     MOVEL*BLANK    GSHP11
     C                     MOVEL*BLANK    GSHP12
     C                     ELSE
     C*
     C           GSHNM1    IFNE *BLANK
     C                     MOVELGSHNM1    GSHPNM
     C                     ENDIF
     C                     MOVELGYUBI1    GYUBIN
     C                     MOVELGSHP11    GSHIP1
     C                     MOVELGSHP12    GSHIP2
     C                     Z-ADD1         FLAG03
     C                     Z-ADD1         FLAG02
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
     C*-----------------------------------------------------
     C           #GA13     BEGSR
     C                     MOVELCUSNR2    P#CUSN
     C                     MOVELSHPNR3    P#SHPN
     C                     MOVELORDNO3    P#ODNO
     C                     Z-ADDJUTDY3    P#JUDY
     C                     Z-ADDSLSNR3    P#SLSN
     C                     Z-ADDINPN25    P#INPN
     C                     Z-ADDBUNYN6    P#BUYN
     C                     Z-ADDDELCD6    P#DECD
     C                     Z-ADDDELDY6    P#DEDY
     C                     Z-ADDSHCCD6    P#SHCD
     C                     MOVELITNBR7    P#ITNB
     C                     Z-ADDQUANT7    P#QUAN
     C                     MOVELCODE17    P#GCOD
     C                     MOVEL*BLANK    P#RTC3
     C                     MOVELA         P#JUNO
     C                     MOVE 0         P#JUNO
     C                     Z-ADDG         P#TANK
     C                     Z-ADDH         P#KING
     C                     MOVELITNB17    P#ITNR
     C                     MOVELWJUTK1    P#JUTK
     C                     MOVELWSHP11    P#SHP1
     C                     MOVELWSHPN1    P#SHPM
     C                     MOVELWYUBIN    P#YUBI
     C                     MOVELWSHIP1    P#SHI1
     C                     MOVELWSHIP2    P#SHI2
     C                     MOVELWBIKO1    P#BIKO
     C                     MOVELWBIKO2    P#BIK2
     C                     MOVELWBUSYO    P#BUSY
     C                     MOVELWSHTEL    P#SHTE
     C                     Z-ADDWDUEDY    P#DUDY
     C                     MOVELWTIMCD    P#TMCD
     C                     Z-ADDWSAGCD    P#SAGC
     C                     Z-ADD0         P#RJUN
     C                     Z-ADDWKTIME    P#CLOK
     C*
     C           XXX       IFEQ '0'
     C                     MOVEL'B '      P#NBNB
     C                     MOVE BCNTEP    P#NBNB
     C                     ELSE
     C                     MOVEL'E '      P#NBNB
     C                     MOVE ECNTEP    P#NBNB
     C                     ENDIF
     C*
     C                     MOVELGSEBA8    P#SHOC
     C                     MOVELGLCLA7    P#LCLA
     C                     MOVEL*BLANK    P#MCLA
     C                     MOVELGSCLA7    P#SCLA
     C                     CALL '@NA0480' PAR025
     C                     ENDSR
     C*-----------------------------------------------------
     C           #DOJ      BEGSR
     C           DOJCD3    IFEQ '*'
     C           SEQJ      IFNE 0
     C                     Z-ADDJ         P#JUN8
     C                     MOVELDOJCD3    P#DJCD
     C                     MOVELGTRACE    P#TGCD
     C                     CALL '@SS3300' PAR130
     C                     MOVEL'  '      GTRACE
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #TRS      BEGSR
     C                     MOVEL' '       GTRAC1  1
     C           GTRACE    IFNE '  '
     C                     MOVEL'*'       GTRAC1
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #TRSC     BEGSR
     C           DOJCD3    IFEQ '*'
     C                     MOVEL' '       P#EDCD
     C***                  CALL '@SS3310' PAR140
     C                     CALL '@SS3311' PAR140
     C           P#EDCD    IFEQ '1'
     C                     MOVEL*BLANK    DOJCD3
     C                     MOVEL*BLANK    P#EDCD
     C                     ELSE
     C                     ENDIF
     C                     ELSE
     C                     MOVEL'1'       P#EDCD
     C                     ENDIF
     C*
     C           P#EDCD    IFEQ '1'
     C                     SETON                     LR
     C                     GOTO END
     C                     ELSE
     C                     SETON                     01
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #DOJC     BEGSR
     C           DOJCD3    IFEQ '*'
     C                     SETON                     27
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #TEL4     BEGSR                           TELNOâ∫4åÖ
     C                     Z-ADDJUTNOV    P#JUN8
     C                     CALL '@SS4120' PAR150
     C                     ENDSR
     C*-----------------------------------------------------
2553 ONA047JFME        50                                                 TR0150
2554 O                                   K8 'GAMEN1  '                    TR0150
2555 O                         UDATE Y    8                               TR0150
2556 O                         WSID      10                               TR0150
2557 O                         TIME      18 '  .  .  '                    TR0150
2559 O                         CUNR12    21                               TR0150
2561 O                         CUNR22    23                               TR0150
2562 O                 80                26 '¥◊-'                         TR0150
2563 O        E        51                                                 TR0150
2564 O                                   K8 'GAMEN2  '                    TR0150
2565 O                         UDATE Y    8                               TR0150
2566 O                         WSID      10                               TR0150
2567 O                         TIME      18 '  .  .  '                    TR0150
2568 O                         CUSNR2    23                               TR0150
2569 O                         CUSNMG    63                               TR0150
2570 O                         SHPNRI    68                               TR0150
2571 O                 80      SHPNR3    68                               TR0150
2572 O                 81                71 '¥◊-'                         TR0150
2573 O                         SHPNMI   111                               TR0150
2574 O                 81      B40      111                               TR0150
2576 O                         ORDNO3   126                               TR0150
2577 O                         UDATE    132                               TR0150
2578 O                 80      JUTDY3   132                               TR0150
2579 O                 82               135 '¥◊-'                         TR0150
2581 O                         DOJCD3   136                               TR0150
2581 O                         SLSNR3   139                               TR0150
2582 O                 83               142 '¥◊-'                         TR0150
2582 O                         CUSID3   148                               TR0150
2583 O        E        52                                                 TR0150
2584 O                                   K8 'GAMEN3  '                    TR0150
2585 O                         UDATE Y    8                               TR0150
2586 O                         WSID      10                               TR0150
2587 O                         TIME      18 '  .  .  '                    TR0150
2588 O                         CUSNRG    23                               TR0150
2589 O                         CUSNMG    63                               TR0150
2590 O                         WSHPNR    68                               TR0150
2591 O                         WSHPNM   108                               TR0150
2592 O                         ORDNO3   123                               TR0150
2593 O                         JUTDY3Y  131                               TR0150
2594 O                         SLSNMH   151                               TR0150
2594 O                         CUSID3   157                               TR0150
2594 O                         DOJCD3   158                               TR0150
2595 O        E        53                                                 TR0150
2596 O                                   K8 'GAMEN4  '                    TR0150
2597 O                         JUSENS     8                               TR0150
2598 O                         ITDSCS    38                               TR0150
2599 O                         QUANTSL   44                               TR0150
2600 O                         TANKAS3   51                               TR0150
2601 O                         KINGASJ   63                               TR0150
2602 O                         DELCDS    64                               TR0150
2603 O                         DOJNOS    65                               TR0150
2604 O                         BUNYNS    66                               TR0150
2605 O        E        54                                                 TR0150
2606 O                                   K8 'GAMEN5  '                    TR0150
2607 O                         UDATE Y    8                               TR0150
2608 O                         WSID      10                               TR0150
2609 O                         TIME      18 '  .  .  '                    TR0150
2610 O                         B1        19                               TR0150
2611 O                 80      INPN15    19                               TR0150
2612 O                         B1        20                               TR0150
2613 O                 80      INPN25    20                               TR0150
2614 O                 81                23 '¥◊-'                         TR0150
2615 O                 82                26 '¥◊-'                         TR0150
2616 O        E        55                                                 TR0150
2617 O                                   K8 'GAMEN6  '                    TR0150
2618 O                         MSGX      16                               TR0150
2619 O                         UDATE Y   24                               TR0150
2620 O                         WSID      26                               TR0150
2621 O                         TIME      34 '  .  .  '                    TR0150
2622 O                         B11       35                               TR0150
2623 O                 80      BUNYN6    35                               TR0150
2624 O                 81                38 '¥◊-'                         TR0150
2625 O                         B1        39                               TR0150
2626 O                 80      DELCD6    39                               TR0150
26   O                 82                42 '¥◊-'                         TR0150
2628 O                         WDELDY    48                               TR0150
2629 O                 80      DELDY6    48                               TR0150
2630 O                 83                51 '¥◊-'                         TR0150
2625 O                 83      WTHOLD    66                               TR0150
2625 O                         REDY86    72                               TR0150
2625 O                         B1        73                               TR0150
2630 O                 80      SHCCD6    73                               TR0150
2631 O        E        56                                                 TR0150
2632 O                                   K8 'GAMEN7  '                    TR0150
2633 O                         MSGX      16                               TR0150
2634 O                         UDATE Y   24                               TR0150
2635 O                         WSID      26                               TR0150
2636 O                         TIME      34 '  .  .  '                    TR0150
2637 O                         BUNYN6    35                               TR0150
2638 O                         DELCD6    36                               TR0150
2639 O                         DELDY6Y   44                               TR0150
2640 O                         B30       74                               TR0150
2641 O                 80      ITNBR7    74                               TR0150
2642 O                 81                77 '¥◊-'                         TR0150
2643 O                         B5        82                               TR0150
2644 O                 80      QUANT7    82                               TR0150
2644 O                         GTRACE    84                               TR0150
2645 O                 82                87 '¥◊-'                         TR0150
     O                         TOKSS7    98
     O                         TOTAM7    99
     O                         CODE17   101
     O                         SHICD7   102
     O                         GSAKS7   103
     O                         GLCLA7   108
     O                         GSCLA7   113
2646 O        E        57                                                 TR0150
2647 O                                   K8 'GAMEN8  '                    TR0150
2648 O                         MSGX      16                               TR0150
2649 O                         UDATE Y   24                               TR0150
2650 O                         WSID      26                               TR0150
2651 O                         TIME      34 '  .  .  '                    TR0150
2652 O                         BUNYN6    35                               TR0150
2653 O                         DELCD6    36                               TR0150
2654 O                         DELDY6Y   44                               TR0150
2655 O                         ITNBR7    74                               TR0150
2656 O                         QUANT7    79                               TR0150
2657 O                         G         86                               TR0150
2658 O                         H         95                               TR0150
2659 O                         E        100                               TR0150
2660 O                         F        105                               TR0150
2661 O                         B1       106                               TR0150
2662 O                 80      INPNM8   106                               TR0150
2663 O                 81               109 '¥◊-'                         TR0150
     O                         CODE17   111                               TR0150
     O                         SHICD7   112                               TR0150
     O                         GSEBA8   113                               TR0150
     O                         AIRCD8   114                               TR0150
     O                         INPN28   115                               TR0150
     O                         GLCLA7   120                               TR0150
     O                         GSCLA7   125                               TR0150
     O                         WCMTDS   155                               TR0150
2664 O        E        58                                                 TR0150
2665 O                                   K8 'GAMEN9  '                    TR0150
2666 O                         MSGX      16                               TR0150
2667 O                         UDATE Y   24                               TR0150
2668 O                         WSID      26                               TR0150
2669 O                         TIME      34 '  .  .  '                    TR0150
2670 O                         BUNYN6    35                               TR0150
2671 O                         DELCD6    36                               TR0150
2672 O                         DELDY6Y   44                               TR0150
2673 O                         ITNBR7    74                               TR0150
2674 O                         QUANT7    79                               TR0150
2675 O                         G         86                               TR0150
2676 O                         H     1   98                               TR0150
2677 O                         E        103                               TR0150
2678 O                         F        108                               TR0150
2674 O                         CODE17   110                               TR0150
2674 O                         SHICD7   111                               TR0150
2674 O                         GSEBA8   112                               TR0150
2674 O                         INPN28   113                               TR0150
2679 O        E        59                                                 TR0150
2680 O                                   K8 'GAMEN10 '                    TR0150
2681 O                         MSGX      16                               TR0150
2682 O                         UDATE Y   24                               TR0150
2683 O                         WSID      26                               TR0150
2684 O                         TIME      34 '  .  .  '                    TR0150
2685 O                         B30       64                               TR0150
2686 O                 80      ITNBRA    64                               TR0150
2687 O                 81                67 '¥◊-'                         TR0150
2688 O                         B5        72                               TR0150
     O                         CODE1A    77
     O                         SHICDA    78
     O*                        GSEBAA    78
2689 O                 80      QUANTA    72                               TR0150
2690 O                 82                75 '¥◊-'                         TR0150
2691 O        E        60                                                 TR0150
2692 O                                   K8 'GAMEN11 '                    TR0150
2693 O                         MSGX      16                               TR0150
2694 O                         UDATE Y   24                               TR0150
2695 O                         WSID      26                               TR0150
2696 O                         TIME      34 '  .  .  '                    TR0150
2697 O                         ITNBRA    64                               TR0150
2698 O                         QUANTAM   70                               TR0150
2699 O                         G         77                               TR0150
     O                         H         86                               TR0150
     O                         CODE1A    88                               TR0150
     O                         SHICDA    89                               TR0150
     O                         NBNBRA    95                               TR0150
     O        E        61                                                 TR0150
     O                                   K8 'GAMEN12 '                    TR0150
     O                         MSGX      16                               TR0150
     O                         UDATE Y   24                               TR0150
     O                         WSID      26                               TR0150
     O                         TIME      34 '  .  .  '                    TR0150
     O                         ITNBRA    64                               TR0150
     O                         QUANTAM   70                               TR0150
     O                         G         77                               TR0150
     O                         H     J   89                               TR0150
     O                         CODE1A    91                               TR0150
     O                         SHICDA    92                               TR0150
     O                         NBNBRA    98                               TR0150
     O        E        62                                                 TR0150
     O                                   K8 'GAMEN13 '                    TR0150
     O                         MSGX      16                               TR0150
     O                         UDATE Y   24                               TR0150
     O                         WSID      26                               TR0150
     O                         TIME      34 '  .  .  '                    TR0150
     O                         AAA       40                               TR0150
     O                         ITNBR7    70                               TR0150
     O                         QUANT7    75                               TR0150
     O                         CUSNR2    80                               TR0150
     O                         ORDNO3    95                               TR0150
     O                         B1        96                               TR0150
     O                 80      SIKYNC    96                               TR0150
     O                 81                99 '¥◊-'                         TR0150
     O                         B1       100                               TR0150
     O                 80      SISACC   100                               TR0150
     O                         B6       106                               TR0150
     O                 80      DELEVC   106                               TR0150
     O                         B1       111                               TR0150
     O                 80      MITSUC   111                               TR0150
     O                 82               114 '¥◊-'                         TR0150
     O                         B1       115                               TR0150
     O                 80      ZUMENC   115                               TR0150
     O                         B1       116                               TR0150
     O                 80      SIYTEC   116                               TR0150
     O                         B1       117                               TR0150
     O                 80      TORSIC   117                               TR0150
     O                         B7       124                               TR0150
     O                 80      TORQUC   124                               TR0150
     O                         B1       125                               TR0150
     O                 80      KENSAC   125                               TR0150
     O                         B1       126                               TR0150
     O                 80      ZAISIC   126                               TR0150
     O                         B71      133                               TR0150
     O                 80      BAIKAC   133                               TR0150
     O                         B301     163                               TR0150
     O                 80      USERNC   163                               TR0150
     O                         B1       164                               TR0150
     O                 80      HOSIKC   164                               TR0150
     O                N29      B251     189                               TR0150
     O                 29      B256     189                               TR0150
     O                 80      KATA1C   189                               TR0150
     O                         B5       194                               TR0150
     O                 80      QUAN1C   194                               TR0150
     O                         B8       202                               TR0150
     O                 80      KIBA1C   202                               TR0150
     O                N29      B252     227                               TR0150
     O                 29      B257     227                               TR0150
     O                 80      KATA2C   227                               TR0150
     O                         B5       232                               TR0150
     O                 80      QUAN2C   232                               TR0150
     O                         B8       240                               TR0150
     O                 80      KIBA2C   240                               TR0150
     O                N29      B25      265                               TR0150
     O                 29      B258     265                               TR0150
     O                 80      KATA3C   265                               TR0150
     O                         B5       270                               TR0150
     O                 80      QUAN3C   270                               TR0150
     O                         B8       278                               TR0150
     O                 80      KIBA3C   278                               TR0150
     O                         B254     303                               TR0150
     O                 80      KATA4C   303                               TR0150
     O                         B5       308                               TR0150
     O                 80      QUAN4C   308                               TR0150
     O                         B8       316                               TR0150
     O                 80      KIBA4C   316                               TR0150
     O                         B255     341                               TR0150
     O                 80      KATA5C   341                               TR0150
     O                         B5       346                               TR0150
     O                 80      QUAN5C   346                               TR0150
     O                         B8       354                               TR0150
     O                 80      KIBA5C   354                               TR0150
     O                         B72      363                               TR0150
     O                 80      STPRIC   363                               TR0150
     O                         GBUKUM   364                               TR0150
     O                         GUNDED   365                               TR0150
     O        E        63                                                 TR0150
     O                                   K8 'GAMEN14 '                    TR0150
     O                         UDATE Y    8                               TR0150
     O                         WSID      10                               TR0150
     O                         TIME      18 '  .  .  '                    TR0150
     O                         AAA       24                               TR0150
     O                         ITNBR7    54                               TR0150
     O                         QUANT7    59                               TR0150
     O                         CUSNR2    64                               TR0150
     O                         ORDNO3    79                               TR0150
     O                         B25      104                               TR0150
     O                 80      ITNBRD   104                               TR0150
     O                         B5       109                               TR0150
     O                 80      QUANTD   109                               TR0150
     O                 81               112 '¥◊-'                         TR0150
     O                 82               115 '¥◊-'                         TR0150
     O                 83               128 '√ﬁ-¿ 10≤ºﬁÆ≥'                TR0150
     O        E        64                                                 TR0150
     O                                   K8 'GAMEN15 '                    TR0150
     O                         ITDSCT    25                               TR0150
     O                         QUANTT    30                               TR0150
2803 O                         QTYRST    35                               TR0150
2804 O                         QTYOBT    40                               TR0150
2805 O        E        65                                                 TR0150
2806 O                                   K8 'GAMEN16 '                    TR0150
2807 O                         UDATE Y    8                               TR0150
2808 O                         WSID      10                               TR0150
2809 O                         TIME      18 '  .  .  '                    TR0150
2810 O                         B1        19                               TR0150
2811 O                 80      KETYNE    19                               TR0150
2812 O                 81                22 '¥◊-'                         TR0150
2813 O        E        66                                                 TR0150
2814 O                                   K8 'GAMEN17 '                    TR0150
2815 O                         UDATE Y    8                               TR0150
2816 O                         WSID      10                               TR0150
2817 O                         TIME      18 '  .  .  '                    TR0150
2818 O                         CUSNR2    23                               TR0150
2819 O                         CUSNMG    63                               TR0150
2820 O                         SHPNRI    68                               TR0150
2821 O                         SHPNMI   108                               TR0150
2822 O                         ORDNO3   123                               TR0150
2823 O                         JUTDY3Y  131                               TR0150
2824 O                         SLSNMH   151                               TR0150
2825 O                         B8       159                               TR0150
2826 O                 80      INPN1F   159                               TR0150
     O                         B8       167                               TR0150
2828 O                 80      INPN2F   167                               TR0150
2829 O                         B8       175                               TR0150
2830 O                 80      INPN3F   175                               TR0150
2831 O                         B8       183                               TR0150
2832 O                 80      INPN4F   183                               TR0150
2833 O                         B8       191                               TR0150
2834 O                 80      INPN5F   191                               TR0150
2835 O                         B8       199                               TR0150
2836 O                 80      INPN6F   199                               TR0150
2837 O                 80               202 '¥◊-'                         TR0150
2838 ODTR0060 E        49                                                 TR0150
2839 O                         BBB        8                               TR0150
2840 O                         CCC       12                               TR0150
2841 ODTR0040 EADD     73                                                 TR0150
2842 O                                    2 'ZM'                          TR0150
2843 O                         J         11                               TR0150
2844 O                         L         25                               TR0150
2845 O                         A1        26                               TR0150
2846 O                         A2        27                               TR0150
2847 O                         A3        28                               TR0150
2848 O                         A4        29                               TR0150
2849 O                         A5        30                               TR0150
2850 O                         A6        31                               TR0150
2851 O                         QUANT7    34P                              TR0150
2852 O                         E         37P                              TR0150
2853 O                         F         40P                              TR0150
2854 O                         DELCD6    41                               TR0150
2855 O                         BUNYN6    43                               TR0150
2855 O                         SURY99    60                               TR0150
     O                         WCRTD2   104                               TR0150
     O                         WCRTT2   110                               TR0150
     O                         WUSID2   114                               TR0150
     O                         WJBID2   118                               TR0150
     O                         WPGID2   128                               TR0150
     O                         SAKB1    134                               TR0150
     O                         SAKB1    140                               TR0150
     O                         SAKB1    146                               TR0150
     O                         SAKB1    152                               TR0150
     O                         SAKB1    158
     O                         SAKB1    152                               TR0150
     O                         SURY1    165
     O                         SURY1    172
     O                         SURY1    179
     O                         SURY1    186
     O                         SURY1    193
2856 ODTR0030 E        79                                                 TR0150
2857 O                         C         10                               TR0150
2858 ODTR0010 E        78                                                 TR0150
2859 O                                    2 'IZ'                          TR0150
2860 O        E        74                                                 TR0150
2861 O                         M         25P                              TR0150
2862 O                         N         29P                              TR0150
2863 O                         N1        33P                              TR0150
2864 O                         N2        41P                              TR0150
2865 O                         O         45P                              TR0150
2866 O                         P         49P                              TR0150
2867 O                         P1        53P                              TR0150
2868 O                         P2        57P                              TR0150
2869 O                         Q         61P                              TR0150
2870 ODTR0070 EADD     69                                                 TR0150
2871 O                                    2 'SM'                          TR0150
2872 O                         DDD       11                               TR0150
2873 O                         ITNBRD    36                               TR0150
2874 O                         ITCODJ    55                               TR0150
2875 O                         QUANTD    58P                              TR0150
2876 O                         E         61P                              TR0150
2877 O                         F         64P                              TR0150
2878 O                         A1        65                               TR0150
2879 O                         A2        66                               TR0150
2880 O                         A3        67                               TR0150
2881 O                         A4        68                               TR0150
2882 O                         A5        69                               TR0150
2883 O                         A6        70                               TR0150
     O                         Z2       131                               TR0150
     O                         Z3       134P                              TR0150
     O                         QUANTD   137P                              TR0150
     O                         WCRTD2   145                               TR0150
     O                         WCRTT2   151                               TR0150
     O                         WUSID2   155                               TR0150
     O                         WJBID2   159                               TR0150
     O                         WPGID2   169                               TR0150
     O                         SAKB1    175                               TR0150
     O                         SAKB1    181                               TR0150
     O                         SAKB1    187                               TR0150
     O                         SAKB1    193                               TR0150
     O                         SURY1    200
     O                         SURY1    207
     O                         SURY1    214
     O                         SURY1    221
4985 ODTR0050 EADD     71                                                 TR0150
2885 O                                    2 'SF'                          TR0150
2886 O                         AAA        9                               TR0150
2887 O                         ITNBR7    39                               TR0150
2888 O                         QUANT7    42P                              TR0150
2889 O                         G         46P                              TR0150
2890 O                         H         51P                              TR0150
2891 O                         J         59                               TR0150
2892 O                         CUSNR2    64                               TR0150
2893 O                         SIKYNC    65                               TR0150
2894 O                         A1        66                               TR0150
2895 O                         A2        67                               TR0150
2896 O                         A3        68                               TR0150
2897 O                         A4        69                               TR0150
2898 O                         A5        70                               TR0150
2899 O                         A6        71                               TR0150
2900 O                         Z11       73                               TR0150
2901 O                         SISACC    74                               TR0150
2902 O                         DELEVC    80                               TR0150
2903 O                         MITSUC    85                               TR0150
2904 O                         ZUMENC    86                               TR0150
2905 O                         SIYTEC    87                               TR0150
2906 O                         TORSIC    88                               TR0150
2907 O                         TORQUC    95                               TR0150
2908 O                         KENSAC    96                               TR0150
2909 O                         ZAISIC    97                               TR0150
2910 O                         HOSIKC    98                               TR0150
2911 O                         KATA1C   123                               TR0150
2912 O                         QUAN1C   126P                              TR0150
2913 O                         KIBA1C   134                               TR0150
2914 O                         KATA2C   159                               TR0150
2915 O                         QUAN2C   162P                              TR0150
2916 O                         KIBA2C   170                               TR0150
2917 O                         KATA3C   195                               TR0150
2918 O                         QUAN3C   198P                              TR0150
2919 O                         KIBA3C   206                               TR0150
2920 O                         KATA4C   231                               TR0150
2921 O                         QUAN4C   234P                              TR0150
2922 O                         KIBA4C   242                               TR0150
2923 O                         KATA5C   267                               TR0150
2924 O                         QUAN5C   270P                              TR0150
2925 O                         KIBA5C   278                               TR0150
2926 O                         BAIKAC   282P                              TR0150
     O                         USERNC   312                               TR0150
     O                         WKSEHA   320                               TR0150
     O                         WKNSEQ   322                               TR0150
     O                         WKOUTQ   327                               TR0150
     O                         WKOWQU   332                               TR0150
     O                         WKFIQU   337                               TR0150
     O                         WKFNAI   338                               TR0150
     O                         WKBUNN   340                               TR0150
     O                         WKFIDA   346                               TR0150
     O                         WMADEL   361                               TR0150
2928 O                         STPRIC   370                               TR0150
2928 O                         WDELEV   392                               TR0150
2928 O                         WSEHAD   400                               TR0150
2928 O                         WFIDAY   408                               TR0150
2928 O                         GUNDED   469                               TR0150
2929 O        E        68                                                 TR0150
2930 O                         EEE       73                               TR0150
2931 O        E        17                                                 TR0150
2932 O                         J         59                               TR0150
2933 ODTR0020 EADD     77                                                 TR0150
2934 O                                    2 'JF'                          TR0150
2935 O                         J         11                               TR0150
2936 O                         CUSNR2    16                               TR0150
2937 O                         SHPNR3    21                               TR0150
2938 O                         SLSNRH    24                               TR0150
2939 O                         ORDNO3    39                               TR0150
2940 O                         JUTDY3    45                               TR0150
2962 O                         WDELDY    52                               TR0150
2941 O                         Z21       54                               TR0150
2964 O                         A1        55                               TR0150
2965 O                         A2        56                               TR0150
2966 O                         A3        57                               TR0150
2967 O                         A4        58                               TR0150
2968 O                         A5        59                               TR0150
2969 O                         A6        60                               TR0150
2942 O                         Z5        63P                              TR0150
2943 O                         Z7        67P                              TR0150
2944 O                         Z9        72P                              TR0150
2945 O                         B30      102                               TR0150
2946 O                         Z14      116                               TR0150
2947 O                         Z5       123                               TR0150
2948 O                         Z8       137                               TR0150
2949 O                         Z5       141P                              TR0150
2950 O                         Z5       144P                              TR0150
2951 O                         Z2       146                               TR0150
2951 O                         ZZ9      164                               TR0150
2951 O                         ZZ5      170                               TR0150
2951 O                         GTRAC1   175                               TR0150
2951 O                         ZZ6      186                               TR0150
2952 O                         UDATE    192                               TR0150
3011 O                         WYJUT    200                               TR0150
3011 O                         WYDEL    208                               TR0150
3011 O                         Z1       216                               TR0150
3011 O                         WREDY8   224                               TR0150
3011 O                         WCODE7   226                               TR0150
3011 O                         CUSID3   232                               TR0150
3011 O                         WSHICD   233                               TR0150
     O                         WCRTD2   241                               TR0150
     O                         WCRTT2   247                               TR0150
     O                         WUSID2   251                               TR0150
     O                         WJBID2   255                               TR0150
     O                         WPGID2   265                               TR0150
     O                         WLCLA7   270                               TR0150
     O                         WMCLA7   275                               TR0150
     O                         WSCLA7   280                               TR0150
2953 O        EADD     75                                                 TR0150
2954 O                                    2 'JF'                          TR0150
2955 O                         J         11                               TR0150
2956 O                         CUSNR2    16                               TR0150
2957 O                         SHPNR3    21                               TR0150
2958 O                         SLSNRH    24                               TR0150
2959 O                         ORDNO3    39                               TR0150
2960 O                         JUTDY3    45                               TR0150
2961 O                         DELCD6    46                               TR0150
2962 O                         DELDY6    52                               TR0150
2963 O                         Z2        54                               TR0150
2964 O                         A1        55                               TR0150
2965 O                         A2        56                               TR0150
2966 O                         A3        57                               TR0150
2967 O                         A4        58                               TR0150
2968 O                         A5        59                               TR0150
2969 O                         A6        60                               TR0150
2970 O                         QUANT7    63P                              TR0150
2971 O                         G         67P                              TR0150
2972 O                         H         72P                              TR0150
2973 O                         ITNBR7   102                               TR0150
2974 O                         L        116                               TR0150
2975 O                         BUNYN6   118                               TR0150
2976 O                         Z5       123                               TR0150
2977 O                         AAA      129                               TR0150
2978 O                         Z8       137                               TR0150
2979 O                         Z5       141P                              TR0150
2980 O                         Z5       144P                              TR0150
2981 O                         Z2       146                               TR0150
2951 O                         ZZ9      164                               TR0150
2951 O                         ZZ5      170                               TR0150
2951 O                         GTRAC1   175                               TR0150
2951 O                         ZZ6      186                               TR0150
2982 O                         UDATE    192                               TR0150
3011 O                         WYJUT    200                               TR0150
3011 O                         WYDEL    208                               TR0150
3011 O                         Z1       216                               TR0150
3011 O                         WREDY8   224                               TR0150
3011 O                         WCODE7   226                               TR0150
3011 O                         CUSID3   232                               TR0150
3011 O                         WSHICD   233                               TR0150
     O                         WCRTD2   241                               TR0150
     O                         WCRTT2   247                               TR0150
     O                         WUSID2   251                               TR0150
     O                         WJBID2   255                               TR0150
     O                         WPGID2   265                               TR0150
     O                         GLCLA7   270                               TR0150
     O                         WMCLA7   275                               TR0150
     O                         GSCLA7   280                               TR0150
2983 O        EADD     98                                                 TR0150
2984 O                                    2 'JF'                          TR0150
2985 O                         J         11                               TR0150
2986 O                         CUSNR2    16                               TR0150
2987 O                         SHPNR3    21                               TR0150
2988 O                         SLSNRH    24                               TR0150
2989 O                         ORDNO3    39                               TR0150
2990 O                         JUTDY3    45                               TR0150
2991 O                         Z1        46                               TR0150
2992 O                         WDELDY    52                               TR0150
2993 O                         Z2        54                               TR0150
2994 O                         A1        55                               TR0150
2995 O                         A2        56                               TR0150
2996 O                         A3        57                               TR0150
2997 O                         A4        58                               TR0150
2998 O                         A5        59                               TR0150
2999 O                         A6        60                               TR0150
3000 O                         QUANTA    63P                              TR0150
3001 O                         G         67P                              TR0150
3002 O                         H         72P                              TR0150
3003 O                         ITNBRA   102                               TR0150
3004 O                         L        116                               TR0150
3005 O                         Z1       118                               TR0150
3006 O                         Z5       123                               TR0150
2947 O                         NBNBRA   129                               TR0150
3007 O                         Z8       137                               TR0150
3008 O                         Z5       141P                              TR0150
3009 O                         Z5       144P                              TR0150
3010 O                         Z2       146                               TR0150
2951 O                         GTRAC1   175                               TR0150
3011 O                         UDATE    192                               TR0150
3011 O                         WYJUT    200                               TR0150
3011 O                         WYDEL    208                               TR0150
3011 O                         Z1       216                               TR0150
3011 O                         WREDY8   224                               TR0150
3011 O                         WCODE7   226                               TR0150
3011 O                         CUSID3   232                               TR0150
3011 O                         WSHICD   233                               TR0150
     O                         WCRTD2   241                               TR0150
     O                         WCRTT2   247                               TR0150
     O                         WUSID2   251                               TR0150
     O                         WJBID2   255                               TR0150
     O                         WPGID2   265                               TR0150
     O                         GLCLA7   270                               TR0150
     O                         WMCLA7   275                               TR0150
     O                         GSCLA7   280                               TR0150
3012 O        E        76                                                 TR0150
3013 O                         K         54                               TR0150
     O                         WCRTD2   241                               TR0150
     O                         WCRTT2   247                               TR0150
     O                         WUSID2   251                               TR0150
     O                         WJBID2   255                               TR0150
     O                         WPGID2   265                               TR0150
3014 O        E        67                                                 TR0150
3015 O                                    2 'JF'                          TR0150
     O                         WCRTD2   241                               TR0150
     O                         WCRTT2   247                               TR0150
     O                         WUSID2   251                               TR0150
     O                         WJBID2   255                               TR0150
     O                         WPGID2   265                               TR0150
3016 O        E        70                                                 TR0150
3017 O                                  117 '*'                           TR0150
     O                         WCRTD2   241                               TR0150
     O                         WCRTT2   247                               TR0150
     O                         WUSID2   251                               TR0150
     O                         WJBID2   255                               TR0150
     O                         WPGID2   265                               TR0150
3018 OQSYSPRT H  303   OF                                                 TR0150
3019 O                                   15 'TOHNICHI S.S'                TR0150
3020 O                                   48 '****   ºﬁ’¡’- √ﬁ-¿ CHECK'    TR0150
3021 O                                   62 'LIST   ****'                 TR0150
3022 O                         UDATE Y   93                               TR0150
3023 O                         TIME     105 '  .  .  '                    TR0150
3024 O                                  115 'TR0150'                      TR0150
3025 O                                  123 'P.'                          TR0150
3026 O                         PAGE  3  127                               TR0150
     O        H        OF                                                 TR0150
3028 O                                   19 '*A* ºﬁ’¡’-NO CUSNR'          TR0150
3029 O                                   33 'SHPNR ¡’-”›NO'               TR0150
3030 O                                   56 'SLS À  ›  “  ≤'              TR0150
3031 O                                   89 'Ω≥ÿ÷≥  ¿ › ∂'                TR0150
3032 O                                   99 '∑ › ∂ﬁ∏'                     TR0150
3033 O                                  116 'BYN NYN …≥∑'                 TR0150
     O                                  144 'ƒŸ∏æØ√≤'                     TR0150
     O                                  152 'ƒŸ∏¿›≤'                      TR0150
     O                                  157 'ƒ⁄ª'                         TR0150
3034 O        H        OF                                                 TR0150
3035 O                                   18 '*B*   º∫–º÷≥ º›ª≤'           TR0150
3036 O                                   33 '… ≥ ∑     –¬”ÿ'              TR0150
3037 O                                   55 'Ωﬁ“› º÷≥ ¿›≤º√≤ ¿›≤'         TR0150
3038 O                                   72 'π›ª  ªﬁ≤∫   ﬁ≤∂'             TR0150
3039 O                                   87 '’-ªﬁ-“≤'                     TR0150
3040 O                                  118 'Œ›¿≤º∑’-'                    TR0150
3041 O                                  132 'ª ∏  ﬁ ›'                    TR0150
3042 O        H        OF                                                 TR0150
3043 O                                    4 '*B*'                         TR0150
3044 O                                   27 '∂ ¿ º ∑'                     TR0150
3045 O                                   63 'Ω≥ÿ÷≥  ∑  ﬁ›'                TR0150
3046 O                                   80 '∂ ¿ º ∑'                     TR0150
3047 O                                  115 'Ω≥ÿ÷≥ ∑  ﬁ›'                 TR0150
3048 O        H        OF                                                 TR0150
3049 O                                    4 '*C*'                         TR0150
3050 O                                   27 'À › “ ≤'                     TR0150
3051 O                                   72 'Ω≥ÿ÷≥       À∑±√'            TR0150
3052 O                                   80 '–…≥'                         TR0150
3053 O        H        OF                                                 TR0150
3054 O                                    4 '*D*'                         TR0150
3055 O                                   33 'ƒﬁ≥ºﬁºﬁ’¡’-NO'               TR0150
3056 O        EF11     93                                                 TR0150
3057 O                                    2 'A'                           TR0150
3057 O                         GTRAC1     4                               TR0150
3058 O                         J         13                               TR0150
3059 O                         CUSNR2    19                               TR0150
3060 O                         SHPNR3    25                               TR0150
3061 O                         ORDNO3    41                               TR0150
3062 O                         SLSNRH    45                               TR0150
3063 O                         ITNBR7    76                               TR0150
3064 O                         QUANT7M   83                               TR0150
3065 O                         G     M   91                               TR0150
3066 O                         H     J  104                               TR0150
3067 O                         BUNYN6   107                               TR0150
3068 O                         DELCD6   111                               TR0150
3069 O                         DELDY6Y  121                               TR0150
3070 O                         A1       124                               TR0150
3071 O                         A2       125                               TR0150
3072 O                         A3       126                               TR0150
3073 O                         A4       127                               TR0150
3074 O                         A5       128                               TR0150
3075 O                         A6       129                               TR0150
     O                         WTOKSS   144                               TR0150
     O                         WTOTAM   147                               TR0150
     O                         WTOTAN   154                               TR0150
     O                         W1NB11   161                               TR0150
     O                         W1DE114  168                               TR0150
     O                         W1NB21   175                               TR0150
     O                         W1DE214  182                               TR0150
     O                         W1NB31   189                               TR0150
     O                         W1DE314  196                               TR0150
3076 O        EF11     92                                                 TR0150
3077 O                                    2 'A'                           TR0150
3077 O                         GTRAC1     4                               TR0150
3078 O                         J         13                               TR0150
3079 O                         CUSNR2    19                               TR0150
3080 O                         SHPNR3    25                               TR0150
3081 O                         ORDNO3    41                               TR0150
3082 O                         SLSNRH    45                               TR0150
3083 O                         ITNBRA    76                               TR0150
3084 O                         QUANTAM   83                               TR0150
3085 O                         G     M   91                               TR0150
3086 O                         H     J  104                               TR0150
3087 O                         Z1       107                               TR0150
3088 O                         Z1       111                               TR0150
3089 O                         Z6    Y  121                               TR0150
3090 O                         A1       124                               TR0150
3091 O                         A2       125                               TR0150
3092 O                         A3       126                               TR0150
3093 O                         A4       127                               TR0150
3094 O                         A5       128                               TR0150
3095 O                         A6       129                               TR0150
     O                         WTOKSS   144                               TR0150
     O                         WTOTAM   147                               TR0150
     O                         WTOTAN   154                               TR0150
     O                         W1NB11   161                               TR0150
     O                         W1DE114  168                               TR0150
     O                         W1NB21   175                               TR0150
     O                         W1DE214  182                               TR0150
     O                         W1NB31   189                               TR0150
     O                         W1DE314  196                               TR0150
3056 O        EF11     94                                                 TR0150
3057 O                                    2 'A'                           TR0150
3057 O                         GTRAC1     4                               TR0150
3058 O                         PJUTNO    13                               TR0150
3059 O                         P#CUSN    19                               TR0150
3060 O                         P#SHPN    25                               TR0150
3061 O                         P#ODNO    41                               TR0150
3062 O                         P#SLSN    45                               TR0150
3063 O                         P#ITNB    76                               TR0150
3064 O                         P#QUANM   83                               TR0150
3065 O                         P#TANKM   91                               TR0150
3066 O                         P#KINGJ  104                               TR0150
3067 O                         P#BUYN   107                               TR0150
3068 O                         P#DECD   111                               TR0150
3069 O                         P#DEDYY  121                               TR0150
3075 O                         P#JUTK   129                               TR0150
     O                         WTOKSS   144                               TR0150
     O                         WTOTAM   147                               TR0150
     O                         WTOTAN   154                               TR0150
     O                         W1NB11   161                               TR0150
     O                         W1DE114  168                               TR0150
     O                         W1NB21   175                               TR0150
     O                         W1DE214  182                               TR0150
     O                         W1NB31   189                               TR0150
     O                         W1DE314  196                               TR0150
3096 O        EF11     72                                                 TR0150
3097 O                                    6 'C'                           TR0150
3098 O                         ITNBRD    50                               TR0150
3099 O                         QUANTD4   61                               TR0150
3100 O                         E     M   73                               TR0150
3101 O                         F     M   82                               TR0150
     O                         W2NB11   161                               TR0150
     O                         W2DE114  168                               TR0150
     O                         W2NB21   175                               TR0150
     O                         W2DE214  182                               TR0150
     O                         W2NB31   189                               TR0150
     O                         W2DE314  196                               TR0150
3102 O*       EF11     91                                                 TR0150
3103 O*                                   6 'D'                           TR0150
3104 O*                        B         28                               TR0150
3105 O        EF11     48                                                 TR0150
3106 O                                    6 'B'                           TR0150
3106 O                         GTRAC1     8                               TR0150
3107 O                         SIKYNC    12                               TR0150
3108 O                         SISACC    16                               TR0150
3109 O                         DELEVCY   27                               TR0150
3110 O                         MITSUC    34                               TR0150
3111 O                         ZUMENC    38                               TR0150
3112 O                         SIYTEC    42                               TR0150
3113 O                         TORSIC    46                               TR0150
3114 O                         TORQUC    56                               TR0150
3115 O                         KENSAC    60                               TR0150
3116 O                         ZAISIC    65                               TR0150
3117 O                         BAIKACJ   76                               TR0150
3118 O                         USERNC   110                               TR0150
3119 O                         HOSIKC   115                               TR0150
3120 O                         AAA      132                               TR0150
3121 O        EF11     47                                                 TR0150
3122 O                                   19 '-1-'                         TR0150
3123 O                         KATA1C    50                               TR0150
3124 O                         QUAN1C    56                               TR0150
3125 O                         KIBA1C    66                               TR0150
3126 O                                   72 '-2-'                         TR0150
     O                         KATA2C   103                               TR0150
3128 O                         QUAN2C   109                               TR0150
3129 O                         KIBA2C   118                               TR0150
3130 O        EF11     46                                                 TR0150
3131 O                                   19 '-3-'                         TR0150
3132 O                         KATA3C    50                               TR0150
3133 O                         QUAN3C    56                               TR0150
3134 O                         KIBA3C    66                               TR0150
3135 O                                   72 '-4-'                         TR0150
3136 O                         KATA4C   103                               TR0150
3137 O                         QUAN4C   109                               TR0150
3138 O                         KIBA4C   118                               TR0150
3139 O        EF11     41                                                 TR0150
3140 O                                   19 '-5-'                         TR0150
3141 O                         KATA5C    50                               TR0150
3142 O                         QUAN5C    56                               TR0150
3143 O                         KIBA5C    66                               TR0150
** TBL01< ∫œ›ƒﬁ∂ﬁ≤¿ﬁ›Ω >
1Ã∏€    ∫≤ÿ§    Ã∏€√ ≤
¥≤∑ﬁÆ≥Àﬁ≤∂ﬁ≤√ﬁΩ
