     H*****************************************************
     H*    PROGRAM NAME AM0080R CODED BY N.KANEDA         *
     H*                         CODED ON 21.03.12         *
     H*    各代理店受注入力　標準品ｴﾗｰﾅｼ                *
     H*****************************************************
     H            Y                                     1
     F*<締切時刻>
     FDTR9900 IF  E           K        DISK                               TR0150
     FDMR0010 IF  E           K        DISK
     FDMR0030 IF  E           K        DISK
     FDMR0040 IF  E           K        DISK
     FDTR0010 UF  E           K        DISK
     FDTR0020 UF  E           K        DISK                      A
     FDTR0030 UF  E           K        DISK
     FDTR0040 IF  E           K        DISK                      A
     FDTR0120 UF  E           K        DISK                      A
     FDTR2060XIF  E           K        DISK
     F            RDTR2060X                         KRENAMERDTR2060
     FDTR5170 IF  E           K        DISK
     FDTR5200 UF  E           K        DISK
     FDTR5230 IF  E           K        DISK                      A
     F*ML0010 IF  E           K        DISK
     FAML0041 UF  E           K        DISK
     F            RAML0040                          KRENAMERAML0041
     FAML0043 UF  E           K        DISK
     F            RAML0040                          KRENAMERAML0043
     FAML0040 IF  E           K        DISK
     FDTR0050 IF  E           K        DISK                      A
     FDTR0060 UF  E           K        DISK
     FNPR0100 IF  E           K        DISK
     F*<佐川営業所止め>
     FDMR0330 IF  E           K        DISK
     F*<トルクセット値>
     FDKK0380 UF  E           K        DISK                      A
     FDTP1110 IF  E           K        DISK
     FDTP1111 IF  E           K        DISK
     F            RDTP1110                          KRENAMERDTP1111
     FAGM0060 IF  E           K        DISK
     F*<その他品目>
     FDMR0340 IF  E           K        DISK
     F*<同時納入>
     FDTR0540 IF  E           K        DISK                      A
     FDTR0542 IF  E           K        DISK
     F            RDTR0540                          KRENAMERDTR0542
     FNPD1910 UF  E           K        DISK
     F*<明細件数>
     FAML0120 IF  E           K        DISK
     FAML0101 IF  E           K        DISK
     F            RAML0100                          KRENAMERAML0101
     FAML0100 IF  E           K        DISK
     FQSYSPRT O   F     198     OF    LPRINTER
     LQSYSPRT  40FL 40OL
     E                    WK1        30  1
     E                    WK2        30  1
     E                    WK3        11  1
     E                    WK4        11  1
     E*
     E                    WT1         7  1
     E                    WT2         7  1
     E                    WT3         7  1
     E                    WT4         7  1
     E*------------------------------------------------------------
     E                    TBL01   1  30 50
     E*------------------------------------------------------------
     IRDMR0010
     I              ZZ0001                          ZZ001E
     I              ACREC                           ACRECE
     I              CUSNR                           CUSNRE
     I              CUSNM                           CUSNME
     I              SHPNR                           SHPNRE
     I              AREAD                           AREADE
     I              CUSA1                           CUSA1E
     I              CUSA2                           CUSA2E
     I              AREAC                           AREACE
     I              PHONE                           PHONEE
     I              SLNR1                           SLNR1E
     I              SLBR1                           SLBR1E
     I              SLNR2                           SLNR2E
     I              SLBR2                           SLBR2E
     I              SLNR3                           SLNR3E
     I              SLBR3                           SLBR3E
     I              CRLAM                           CRLAME
     I              DCODE                           DCODEE
     I              CLSCD                           CLSCDE
     I              SIHCD                           SIHCDE
     I              TESIT                           TESITE
     I              SMTCD                           SMTCDE
     I              KEITS                           KEITSE
     I              TATEA                           TATEAE
     I              TATES                           TATESE
     I              SIMUA                           SIMUAE
     I              SIMUS                           SIMUSE
     I              KESAI                           KESAIE
     I              USDAY                           USDAYE
     I              USANS                           USANSE
     I              OTSUA                           OTSUAE
     I              OTSUS                           OTSUSE
     I              TELEX                           TELEXE
     I              BANNM                           BANNME
     I              BAAR1                           BAAR1E
     I              BAAR2                           BAAR2E
     I              BAYCD                           BAYCDE
     I              OPPNO                           OPPNOE
     I              INSNM                           INSNME
     I              INAR1                           INAR1E
     I              INAR2                           INAR2E
     I              NOTPT                           NOTPTE
     I              NOAR1                           NOAR1E
     I              NOAR2                           NOAR2E
     I              INTER                           INTERE
     I              ZZ0671                          ZZ671E
     I              MATIM                           MATIME
     I              MADAY                           MADAYE
     I              SHPNMB                          SHPNBE
     I              SHIP1B                          SHI1BE
     I              SHIP2B                          SHI2BE
     I              AREASB                          AREABE
     I              EWECD                           EWECDE
     I              UPDID                           UPDIDE
     I              UPDDD                           UPDDDE
     I              UPDTD                           UPDTDE
     I              CRTD1                           CRTD1E
     I              CRTT1                           CRTT1E
     I              USID1                           USID1E
     I              JBID1                           JBID1E
     I              PGID1                           PGID1E
     IRDMR0030
     I              ZZ0001                          ZZ001H
     I              ACREC                           ACRECH
     I              SHPNR                           SHPNRH
     I              SHPNM                           SHPNMH
     I              SHIP1                           SHIP1H
     I              SHIP2                           SHIP2H
     I              AREAS                           AREASH
     I              ZZ0134                          ZZ134H
     I              MATIM                           MATIMH
     I              MADAY                           MADAYH
     I              SHPNMB                          SHPNBH
     I              SHIP1B                          SHP1BH
     I              SHIP2B                          SHP2BH
     I              AREASB                          AREABH
     I              SHTELB                          SHTEBH
     IRDMR0040
     I              ZZ0001                          ZZ001K
     I              ACREC                           ACRECK
     I              ITNBR                           ITNBRK
     I              ITDSC                           ITDSCK
     I              ITCOD                           ITCODK
     I              LSTPC                           LSTPCK
     I              UPD01                           UPD01K
     I              UPD02                           UPD02K
     I              UPD03                           UPD03K
     I              UPD04                           UPD04K
     I              UPD05                           UPD05K
     I              UPD06                           UPD06K
     I              UPD07                           UPD07K
     I              UPD08                           UPD08K
     I              UPD09                           UPD09K
     I              UPD10                           UPD10K
     I              LENGT                           LENGTK
     I              LENGH                           LENGHK
     I              WEIGH                           WEIGHK
     I              SIKOM                           SIKOMK
     I              PRIBL                           PRIBLK
     I              LPOST                           LPOSTK
     I              UPD11                           UPD11K
     I              UPD12                           UPD12K
     I              UPD13                           UPD13K
     I              UPD14                           UPD14K
     I              UPD15                           UPD15K
     I              UPD16                           UPD16K
     I              UPD17                           UPD17K
     I              ZZ0178                          ZZ178K
     I              MATIM                           MATIMK
     I              MADAY                           MADAYK
     I              GENCD                           GENCDK
     I              CRTD10                          CRTD1K
     I              CRTT10                          CRTT1K
     I              USID10                          USID1K
     I              JBID10                          JBID1K
     I              PGID10                          PGID1K
     I              ELECD                           ELECDK
     I              REJET                           REJETK
     IRDTR0010
     I              ZZ0001                          ZZ001T
     I              ACREC                           ACRECT
     I              A1                              A1T
     I              A2                              A2T
     I              A3                              A3T
     I              A4                              A4T
     I              A5                              A5T
     I              A6                              A6T
     I              A7                              A7T
     I              A8                              A8T
     I              A9                              A9T
     I              A10                             A10T
     I              A11                             A11T
     I              A12                             A12T
     I              A13                             A13T
     I              A14                             A14T
     I              QTYOO                           QTYOOT
     I              QTYOH                           QTYOHT
     I              QTYRS                           QTYRST
     I              QTYRD                           QTYRDT
     I              QTYRR                           QTYRRT
     I              QTYRM                           QTYRMT
     I              QTYRT                           QTYRTT
     I              QTYOB                           QTYOBT
     I              QTYOR                           QTYORT
     I              QTYOM                           QTYOMT
     I              QTYOT                           QTYOTT
     I              QTSOS                           QTSOST
     I              NOSTK                           NOSTKT
     I              YOSTK                           YOSTKT
     I              HIKIW                           HIKIWT
     I              MINOW                           MONOWT
     I              ZZ0082                          ZZ082T
     I              ITNBR                           ITNBRT
     IRDTR0040
     I              ZZ0001                          ZZ0014
     I              ACREC                           ACREC4
     I              JUTNO                           JUTNO4
     I              SEQNO                           SEQNO4
     I              ITCOD                           ITCOD4
     I              JUTKC                           JUTKC4
     I              QUANT1                          QUANT4
     I              QTYRS                           QTYRS4
     I              QTYOB                           QTYOB4
     I              DELCD                           DELCD4
     I              DOJNO                           DOJNO4
     I              BUNYN                           BUNYN4
     I              HIKNB                           HIKNB4
     IRDTR2060
     I              ZZ0001                          ZZ001S
     I              ACREC                           ACRECS
     I              ITNBR                           ITNBRS
     IRDTR5170
     I              ZZ0001                          ZZ001B
     I              ACREC                           ACRECB
     I              ITCOD                           ITCODB
     I              ITDSE                           ITDSEB
     I              ITDSJ                           ITDSJB
     I              KYUCD                           KYUCDB
     I              DESNO                           DESNOB
     I              UNPCS                           UNPCSB
     I              PACOD                           PACODB
     I              UNPRI                           UNPRIB
     I              SMOLA                           SMOLAB
     I              STACO                           STACOB
     I              LANKU                           LANKUB
     I              BIKOU                           BIKOUB
     I              IMAXQ                           IMAXQB
     I              OPQU1                           OPQU2B
     I              OPQU2                           OPQU2B
     I              M0MIN                           M0MINB
     I              PLNUM                           PLNUMB
     I              PLACE                           PLACEB
     I              ZZ0165                          ZZ165B
     IRDTR5200
     I              ZZ0001                          ZZ001Q
     I              ACREC                           ACRECQ
     I              ITCOD                           ITCODQ
     I              QTYOO                           QTYOOQ
     I              QTYOH                           QTYOHQ
     I              QTYRS                           QTYRSQ
     I              QTYRD                           QTYRDQ
     I              QTYRR                           QTYRRQ
     I              QTYRM                           QTYRMQ
     I              QTYRT                           QTYRTQ
     I              QTYOB                           QTYOBQ
     I              QTYOR                           QTYORQ
     I              QTYOM                           QTYOMQ
     I              QTYOT                           QTYOTQ
     I              QTSOS                           QTSOSQ
     I              ZZ0066                          ZZ066Q
     I              KOMIY                           KOMIYQ
     I              TAKU                            TAKUQ
     I              ZZ0104                          ZZ104Q
     IRDTR5230
     I              ZZ0001                          ZZ001R
     I              ACREC                           ACRECR
     I              JUTNO                           JUTNOR
     I              SEQNO                           SEQNOR
     I              ITCOD                           ITCODR
     I              JUTKC                           JUTKCR
     I              QUANT                           QUANTR
     I              QTYRS                           QTYRSR
     I              QTYOB                           QTYOBR
     I              DELCD                           DELCDR
     I              DOJNO                           DOJNOR
     I              BUNYN                           BUNYNR
     I              FILLR                           FILLRR
     IRDTR0050
     I              ZZ0001                          ZZ0005
     I              QUANT                           QUANT5
     I              TANKA                           TANKA5
     I              KINGA                           KINGA5
     IRDTR0030
     I              ZZ0001                          ZZ0003
     IRDTR0060
     I              ZZ0001                          ZZ0006
     IRDTP1110
     I              ZZ0001                          ZZ001X
     IRDTP1111
     I              ZZ0001                          ZZ001Z
     IRAML0041
     I              CUSNRA                          CUSNRA
     I              ITNBRA                          ITNBRA
     I              ORDQUA                          ORDQUA
     I              ORDNOA                          ORDNOA
     I              TANKAA                          TANKAA
     I              KINGAA                          KINGAA
     I              A1A                             A1A
     I              SLSNRA                          SLSNRA
     I              MFROMA                          MFROMA
     I              JUTNOA                          JUTNOA
     I              SEQNOA                          SEQNOA
     I              BIKO1A                          BIKO1A
     I              BIKO2A                          BIKO2A
0381 IRDKK0380                                                            TR0150
     I              ZZ0001                          RECCDZ
     I              ACREC                           ACRECZ
     I              JUSEN                           JUSENZ
     I              TOKSE                           TOKSEZ
     I              TOTAM                           TOTAMZ
     I              TOKSS                           TOKSSZ
     IRDTR0540
     I              RECCD4                          RECCDX
     I              ACREC4                          ACRECX
     I              DOJNO4                          DOJNOX
     I              JUTNO4                          JUTNOX
     I              SEQNO4                          SEQNOX
     I              CUSNR4                          CUSNRX
     IRDTR0542
     I              RECCD4                          RECCDZ
     I              ACREC4                          ACRECZ
     I              DOJNO4                          DOJNOZ
     I              JUTNO4                          JUTNOZ
     I              SEQNO4                          SEQNOZ
     I              CUSNR4                          CUSNRZ
0381 IRNPD1910                                                            TR0150
     I              KEYX                            KEYX9
     IRAML0101
     I              CUSNRE                          CUSNRW
     I              ORDNOE                          ORDNOW
     I              YUBINE                          YUBINW
     I              SHPNME                          SHPNMW
     I              SHIP1E                          SHIP1W
     I              SHIP2E                          SHIP2W
     I              SHTELE                          SHTELW
     I              BUSYOE                          BUSYOW
     I              BIKO1E                          BIKO1W
     I              BIKO2E                          BIKO2W
     I              COUNTE                          COUNTW
     I              DUEDYE                          DUEDYW
     I              SAGCDE                          SAGCDW
     I              ERR01E                          ERR01W
     I              ERR02E                          ERR02W
     I              ERR03E                          ERR03W
     I              ERR04E                          ERR04W
     I              ERR05E                          ERR05W
     I              DOJCDE                          DOJCDW
     I              GOKEIE                          GOKEIW
     I              TYKCDE                          TYKCDW
     I              SHITEE                          SHITEW
     I              DUMMYE                          DUMMYW
     I              EMAILE                          EMAILW
     I              ERRMOE                          ERRMOW
     I              ESLSNE                          ESLSNW
     I              OFNAME                          OFNAMW
     I              TRESAE                          TRESAW
     I              ORDN3E                          ORDN3W
     IDS1         DS
     I                                        1   80GJUTN2
     I                                        1   60GJUTNA
     I                                        7   80GJUTNB
     IDS2         DS
     I                                        1  14 WITCOD
     I                                        1   10W1
     I                                        2   20W2
     I                                        3   30W3
     I                                        4   40W4
     I                                        5   50W5
     I                                        6   60W6
     I                                        7   70W7
     I                                        8   80W8
     I                                        9   90W9
     I                                       10  100W10
     I                                       11  110W11
     I                                       12  120W12
     I                                       13  130W13
     I                                       14  140W14
     IDS3         DS
     I                                        1   6 WJUTKC
     I                                        1   1 A1
     I                                        2   20A2
     I                                        3   30A3
     I                                        4   40A4
     I                                        5   50A5
     I                                        6   60A6
     IDS4         DS
     I                                        1  42 ITNBRA
     I                                        1   5 WITNB5
     I                                        1  14 WITNB1
     I                                       16  16 W#ITN1
     I                                       17  42 W#ITN2
     I                                        1  25 ITNB25
     IDS5         DS
     I                                        1   80WJUTNO
     I                                        1   60WCNT
     I                                        7   80WSEQNO
     IDS6         DS
     I                                        1  30 ITDSC
     I                                        1  25 ITDS25
     I                                       26  26 ITDS26
     I                                       27  30 ITDS27
     I                                       26  28 ITDS28
     I                                       26  30 ITDS23
     I                                       27  30 ITDS30
     IDS7         DS
     I                                        1  25 W#KAT3
     I                                        5   8 W#QU1
     I                                       13  16 W#QU2
     IDS8         DS
     I                                        1   5 CUSNRE
     I                                        1   1 W#CUS1
     IDS9         DS
     I                                        1   5 CUSNRA
     I                                        1   1 W#CUSA
     I                                        1   2 W#CUS2
     IDS10        DS
     I                                        1   80JUSENA
     I                                        1   60JUTNOA
     I                                        7   80SEQNOA
     IDS11        DS
     I                                        1   8 ZZ0172
     I                                        4   4 TRACE
     IDS12        DS
     I                                        1  15 HNAME
     I                                        1   1 TANA1T
     I                                       15  15 BIKO1T
     IDS13        DS
     I                                        1   3 TRESAA
     I                                        1   2 W#TRE1
     I                                        1   1 W#TR11
     I                                        2   2 W#TR21
     I                                        3   3 W#TRE2
     IDS14        DS
     I                                        1  86 WMAIL
     I                                       27  27 W#X1
     I                                       28  86 WMAIL2
     IDS15        DS
     I                                        1  15 ORDNOA
     I                                        1   7 ORDN7A
     I                                        1   8 ORDN8A
     I*< SDS >
     I           SDS
     I                                        1  10 S#PGID
     I                                      244 253 S#JOB
     I                                      254 263 S#USR
     I*< ｼｽﾃﾑ日付>
     I            DS
     I                                        1  140W#SYST
     I                                        1   60W#SHMS
     I                                        7  140W#SYMD
     C*-----------------------------------------------------
     C                     TIME           W#SYST
     C                     MOVELS#JOB     W#JOB   5
     C*----------------------------------------------------
     C           PAR050    PLIST
     C                     PARM           P#KOSN  1
     C                     PARM           P#SBTP  1
     C                     PARM           P#KEY1 10
     C                     PARM           P#KEY2 14
     C                     PARM           P#KEY3 10
     C                     PARM           P#KEY4 10
     C                     PARM           P#ITCD 14
     C                     PARM           P#MFIQ 110
     C                     PARM           P#JUTN  80
     C                     PARM           P#IDSC 30
     C                     PARM           P#ITNO 25
     C                     PARM           P#RTCD  2
     C*<排他制御処理: @SB030R >
     C           PAR060    PLIST
     C                     PARM           P#SYOK  1        処理区分
     C                     PARM           P#OBJF 10         ﾌｧｲﾙID
     C                     PARM           P#OBJ1 15         KEY1
     C                     PARM           P#OBJ2 15         KEY2
     C                     PARM           P#OBJ3 15         KEY3
     C                     PARM           P#OBJ4 15         KEY4
     C                     PARM           P#OBJ5 15         KEY5
     C                     PARM           P#CRTP 10         ﾌﾟﾛｸﾞﾗﾑID
     C                     PARM           P#USID 10         ﾕｰｻﾞｰID
     C                     PARM           P#JBID 10         ｼﾞｮﾌﾞID
     C                     PARM           P#RTN2  2         ﾘﾀｰﾝｺｰﾄﾞ
     C*------------------------------------------------------------
     C           PAR070    PLIST
     C                     PARM           P#SKBN  1
     C                     PARM           P#LENG  30
     C                     PARM           P#MOJ1256
     C                     PARM           P#MOJ2256
     C                     PARM           P#MOJ3256
     C                     PARM           P#RETN  1
     C*------------------------------------------------------------
     C           PAR080    PLIST
     C                     PARM           P#DAY1  80
     C                     PARM           P#DATE  40
     C                     PARM           P#DAY2  80
     C*--------------------------------------------------------
     C           PAR090    PLIST
     C                     PARM           P#SELE  10       代理店
     C                     PARM           P#CUSN  5        代理店
     C                     PARM           P#ORDN 15        注文番号
     C                     PARM           P#OFNA 82        ファイル名
     C                     PARM           P#POST  1        出荷工場
     C*
     C                     PARM           P#JUT2  60       受注番号名
     C                     PARM           P#SEQ2  20       ファイル名
     C                     PARM           P#QUA2  70       トレサ数量
     C                     PARM           P#TRES  3        トレサ種類
     C                     PARM           P#ITDS 25        品名
     C*-----------------------------------------------------
     C           PAR150    PLIST
     C                     PARM           P#JUN8  80
     C*-----------------------------------------------------
     C           G0010     KLIST
     C                     KFLD           GJUTNA
     C                     KFLD           GJUTNB
     C*-----------------------------------------------------
     C           D0010     KLIST
     C                     KFLD           W1
     C                     KFLD           W2
     C                     KFLD           W3
     C                     KFLD           W4
     C                     KFLD           W5
     C                     KFLD           W6
     C                     KFLD           W7
     C                     KFLD           W8
     C                     KFLD           W9
     C                     KFLD           W10
     C                     KFLD           W11
     C                     KFLD           W12
     C                     KFLD           W13
     C                     KFLD           W14
     C*-----------------------------------------------------
     C           D0020     KLIST
     C                     KFLD           WCNT
     C                     KFLD           WSEQNO
     C*-----------------------------------------------------
     C           D002E     KLIST
     C                     KFLD           WCNT
     C                     KFLD           WKSEQ
     C*-----------------------------------------------------
     C           D0540     KLIST
     C                     KFLD           WDOJNO
     C                     KFLD           JUTNOA
     C                     KFLD           SEQNOA
     C*-----------------------------------------------------
     C           D0541     KLIST
     C                     KFLD           JUTNOA
     C                     KFLD           SEQNOA
     C*-----------------------------------------------------
     C           A0102     KLIST
     C                     KFLD           CUSNRA
     C                     KFLD           OFNAMA
     C*-----------------------------------------------------
     C           A0101     KLIST
     C                     KFLD           CUSNRA
     C                     KFLD           OFNAMA
     C                     KFLD           W#ORD3
     C*-----------------------------------------------------
     C           A0100     KLIST
     C                     KFLD           CUSNRA
     C                     KFLD           ORDNOA
     C                     KFLD           OFNAMA
     C*-----------------------------------------------------
     C           A0120     KLIST
     C                     KFLD           CUSNRA
     C                     KFLD           YUBINA
     C                     KFLD           SHPNMA
     C                     KFLD           SHIP1A
     C                     KFLD           SHIP2A
     C                     KFLD           BUSYOA
     C*-----------------------------------------------------
     C           A0121     KLIST
     C                     KFLD           WKCUSN
     C                     KFLD           WKYUBI
     C                     KFLD           WKSHP2
     C                     KFLD           WKSH12
     C                     KFLD           WKSH22
     C                     KFLD           WKBUS2
     C*-----------------------------------------------------
     C           PAR010    PLIST
     C                     PARM           P#DELC  1
     C                     PARM           P#SELC  10
     C                     PARM           P#KOSN  1
     C                     PARM           P#JUT4  60
     C                     PARM           P#SEQ4  20
     C                     PARM           P#NBNB  6
     C                     PARM           P#NB11  6
     C                     PARM           P#NB21  6
     C                     PARM           P#NB31  6
     C                     PARM           P#NB41  6
     C                     PARM           P#NB51  6
     C                     PARM           P#DE11  60
     C                     PARM           P#DE21  60
     C                     PARM           P#DE31  60
     C                     PARM           P#DE41  60
     C                     PARM           P#DE51  60
     C                     PARM           P#RECD  2
     C*-----------------------------------------------------
     C           D0050     KLIST
     C                     KFLD           WAA1
     C                     KFLD           WAA2
     C                     KFLD           WECNTE
     C*-----------------------------------------------------
     C           D002A     KLIST
     C                     KFLD           JUTNOA
     C                     KFLD           SEQNOA
     C*----------------------------------------------------
     C           D004A     KLIST
     C                     KFLD           JUTNOA
     C                     KFLD           SEQNOA
     C*START------------------------------------------------
     C                     TIME           CLOCK   60
     C                     MOVEL*BLANK    W#ORD3 15
     C*
     C                     SETOF                     90
     C           'TSS'     CHAINDTR9900              90
     C           *IN90     IFEQ '0'
     C                     Z-ADDETIMEX    WKTIME  60
     C                     ENDIF
     C*
     C                     Z-ADD0         FLAG01  10
     C                     Z-ADD0         FLAG02  10
     C                     Z-ADD0         FLAG10  10
     C                     Z-ADD0         FLAG20  10
     C                     Z-ADD0         FLAG30  10
     C                     Z-ADD0         FLAG50  10
     C*
     C                     Z-ADD0         WKCNT   20
     C                     Z-ADD0         WKSEQ   20
     C*
     C                     MOVEL*BLANK    CCMAIL 50
     C*
     C*---------------------------------------------
     C           FLAG30    DOWEQ0
     C                     SETOF                     75
     C                     READ RAML0041                 75
     C           *IN75     IFEQ '1'
     C                     Z-ADD1         FLAG30
     C                     ELSE
     C           A1A       IFNE ' '
     C                     EXSR #CNT
     C                     Z-ADD1         FLAG30
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*---------------------------------------------
     C*
     C                     Z-ADD0         W#FLAG
     C           *LOVAL    SETLLAML0041
     C*
     C           FLAG02    DOWEQ0
     C                     SETOF                     70
     C                     READ RAML0041                 70
     C           *IN70     IFEQ '1'
     C           W#FLAG    IFEQ 1
     C                     EXSR #UPD01
     C                     ENDIF
     C                     Z-ADD1         FLAG02
     C                     ELSE
     C*
     C           A1A       IFNE ' '
     C*
     C                     Z-ADD1         W#FLAG  10       データあり
     C*
     C           CUSNRA    IFEQ W#CUSN
     C           ORDNOA    ANDEQW#ORDN
     C*
     C           A1A       IFEQ 'A'
     C           A1A       OREQ 'B'
     C           A1A       OREQ 'E'
     C           A1A       OREQ 'X'
     C*
     C                     SETOF                     95
     C           CUSNRA    CHAINDMR0010              95
     C           *IN95     IFEQ '0'
     C*
     C           DCODEE    IFEQ 0
     C                     Z-ADD1         WDCODE  20
     C                     ELSE
     C                     Z-ADDDCODEE    WDCODE  20
     C                     ENDIF
     C*---------------------------------------------
     C           SHPN2A    IFNE *BLANK
     C                     MOVELSHPN2A    W#SHPN  5
     C                     ELSE
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*---------------------------------------------
     C                     ENDIF
     C*
     C           WKCNT     IFGT 6
     C                     EXSR #UPD01
     C                     Z-ADD0         WKCNT
     C                     EXSR #CNT
     C                     EXSR #RTN1
     C                     ELSE
     C                     EXSR #RTN1
     C                     ENDIF
     C*
     C                     ELSE
     C                     ENDIF
     C*
     C                     ELSE
     C*
     C                     EXSR #UPD01
     C*
     C                     Z-ADD0         WKCNT
     C*
     C*注文番号取得
     C                     EXSR #ORD2
     C*
     C***                  MOVELORDN7A    W#ORD3
     C*----------------------------------------------------
     C                     EXSR #TYOK
     C*-----------------------------------------------------
     C                     MOVELCUSNRA    W#CUSN  5
     C                     MOVELORDNOA    W#ORDN 15
     C                     EXSR #CNT
     C*
     C           A1A       IFEQ 'A'
     C           A1A       OREQ 'B'
     C           A1A       OREQ 'E'
     C           A1A       OREQ 'X'
     C*
     C                     SETOF                     95
     C           CUSNRA    CHAINDMR0010              95
     C           *IN95     IFEQ '0'
     C                     Z-ADDDCODEE    WDCODE  20
     C                     MOVELSHPNRE    W#SHPN  5
     C*---------------------------------------------
     C           SHPN2A    IFNE *BLANK
     C                     MOVELSHPN2A    W#SHPN  5
     C                     ELSE
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*-------------------------------------------
     C                     ENDIF
     C*
     C           WKCNT     IFGT 6
     C                     EXSR #UPD01
     C                     Z-ADD0         WKCNT
     C                     EXSR #CNT
     C                     EXSR #RTN1
     C                     ELSE
     C                     EXSR #RTN1
     C                     ENDIF
     C*
     C                     ELSE
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* 終了
     C           FLAG20    IFEQ 0
     C                     Z-ADD0         FLAG99  10
     C*同時納入確認
     C                     EXSR #DOJ1
     C*出荷工場
     C                     EXSR #SHKA
     C*印刷処理
     C           W#CUS2    IFEQ '0M'
     C           W#CUS2    OREQ '0T'
     C*
     C*注文番号取得
     C                     EXSR #ORD2
     C*
     C                     EXSR #PRT01                     AML0040
     C                     ELSE
     C                     EXSR #PRT02                     AML0040
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C***                  ELSE
     C***                  ENDIF
     C*------------------------------------------------------------
     C                     SETON                     LR
     C                     RETRN
     C*------------------------------------------------------------
     C           #RTN1     BEGSR
     C                     SELEC
     C           A1A       WHEQ 'A'
     C                     EXSR #HYOZ
     C           WKCNT     ADD  1         WKCNT
     C           A1A       WHEQ 'E'
     C                     EXSR #PART
     C           WKCNT     ADD  1         WKCNT
     C           A1A       WHEQ 'B'
     C*---------
     C*
     C           W#CUSA    IFEQ '0'
     C                     MOVEL'P'       WAA1    1
     C                     MOVEL'B'       WAA2    1
     C                     ELSE
     C                     MOVEL'P'       WAA1
     C                     MOVEL'E'       WAA2
     C                     ENDIF
     C*---------
     C*
     C                     SETOF                     95
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0
     C*DTR0060 UPDATE
     C                     SETOF                     91
     C           2         CHAINDTR0060              91
     C           *IN91     IFEQ '0'
     C*
     C           BCNTE     IFEQ 0
     C           BCNTE     ADD  1         BCNTE
     C                     ENDIF
     C*
     C                     Z-ADDBCNTE     WECNTE  40
     C           BCNTE     ADD  1         BCNTE
     C                     UPDATRDTR0060
     C                     ENDIF
     C*
     C           D0050     CHAINDTR0050              95
     C           *IN95     IFEQ '1'
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C                     ENDIF
     C*
     C                     ENDDO
     C*-----------------------------------------------------
     C                     EXSR #PAR2
     C           WKCNT     ADD  1         WKCNT
     C*
     C*その他
     C           A1A       WHEQ 'X'
     C                     EXSR #EXTR
     C           WKCNT     ADD  1         WKCNT
     C*
     C                     ENDSL
     C                     ENDSR
     C*------------------------------------------------------------
     C           #HYOZ     BEGSR
     C                     MOVEL*BLANK    WITDSC 30
     C*
     C                     SETOF                     919293
     C           ITNB25    CHAINDMR0040              91
     C           *IN91     IFEQ '0'
     C                     MOVELITCODK    WITCOD 14
     C                     EXSR #TANKA
     C                     MOVELITNBRK    WITDSC 30
     C                     MOVELELECDK    WELECD  1
     C*
     C                     Z-ADD0         WA5     10
     C                     Z-ADD0         WHIKI   50
     C                     Z-ADD0         WMINO   50
     C           D0010     CHAINDTR0010              92
     C           *IN92     IFEQ '0'
     C           QTYOHT    IFGE ORDQUA                     全完
     C           QTYOHT    SUB  ORDQUA    QTYOHT
     C           QTYRST    ADD  ORDQUA    QTYRST
     C           QTYRTT    ADD  ORDQUA    QTYRTT
     C                     Z-ADDORDQUA    WHIKI
     C                     Z-ADD1         WA5
     C                     ELSE
     C           QTYOBT    ADD  ORDQUA    QTYOBT           未納
     C           QTYOTT    ADD  ORDQUA    QTYOTT
     C                     Z-ADD2         WA5
     C                     Z-ADDORDQUA    WMINO
     C                     ENDIF
     C                     UPDATRDTR0010
     C* 受注Ｆ
     C                     Z-ADDWKCNT     WSEQNO
     C           D0020     CHAINDTR0020              95
     C           *IN95     IFEQ '1'
     C                     EXSR #MOV2
     C                     WRITERDTR0020
     C                     ENDIF
     C* 引当Ｆ
     C           D0020     CHAINDTR0040              96
     C           *IN96     IFEQ '1'
     C                     EXSR #MOV3
     C                     WRITERDTR0040
     C                     ENDIF
     C* トルクセット
     C           TOKSSA    IFNE *BLANK
     C***                  EXSR #RTN5
     C                     MOVELWCNT      W#JUTN  80
     C                     MOVE WSEQNO    W#JUTN
     C*
     C                     SETOF                     92
     C           W#JUTN    CHAINDKK0380              92
     C           *IN92     IFEQ '1'
     C                     MOVEL'N1'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDW#JUTN    JUSENZ
     C                     Z-ADD0         TOKSEZ
     C*
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C***                  Z-ADDW#TOK5    TOKSEZ
     C                     Z-ADDTOKSEA    TOKSEZ
     C                     MOVELWTOTAM    TOTAMZ
     C*
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     WRITERDKK0380
     C                     ELSE
     C                     MOVEL'N1'      RECCDZ
     C                     MOVEL*BLANK    ACRECZ
     C                     Z-ADDW#JUTN    JUSENZ
     C                     Z-ADD0         TOKSEZ
     C*
     C                     EXSR #RTN4
     C                     MOVEAWK4       TOKSSZ
     C***                  Z-ADDW#TOK5    TOKSEZ
     C                     Z-ADDTOKSEA    TOKSEZ
     C*
     C                     MOVELWTOTAM    TOTAMZ
     C*
     C                     Z-ADDW#SYMD    CRTD8
     C                     Z-ADDW#SHMS    CRTT8
     C                     MOVELS#USR     USID8
     C                     MOVELS#JOB     JBID8
     C                     MOVELS#PGID    PGID8
     C                     UPDATRDKK0380
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     EXSR #TR010                     在庫引当自動
     C*DTR0120 WRITE
     C                     SETOF                     95
     C           ITNB25    CHAINDTR2060X             95
     C           *IN95     IFEQ '0'
     C           SEBAS     IFEQ ' '
     C                     MOVEL'O'       SHOCDV
     C                     ELSE
     C                     MOVELSEBAS     SHOCDV
     C                     ENDIF
     C                     EXSR #D120
     C                     ELSE
     C                     SETON                     H7
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETON                     H3
     C                     ENDIF
     C                     ELSE
     C                     SETON                     H4
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #CNT      BEGSR
     C           A1A       IFNE ' '
     C*
     C           FLAG50    IFEQ 0
     C*
     C                     SELEC
     C           W#CUS2    WHEQ '0M'
     C                     MOVELORDN7A    W#ORD3
     C           W#CUS2    WHEQ '0T'
     C                     MOVELORDN8A    W#ORD3
     C                     ENDSL
     C*
     C                     EXSR #TYOK
     C                     Z-ADD1         FLAG50
     C                     ENDIF
     C*
     C                     SETOF                     95
     C           CUSNRA    CHAINDMR0010              95
     C           *IN95     IFEQ '0'
     C                     Z-ADDDCODEE    WDCODE  20
     C                     MOVELSHPNRE    W#SHPN  5
     C*
     C           SHPN2A    IFNE *BLANK
     C                     MOVELSHPN2A    W#SHPN  5
     C                     ELSE
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*
     C*
     C                     ENDIF
     C*
     C                     Z-ADD0         FLAG11  10
     C           FLAG11    DOWEQ0
     C*
     C                     EXSR #HAIT1
     C*
     C           P#RTN2    IFEQ *BLANK
     C*
     C           1         CHAINDTR0030              93
     C           *IN93     IFEQ '0'
     C                     Z-ADDJCCNT     WCNT    60
     C           1         ADD  JCCNT     JCCNT
     C                     UPDATRDTR0030
     C*
     C                     EXSR #HAIT2
     C                     Z-ADD1         FLAG11
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDDO
     C*
     C                     SETOF                     949596
     C                     Z-ADD0         WSEQNO  20
     C           D0020     CHAINDTR0020              94
     C           *IN94     IFEQ '1'
     C                     EXSR #MOV1
     C                     WRITERDTR0020
     C                     ENDIF
     C*
     C           WKCNT     ADD  1         WKCNT
     C*
     C                     ENDIF
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C*直送先住所
     C           #TYOK     BEGSR
     C*
     C                     SELEC
     C           W#CUS2    WHEQ '0M'
     C           W#CUS2    OREQ '0T'
     C*
     C                     SETOF                     91
     C           A0101     CHAINAML0101              91
     C           *IN91     IFEQ '0'
     C*
     C                     MOVELCUSNRA    W#CUSN  5
     C                     MOVELORDNOA    W#ORDN 15
     C*
     C                     MOVELYUBINW    W#YUBI 10
     C                     MOVELSHPNMW    W#SHP1 50
     C*文字列操作（住所１）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD60        P#LENG
     C                     MOVELSHIP1W    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#SHI1 60
     C***
     C*文字列操作（住所２）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD60        P#LENG
     C                     MOVELSHIP2W    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#SHI2 60
     C***
     C                     MOVELSHTELW    W#SHTL 15
     C*文字列操作（部署）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD62        P#LENG
     C                     MOVELBUSYOW    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#BUSY 62
     C***
     C*文字列操作（備考１）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD62        P#LENG
     C                     MOVELBIKO1W    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#BIK1 62
     C*
     C*文字列操作（備考２）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD62        P#LENG
     C                     MOVELBIKO2W    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#BIK2 62
     C*
     C                     Z-ADDDUEDYW    W#DUEY  80
     C                     Z-ADDSAGCDW    W#SAGY  50
     C*
     C                     ENDIF
     C*
     C*水戸・トミタ以外
     C                     OTHER
     C*
     C                     MOVELCUSNRA    W#CUSN  5
     C                     MOVELORDNOA    W#ORDN 15
     C*
     C                     SETOF                     91
     C           A0100     CHAINAML0100              91
     C           *IN90     IFEQ '0'
     C                     MOVELYUBINE    W#YUBI 10
     C                     ELSE
     C                     MOVELYUBINA    W#YUBI 10
     C                     ENDIF
     C*
     C                     MOVELSHPNMA    W#SHP1 50
     C*文字列操作（住所１）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD60        P#LENG
     C                     MOVELSHIP1A    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#SHI1 60
     C***
     C*文字列操作（住所２）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD60        P#LENG
     C                     MOVELSHIP2A    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#SHI2 60
     C***
     C                     MOVELSHTELA    W#SHTL 15
     C*文字列操作（部署）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD62        P#LENG
     C                     MOVELBUSYOA    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#BUSY 62
     C***
     C*文字列操作（備考１）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD62        P#LENG
     C                     MOVELBIKO1A    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#BIK1 62
     C*
     C*文字列操作（備考２）
     C                     MOVEL'1'       P#SKBN
     C                     Z-ADD62        P#LENG
     C                     MOVELBIKO2A    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ2    W#BIK2 62
     C*
     C                     Z-ADDDUEDYA    W#DUEY  80
     C                     Z-ADDSAGCDA    W#SAGY  50
     C*
     C                     ENDSL
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #UPD01    BEGSR
     C                     SETOF                     95
     C           D002E     CHAINDTR0020              95
     C           *IN95     IFEQ '0'
     C                     Z-ADDWKCNT     DETCN
     C                     UPDATRDTR0020
     C                     ENDIF
     C                     ENDSR
     C*------------------------------------------------------------
     C           #PART     BEGSR
     C                     MOVEL*BLANK    WELECD
     C                     SETOF                     919293
     C           WITNB1    CHAINDTR5170              91
     C           *IN91     IFEQ '0'
     C                     MOVEL*BLANK    WITCOD 14
     C*
     C           TPRICA    IFEQ *BLANK
     C                     Z-ADDUNPRIB    WTANKA  90
     C                     ELSE
     C                     Z-ADDTANKAA    WTANKA  90
     C                     ENDIF
     C*
     C                     EXSR #RTN3                      ﾊﾟｰﾂﾋﾝﾒｲ
     C*
     C                     Z-ADD0         WA5     10
     C                     Z-ADD0         WHIKI   50
     C                     Z-ADD0         WMINO   50
     C           WITNB1    CHAINDTR5200              92
     C           *IN92     IFEQ '0'
     C           QTYOHQ    IFGE ORDQUA                     全完
     C           QTYOHQ    SUB  ORDQUA    QTYOHQ
     C           QTYRSQ    ADD  ORDQUA    QTYRSQ
     C           QTYRTQ    ADD  ORDQUA    QTYRTQ
     C                     Z-ADDORDQUA    WHIKI
     C                     Z-ADD1         WA5
     C                     ELSE
     C           QTYOBQ    ADD  ORDQUA    QTYOBQ
     C           QTYOTQ    ADD  ORDQUA    QTYOTQ
     C                     Z-ADD2         WA5
     C                     Z-ADDORDQUA    WMINO
     C                     ENDIF
     C                     UPDATRDTR5200
     C*
     C                     Z-ADDWKCNT     WSEQNO
     C           D0020     CHAINDTR0020              95
     C           *IN95     IFEQ '1'
     C                     EXSR #MOV2
     C                     MOVEL'E'       A1
     C                     MOVEL'**'      NBNBR
     C                     MOVEL*BLANK    ITDSC
     C                     MOVELWITDSC    ITDSC
     C                     MOVELWITNB1    ITCOD
     C                     WRITERDTR0020
     C                     ENDIF
     C*
     C           D0020     CHAINDTR5230              96
     C           *IN96     IFEQ '1'
     C                     EXSR #MOV5
     C                     WRITERDTR5230
     C                     ENDIF
     C*DTR0120 WRITE
     C                     SETOF                     95
     C           WJUTNO    CHAINDTR0120              95
     C           *IN95     IFEQ '1'
     C*
     C           PLACEB    IFEQ ' '
     C                     MOVEL'O'       SHOCDV
     C                     ELSE
     C                     MOVELPLACEB    SHOCDV
     C                     ENDIF
     C*
     C                     EXSR #D120
     C                     ELSE
     C                     SETON                     H8
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETON                     H5
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETON                     H6
     C                     ENDIF
     C*
     C                     ENDSR
     C*------------------------------------------------------------
     C           #PAR2     BEGSR
     C                     MOVEL*BLANK    WITDSC 30
     C                     MOVEL*BLANK    WITDS2 30
     C                     MOVEL*BLANK    WITDSJ 30
     C*
     C                     Z-ADD0         WTANKA  90
     C                     SETOF                     96
     C           WITNB1    CHAINDTR5170              96
     C           *IN96     IFEQ '0'
     C                     MOVELITDSJB    WITDSJ
     C                     MOVELITDSEB    WITDSC
     C*
     C*
     C           TPRICA    IFEQ *BLANK
     C                     Z-ADDUNPRIB    WTANKA  90
     C                     ELSE
     C                     Z-ADDTANKAA    WTANKA
     C                     ENDIF
     C*
     C                     ENDIF
     C                     EXSR #RTN3
     C*
     C                     Z-ADDWKCNT     WSEQNO
     C           D0020     CHAINDTR0020              95
     C           *IN95     IFEQ '1'
     C*
     C                     EXSR #MOV2
     C*
     C           DELDYA    IFEQ 0
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     ELSE
     C                     Z-ADDDELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD1         DELCD
     C                     ENDIF
     C*
     C                     MOVEL'E'       A1
     C                     Z-ADD0         A2
     C                     Z-ADD0         A3
     C                     Z-ADD0         A4
     C                     Z-ADD0         A5
     C                     Z-ADD1         A6
     C                     MOVEL*BLANK    ITCOD
     C                     MOVELDESNOB    ITCOD
     C           W#CUSA    IFEQ '0'
     C                     MOVEL'PB'      NBNBR
     C                     ELSE
     C                     MOVEL'PE'      NBNBR
     C                     ENDIF
     C                     MOVE WECNTE    NBNBR
     C                     WRITERDTR0020
     C                     ENDIF
     C*手配数計算
     C                     MOVEL*BLANK    W#KAT3 25
     C                     MOVEL*BLANK    WKATA4 14
     C                     Z-ADD0         WQUAN4  50
     C           UNPCSB    IFNE 1
     C                     MOVEL'ｺﾞｳｹｲ'   WKATA4
     C           UNPCSB    MULT ORDQUA    WQUAN4
     C*
     C                     MOVELTBL01,2   W#KAT3
     C*
     C                     MOVE UNPCSB    W#QU1
     C                     SELEC
     C           UNPCSB    WHLE 9
     C                     MOVEL'   '     W#QU1
     C           UNPCSB    WHLE 99
     C                     MOVEL'  '      W#QU1
     C           UNPCSB    WHLE 999
     C                     MOVEL' '       W#QU1
     C           UNPCSB    WHLE 9999
     C                     ENDSL
     C*
     C                     MOVE ORDQUA    W#QU2
     C                     SELEC
     C           ORDQUA    WHLE 9
     C                     MOVEL'   '     W#QU2
     C           ORDQUA    WHLE 99
     C                     MOVEL'  '      W#QU2
     C           ORDQUA    WHLE 999
     C                     MOVEL' '       W#QU2
     C           ORDQUA    WHLE 9999
     C                     ENDSL
     C*
     C                     MOVE WQUAN4    WAA     5
     C           WQUAN4    IFLE 9
     C                     MOVEL'    '    WAA
     C                     ELSE
     C           WQUAN4    IFLE 99
     C                     MOVEL'   '     WAA
     C                     ELSE
     C           WQUAN4    IFLE 999
     C                     MOVEL'  '      WAA
     C                     ELSE
     C           WQUAN4    IFLE 9999
     C                     MOVEL' '       WAA
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVELWAA       WBB     9
     C                     MOVE 'ｺﾃﾊｲ'    WBB
     C                     MOVE WBB       WKATA4
     C                     ENDIF
     C*DTR0050 WRITE
     C*
     C           DELDYA    IFEQ 0
     C                     EXSR #DELDY
     C                     ELSE
     C                     MOVELDELDYA    WDELDY
     C                     ENDIF
     C*
     C           W#CUSA    IFEQ '0'
     C                     MOVEL'P'       WAA1    1
     C                     MOVEL'B'       WAA2    1
     C                     ELSE
     C                     MOVEL'P'       WAA1
     C                     MOVEL'E'       WAA2
     C                     ENDIF
     C*
     C                     SETOF                     92
     C           D0050     CHAINDTR0050              92
     C           *IN92     IFEQ '1'
     C                     MOVEL'SF'      ZZ0005
     C                     MOVEL*BLANK    ACREC
     C           W#CUSA    IFEQ '0'
     C                     MOVEL'P'       AA1
     C                     MOVEL'B'       AA2
     C                     ELSE
     C                     MOVEL'P'       AA1
     C                     MOVEL'E'       AA2
     C                     ENDIF
     C*-----------------------------------------------------
     C                     Z-ADDWECNTE    AA4
     C                     MOVELWITDSC    ITDSC
     C                     Z-ADDORDQUA    QUANT5
     C                     Z-ADDUNPRIB    TANKA5
     C           QUANT5    MULT UNPRIB    KINGA5
     C                     Z-ADDWJUTNO    JUSEN
     C                     MOVELCUSNRA    CUSNR
     C                     Z-ADD0         SIKYN
     C                     MOVEL'E'       A1
     C                     Z-ADD0         A2
     C                     Z-ADD0         A3
     C                     Z-ADD0         A4
     C                     Z-ADD0         A5
     C                     Z-ADD1         A6
     C                     Z-ADD0         DETCN
     C                     Z-ADD0         SISAC
     C                     MOVE WDELDY    DELEV
     C                     Z-ADD0         MITSU
     C                     Z-ADD0         ZUMEN
     C                     Z-ADD0         SIYTE
     C                     Z-ADD0         TORSI
     C                     MOVEL*BLANK    TORQU
     C                     Z-ADD0         KENSA
     C                     Z-ADD0         ZAISI
     C                     Z-ADD0         HOSIK
     C                     MOVELDESNOB    KATA1
     C                     Z-ADD0         QUAN1
     C                     MOVEL*BLANK    KIBA1
     C*ｶﾀｼｷ
     C                     MOVEL*BLANK    KATA2
     C                     SETOF                     96
     C           DESNOB    CHAINNPR0100              96
     C           *IN96     IFEQ '0'
     C                     MOVELITDSC1    KATA2
     C                     ELSE
     C                     MOVELWITDSJ    KATA2
     C                     ENDIF
     C*
     C                     Z-ADD0         QUAN2
     C                     MOVEL*BLANK    KIBA2
     C                     MOVELW#KAT3    KATA3
     C                     Z-ADD0         QUAN3
     C                     MOVEL*BLANK    KIBA3
     C                     MOVELWKATA4    KATA4
     C                     Z-ADD0         QUAN4
     C                     MOVEL*BLANK    KIBA4
     C                     MOVEL'PE.ｺﾝﾎﾟｳ'KATA5
     C                     Z-ADD0         QUAN5
     C                     MOVEL*BLANK    KIBA5
     C                     Z-ADDUNPRIB    BAIKA
     C*
     C                     SELEC
     C           PLACEB    WHEQ 'O'
     C                     MOVELLOCAO1    USERN
     C           PLACEB    WHEQ 'K'
     C                     MOVELLOCAK1    USERN
     C           PLACEB    WHEQ 'T'
     C                     MOVELLOCAT1    USERN
     C                     ENDSL
     C*
     C                     MOVEL*BLANK    SEFIN
     C                     MOVEL' '       SECAN
     C                     Z-ADD0         SEHAD
     C                     Z-ADD0         NSEQN
     C                     Z-ADD0         OUTQU
     C                     Z-ADD0         OWQUA
     C                     Z-ADD0         FIQUA
     C                     MOVEL*BLANK    FNAIY
     C                     Z-ADD0         BUNNO
     C                     Z-ADD0         FIDAY
     C                     MOVEL' '       SIDEC
     C                     MOVEL*BLANK    ZZ0348
     C                     Z-ADD0         MADEL
     C                     Z-ADDUNPRIB    STPRI
     C                     MOVEL*BLANK    ZZ0371
     C                     Z-ADDWDELDY    DELEV8
     C                     Z-ADD0         SEHAD8
     C                     Z-ADD0         FIDAY8
     C                     WRITERDTR0050
     C                     ENDIF
     C*
     C                     EXSR #SPD
     C*DTR0120
     C                     EXSR #D120X
     C                     ENDSR
     C*------------------------------------------------------------
     C*その他品目
     C           #EXTR     BEGSR
     C*
     C                     Z-ADDWKCNT     WSEQNO
     C           D0020     CHAINDTR0020              95
     C           *IN95     IFEQ '1'
     C*
     C                     MOVEL*BLANK    WELECD
     C                     SETOF                     919293
     C           WITNB5    CHAINDMR0340              91
     C           *IN92     IFEQ '0'
     C*
     C                     MOVEL'JF'      ZZ0001
     C                     MOVEL' '       ACREC
     C                     Z-ADDWCNT      JUTNO
     C                     Z-ADDWSEQNO    SEQNO
     C                     MOVELCUSNRA    CUSNR
     C                     MOVELW#SHPN    SHPNR
     C*
     C* 担当者
     C           ESLSNA    IFNE 0
     C                     Z-ADDESLSNA    SLSNR
     C                     ELSE
     C*
     C           SLSNR4    IFEQ 0
     C                     Z-ADDSLSNRA    SLSNR
     C                     ELSE
     C                     Z-ADDSLSNR4    SLSNR
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVELORDNOA    ORDNO
     C*
     C                     MOVE *DATE     JUTDY
     C                     Z-ADD0         DETCN
     C                     Z-ADD0         DELCD
     C                     Z-ADD0         W#DELC
     C*
     C                     SETOF                     91
     C           WITNB5    CHAINDMR0340              91
     C           *IN91     IFEQ '0'
     C*
     C*納期
     C           DELDYA    IFEQ 0
     C                     SELEC
     C           WITNB5    WHEQ 'ﾁｮｸｿｳ'
     C*
     C           DOJCDA    IFNE '*'
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     ELSE
     C*
     C                     EXSR #DELD2
     C                     Z-ADDWDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C*
     C                     ENDIF
     C*
     C                     OTHER
     C*
     C*その他（直送運賃以外）
     C           DOJCDA    IFEQ *BLANK
     C           TRESAA    ANDEQ*BLANK
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     ELSE
     C*
     C*
     C                     EXSR #DELD2
     C                     Z-ADDWDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C*
     C                     ENDIF
     C                     ENDSL
     C*
     C*納期指定
     C                     ELSE
     C           DELDYA    IFEQ 999999
     C           DELDYA    ANDEQ99999999
     C                     Z-ADDDELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD0         DELCD
     C                     Z-ADD0         W#DELC  10
     C                     ELSE
     C*
     C*納期＜＝今日より小さい
     C***        DELDYA    IFLE *DATE
     C           DELDYA    IFLT *DATE
     C*
     C                     EXSR #DELD2
     C                     Z-ADDWDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C                     ELSE
     C*
     C                     Z-ADDDELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD1         DELCD            納期指定
     C                     Z-ADD1         W#DELC  10
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVELA14       A1
     C                     Z-ADDA24       A2
     C                     Z-ADDA34       A3
     C                     Z-ADDA44       A4
     C                     Z-ADDA54       A5
     C                     Z-ADDA64       A6
     C                     ENDIF
     C*
     C                     Z-ADDORDQUA    QUANT
     C                     Z-ADDTANKAA    TANKA1
     C           TANKA1    MULT ORDQUA    KINGA
     C*
     C                     MOVELITNBRA    ITDSC
     C*
     C                     MOVEL'00000000'ITCOD
     C                     MOVE '00000000'ITCOD
     C                     MOVEL*BLANK    DOJNO
     C*
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYN
     C                     ELSE
     C                     Z-ADD1         BUNYN
     C                     ENDIF
     C*
     C                     Z-ADD0         INVNO
     C                     MOVEL*BLANK    NBNBR
     C                     Z-ADD0         BUMOR
     C                     MOVEL*BLANK    BUNDT
     C                     Z-ADD0         BQUAN
     C                     Z-ADD0         HJQTY
     C                     Z-ADD0         BUNSU
     C                     MOVEL*BLANK    REJUK
     C                     MOVEL*BLANK    SLSND
     C                     Z-ADD0         TKING
     C                     MOVEL*BLANK    SSHUF
     C                     Z-ADD0         HIKIQ
     C                     MOVEL*BLANK    NOFIL
     C* トレサ付き
     C           W#TRE2    IFNE *BLANK
     C*
     C           W#TRE1    IFGE '1'
     C           W#TRE1    ANDLE'99'
     C                     MOVEL'*'       TRACE
     C                     ENDIF
     C*
     C                     ELSE
     C*
     C           W#TR21    IFNE *BLANK
     C*
     C           W#TRE1    IFGE '1'
     C           W#TRE1    ANDLE'99'
     C                     MOVEL'*'       TRACE
     C                     ENDIF
     C*
     C                     ELSE
     C           W#TR11    IFGE '1'
     C           W#TR11    ANDLE'9'
     C                     MOVEL'*'       TRACE
     C                     ELSE
     C*
     C                     MOVEL*BLANK    ZZ0172
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C***        W#TRE1    IFGE '1'
     C***        W#TRE1    ANDLE'99'
     C***                  MOVEL'*'       TRACE
     C***                  ELSE
     C***                  MOVEL*BLANK    ZZ0172
     C****                 ENDIF
     C*
     C                     MOVEL*BLANK    SHPCD
     C                     Z-ADD0         SHUDY
     C                     MOVE *DATE     REDAY
     C                     MOVE *DATE     JUTDY8
     C                     Z-ADD0         SHUDY8
     C                     MOVE *DATE     REDAY8
     C                     Z-ADD0         CODED
     C                     MOVEL*BLANK    CUSID
     C                     MOVEL*BLANK    SHICD
     C                     Z-ADDW#SYMD    CRTD2
     C                     Z-ADDW#SHMS    CRTT2
     C                     MOVELS#USR     USID2
     C                     MOVELS#JOB     JBID2
     C                     MOVELS#PGID    PGID2
     C*
     C                     MOVEL*BLANK    LCLA2
     C                     MOVEL*BLANK    MCLA2
     C                     MOVEL*BLANK    SCLA2
     C*
     C           SEQNO     IFNE 0
     C                     SETOF                     90
     C           ITDS25    CHAINDMR0040              90
     C           *IN90     IFEQ '0'
     C                     MOVELLCLAS     LCLA2
     C                     MOVELMCLAS     MCLA2
     C                     MOVELSCLAS     SCLA2
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ELSE
     C                     ENDIF
     C*
     C                     WRITERDTR0020
     C*
     C                     EXSR #D120Z
     C*
     C                     Z-ADDWCNT      JUTNOA
     C                     Z-ADDWSEQNO    SEQNOA
     C                     UPDATRAML0041
     C*
     C                     ELSE
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------
     C           #D120X    BEGSR
     C*DTR0120 WRITE
     C                     SETOF                     95
     C           WJUTNO    CHAINDTR0120              95
     C           *IN95     IFEQ '1'
     C*
     C           PLACEB    IFEQ ' '
     C                     MOVEL'O'       SHOCDV
     C                     ELSE
     C                     MOVELPLACEB    SHOCDV
     C                     ENDIF
     C*
     C                     EXSR #D120
     C                     ELSE
     C                     SETON                     H8
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------
     C           #D120Z    BEGSR
     C*DTR0120 WRITE
     C                     SETOF                     95
     C           WJUTNO    CHAINDTR0120              95
     C           *IN95     IFEQ '1'
     C*
     C                     MOVEL'C'       SHOCDV
     C*
     C                     EXSR #D120
     C                     ELSE
     C                     SETON                     H8
     C                     ENDIF
     C                     ENDSR
     C*-------------------------------------------------------
     C           #SPD      BEGSR
     C                     MOVEL' '       P#KOSN
     C                     MOVEL'7'       P#SBTP
     C                     MOVELAA1       P#KEY1
     C                     MOVELAA2       P#KEY2
     C                     MOVE AA4       P#KEY3
     C                     MOVEL*BLANK    P#KEY4
     C                     MOVEL*BLANK    P#ITCD
     C                     Z-ADDQUANT5    P#MFIQ
     C                     MOVE JUSEN     P#JUTN
     C                     MOVELITDSC     P#IDSC
     C                     MOVEL' '       P#ITNO
     C                     MOVEL*BLANK    P#RTCD                           *  +
     C                     CALL 'CT5000R' PAR050
     C                     ENDSR
     C*----------------------------------------------------------
     C           #MOV1     BEGSR
     C                     MOVEL'JF'      ZZ0001
     C                     MOVEL' '       ACREC
     C                     Z-ADDWCNT      JUTNO
     C                     Z-ADDWSEQNO    SEQNO
     C                     MOVELCUSNRA    CUSNR
     C                     MOVELW#SHPN    SHPNR
     C*
     C           ESLSNA    IFNE 0
     C                     Z-ADDESLSNA    SLSNR
     C                     ELSE
     C                     Z-ADDSLSNRA    SLSNR
     C                     ENDIF
     C*
     C                     MOVELORDNOA    ORDNO
     C                     MOVE *DATE     JUTDY
     C                     Z-ADD0         DELCD
     C                     Z-ADD0         W#DELC  10
     C* 海外
     C           W#CUS1    IFNE '0'
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     ELSE
     C* 国内
     C           DELDYA    IFEQ 0
     C*
     C                     EXSR #DELD2
     C                     Z-ADDWDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C*納期指定
     C                     ELSE
     C           DELDYA    IFEQ 999999
     C           DELDYA    OREQ 99999999
     C                     MOVE DELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD0         DELCD            納期指定
     C                     Z-ADD0         W#DELC  10
     C                     ELSE
     C*
     C*納期＜＝今日より小さい
     C***        DELDYA    IFLE *DATE
     C           DELDYA    IFLT *DATE
     C*
     C                     EXSR #DELD2
     C                     Z-ADDWDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C*
     C                     ELSE
     C                     MOVE DELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD1         DELCD            納期指定
     C                     Z-ADD1         W#DELC  10
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C*
     C                     MOVEL*BLANK    A1
     C                     Z-ADD0         A2
     C                     Z-ADD0         A3
     C                     Z-ADD0         A4
     C                     Z-ADD0         A5
     C                     Z-ADD0         A6
     C                     Z-ADD0         QUANT
     C                     Z-ADD0         TANKA1
     C                     Z-ADD0         KINGA
     C                     MOVEL*BLANK    ITDSC
     C                     MOVE '0000000' ITCOD
     C                     MOVEL'0000000' ITCOD
     C                     MOVEL*BLANK    DOJNO
     C*分納不可
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYN
     C                     ELSE
     C                     Z-ADD1         BUNYN
     C                     ENDIF
     C*
     C                     Z-ADD0         INVNO
     C                     MOVEL*BLANK    NBNBR
     C                     Z-ADD0         BUMOR
     C                     MOVEL*BLANK    BUNDT
     C                     Z-ADD0         BQUAN
     C                     Z-ADD0         HJQTY
     C                     Z-ADD0         BUNSU
     C                     MOVEL*BLANK    REJUK
     C                     MOVEL*BLANK    SLSND
     C                     Z-ADD0         TKING
     C                     MOVEL*BLANK    SSHUF
     C                     Z-ADD0         HIKIQ
     C                     MOVEL*BLANK    NOFIL
     C                     MOVEL' '       ZZ0172
     C                     MOVEL*BLANK    SHPCD
     C                     Z-ADD0         SHUDY
     C                     MOVE *DATE     REDAY
     C                     MOVE *DATE     JUTDY8
     C                     Z-ADD0         SHUDY8
     C                     MOVE *DATE     REDAY8
     C                     Z-ADD0         CODED
     C                     MOVEL*BLANK    CUSID
     C                     MOVEL*BLANK    SHICD
     C*
     C                     Z-ADDW#SYMD    CRTD2
     C                     Z-ADDW#SHMS    CRTT2
     C                     MOVELS#USR     USID2
     C                     MOVELS#JOB     JBID2
     C                     MOVELS#PGID    PGID2
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MOV2     BEGSR
     C                     MOVEL'JF'      ZZ0001
     C                     MOVEL' '       ACREC
     C                     Z-ADDWCNT      JUTNO
     C                     Z-ADDWSEQNO    SEQNO
     C                     MOVELCUSNRA    CUSNR
     C                     MOVELW#SHPN    SHPNR
     C*担当営業
     C           ESLSNA    IFNE 0
     C                     Z-ADDESLSNA    SLSNR
     C                     ELSE
     C                     Z-ADDSLSNRA    SLSNR
     C                     ENDIF
     C*
     C                     MOVELORDNOA    ORDNO
     C*
     C                     MOVE *DATE     JUTDY
     C                     Z-ADD0         DETCN
     C                     Z-ADD0         DELCD
     C                     Z-ADD0         W#DELC
     C* 海外
     C           W#CUS1    IFNE '0'
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     ELSE
     C* 国内
     C           DELDYA    IFEQ 0
     C*
     C                     EXSR #DELD2
     C                     MOVE WDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C*
     C                     ELSE
     C           DELDYA    IFEQ 999999
     C           DELDYA    OREQ 99999999
     C                     MOVE DELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD0         DELCD            納期指定
     C                     Z-ADD0         W#DELC           納期指定
     C                     ELSE
     C*
     C*納期指定＜＝今日より小さい
     C***        DELDYA    IFLE *DATE
     C           DELDYA    IFLT *DATE
     C*
     C                     EXSR #DELD2
     C                     MOVE WDELDY    DELDY
     C                     Z-ADDWDELDY    DELDY8
     C                     ELSE
     C*
     C                     MOVE DELDYA    DELDY
     C                     Z-ADDDELDYA    DELDY8
     C                     Z-ADD1         DELCD            納期指定
     C                     Z-ADD1         W#DELC           納期指定
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVEL'A'       A1
     C                     Z-ADD0         A2
     C                     Z-ADD0         A3
     C                     Z-ADD0         A4
     C                     Z-ADDWA5       A5
     C                     Z-ADD0         A6
     C                     Z-ADDORDQUA    QUANT
     C                     Z-ADDWTANKA    TANKA1
     C           TANKA1    MULT QUANT     KINGA
     C*
     C                     MOVEL*BLANK    ITDSC
     C                     MOVELWITDSC    ITDSC
     C*
     C*
     C           WELECD    IFNE ' '
     C                     MOVELWELECD    ITDS26
     C*
     C           TPRICA    IFNE *BLANK
     C                     MOVEL'ﾄｯｶ'     ITDS27
     C                     ENDIF
     C                     ELSE
     C*
     C*特価
     C           TPRICA    IFNE *BLANK
     C                     MOVEL'ﾄｯｶ'     ITDS28
     C                     ENDIF
     C*トルクセット
     C           TOKSSA    IFNE *BLANK
     C                     MOVEL'T'       ITDS26
     C                     MOVELTOKSSA    ITDS30
     C                     ENDIF
     C*
     C*ＳＥＴ品
     C           W#TR11    IFEQ 'S'
     C           W#TR21    OREQ 'S'
     C           W#TRE2    OREQ 'S'
     C                     MOVEL'SET'     ITDS28
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     MOVELWITCOD    ITCOD
     C                     MOVEL*BLANK    DOJNO
     C*
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYN
     C                     ELSE
     C                     Z-ADD1         BUNYN
     C                     ENDIF
     C*
     C           W#TRE1    IFGE '1'
     C           W#TRE1    ANDLE'99'
     C                     MOVEL'*'       TRACE
     C*
     C           ITDS26    IFEQ 'T'
     C                     ELSE
     C*
     C*ＳＥＴ品
     C           W#TR11    IFEQ 'S'
     C           W#TR21    OREQ 'S'
     C           W#TRE2    OREQ 'S'
     C                     MOVEL'SET'     ITDS28
     C                     ELSE
     C           ITDS26    IFNE '#'
     C           ITDS26    ANDNE'@'
     C                     MOVEL'ﾄﾚｻﾂｷ'   ITDS23
     C                     ELSE
     C                     MOVEL'ﾄﾚｻﾂ'    ITDS27
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*BLANK    TRACE
     C                     ENDIF
     C*
     C                     Z-ADD0         INVNO
     C                     MOVEL*BLANK    NBNBR
     C                     Z-ADD0         BUMOR
     C                     MOVEL*BLANK    BUNDT
     C                     Z-ADD0         BQUAN
     C                     Z-ADD0         HJQTY
     C                     Z-ADD0         BUNSU
     C                     MOVEL*BLANK    REJUK
     C                     MOVEL*BLANK    SLSND
     C                     Z-ADD0         TKING
     C                     MOVEL*BLANK    SSHUF
     C                     Z-ADD0         HIKIQ
     C                     MOVEL*BLANK    NOFIL
     C                     MOVEL*BLANK    SHPCD
     C                     Z-ADD0         SHUDY
     C                     MOVE *DATE     REDAY
     C                     MOVE *DATE     JUTDY8
     C                     Z-ADD0         SHUDY8
     C                     MOVE *DATE     REDAY8
     C                     Z-ADD0         CODED
     C                     MOVEL*BLANK    CUSID
     C                     MOVEL*BLANK    SHICD
     C*
     C                     Z-ADDW#SYMD    CRTD2
     C                     Z-ADDW#SHMS    CRTT2
     C                     MOVELS#USR     USID2
     C                     MOVELS#JOB     JBID2
     C                     MOVELS#PGID    PGID2
     C*
     C                     MOVEL*BLANK    LCLA2
     C                     MOVEL*BLANK    MCLA2
     C                     MOVEL*BLANK    SCLA2
     C           SEQNO     IFNE 0
     C                     SETOF                     90
     C           ITDS25    CHAINDMR0040              90
     C           *IN90     IFEQ '0'
     C                     MOVELLCLAS     LCLA2
     C                     MOVELMCLAS     MCLA2
     C                     MOVELSCLAS     SCLA2
     C                     ENDIF
     C                     ENDIF
     C*
     C           TPRICA    IFEQ *BLANK
     C                     Z-ADDWTANKA    TANKAA
     C           TANKA1    MULT QUANT     KINGAA
     C                     ELSE
     C*特価の場合
     C           TANKAA    MULT QUANT     KINGAA
     C                     ENDIF
     C*
     C                     Z-ADDWCNT      JUTNOA
     C                     Z-ADDWSEQNO    SEQNOA
     C                     UPDATRAML0041
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MOV3     BEGSR
     C                     MOVEL'ZM'      ZZ0014
     C                     MOVEL' '       ACREC4
     C                     Z-ADDWCNT      JUTNO4
     C                     Z-ADDWSEQNO    SEQNO4
     C                     MOVELWITCOD    ITCOD4
     C                     MOVELWJUTKC    JUTKC4
     C                     Z-ADDQUANT     QUANT4
     C                     Z-ADDWHIKI     QTYRS4
     C                     Z-ADDWMINO     QTYOB4
     C                     Z-ADDW#DELC    DELCD4
     C                     Z-ADD0         DOJNO4
     C*
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYN4
     C                     ELSE
     C                     Z-ADD1         BUNYN4
     C                     ENDIF
     C*
     C                     MOVEL*BLANK    ZZ0044
     C                     MOVEL*BLANK    HIKNB4
     C*
     C                     Z-ADDW#SYMD    CRTD4
     C                     Z-ADDW#SHMS    CRTT4
     C                     MOVELS#USR     USID4
     C                     MOVELS#JOB     JBID4
     C                     MOVELS#PGID    PGID4
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MOV5     BEGSR
     C                     MOVEL'ZM'      ZZ001R
     C                     MOVEL' '       ACRECR
     C                     Z-ADDWCNT      JUTNOR
     C                     Z-ADDWSEQNO    SEQNOR
     C                     MOVELWITNB1    ITCODR
     C                     MOVELWJUTKC    JUTKCR
     C                     Z-ADDQUANT     QUANTR
     C                     Z-ADDWHIKI     QTYRSR
     C                     Z-ADDWMINO     QTYOBR
     C                     Z-ADDW#DELC    DELCDR
     C                     Z-ADD0         DOJNOR
     C*
     C           W#CUS1    IFNE '0'
     C                     Z-ADD0         BUNYNR
     C                     ELSE
     C                     Z-ADD1         BUNYNR
     C                     ENDIF
     C*
     C                     MOVEL*BLANK    FILLRR
     C                     ENDSR
     C*-------------------------------------------------------
     C           #TR010    BEGSR
     C                     MOVEL*BLANK    P#DELC
     C                     Z-ADD1         P#SELC
     C                     MOVEL*BLANK    P#KOSN
     C                     Z-ADDWCNT      P#JUT4
     C                     Z-ADDWSEQNO    P#SEQ4
     C                     MOVEL*BLANK    P#NBNB
     C                     MOVEL*BLANK    P#NB11
     C                     MOVEL*BLANK    P#NB21
     C                     MOVEL*BLANK    P#NB31
     C                     MOVEL*BLANK    P#NB41
     C                     MOVEL*BLANK    P#NB51
     C                     Z-ADD0         P#DE11
     C                     Z-ADD0         P#DE21
     C                     Z-ADD0         P#DE31
     C                     Z-ADD0         P#DE41
     C                     Z-ADD0         P#DE51
     C                     MOVEL*BLANK    P#RECD
     C                     CALL '@TR0010' PAR010
     C                     ENDSR
     C*-----------------------------------------------------
     C           #D120     BEGSR
     C*
     C                     SETOF                     95
     C           WJUTNO    CHAINDTR0120              95
     C           *IN95     IFEQ '1'
     C*
     C                     MOVEL*BLANK    ACRECV
     C                     Z-ADDWJUTNO    JUTNOV
     C*
     C                     MOVELWJUTNO    JUTN2V
     C                     MOVE WJUTNO    SEQN2V
     C*
     C                     MOVELW#SHPN    SHPNRV           出荷先コード
     C*
     C                     SETOF                     96
     C           SHPNRV    CHAINDMR0030              96
     C           *IN96     IFEQ '0'
     C                     SELEC
     C           W#CUS1    WHNE '0'
     C                     MOVELAREABH    YUBINV
     C                     MOVELSHPNMH    SHPNMV
     C                     MOVELSHIP1H    SHIP1V
     C                     MOVELSHIP2H    SHIP2V
     C                     MOVELSHTEBH    SHTELV
     C                     MOVEL*BLANK    BUSYOV
     C                     MOVEL*BLANK    BIKO1V
     C                     MOVEL*BLANK    BIKO2V
     C                     Z-ADD0         DUEDYV           到着予定日
     C                     Z-ADD0         SAGCDV           佐川コード
     C                     OTHER
     C*
     C* 通常出荷先
     C*
     C           W#YUBI    IFEQ *BLANK
     C                     MOVELAREABH    YUBINV           郵便番号
     C                     MOVELSHPNBH    SHPNMV           出荷先名
     C                     MOVELSHP1BH    SHIP1V           住所１
     C                     MOVELSHP2BH    SHIP2V           住所２
     C                     MOVELSHTEBH    SHTELV           電話
     C                     MOVEL*BLANK    BUSYOV           部署
     C                     MOVEL*BLANK    BIKO1V           備考１
     C                     MOVEL*BLANK    BIKO2V           備考２
     C                     Z-ADD0         DUEDYV           到着予定日
     C                     Z-ADD0         SAGCDV           佐川コード
     C                     ELSE
     C*
     C                     MOVEL*BLANK    SHPNRV           出荷先コード
     C*
     C*直送出荷先
     C*
     C           W#SAGY    IFEQ 0
     C                     MOVELW#YUBI    YUBINV           郵便番号
     C                     MOVELW#SHP1    SHPNMV           出荷先名
     C                     MOVELW#SHI1    SHIP1V           住所１
     C                     MOVELW#SHI2    SHIP2V           住所２
     C                     MOVELW#SHTL    SHTELV           電話
     C                     MOVELW#BUSY    BUSYOV           部署
     C                     MOVELW#BIK1    BIKO1V           備考１
     C                     MOVELW#BIK2    BIKO2V           備考２
     C                     Z-ADDW#DUEY    DUEDYV           到着予定日
     C                     Z-ADD0         SAGCDV           佐川コード
     C                     ELSE
     C*佐川営業所止め
     C*
     C                     SETOF                     90
     C           W#SAGY    CHAINDMR0330              90
     C           *IN90     IFEQ '0'
     C                     MOVELZIPCD3    YUBINV           郵便番号
     C                     MOVELW#SHP1    SHPNMV           出荷先名
     C                     MOVELW#SHI1    SHIP1V           住所１
     C                     MOVELW#SHI2    SHIP2V           住所２
     C                     MOVELW#SHTL    SHTELV           電話
     C                     MOVELW#BUSY    BUSYOV           部署
     C                     MOVELW#BIK1    BIKO1V           備考１
     C                     MOVELW#BIK2    BIKO2V           備考２
     C                     Z-ADDW#DUEY    DUEDYV           到着予定日
     C                     Z-ADDW#SAGY    SAGCDV           佐川コード
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDSL
     C                     ENDIF
     C*
     C                     Z-ADD0         SHKD8V
     C                     Z-ADD0         REDA8V
     C                     Z-ADD0         SHUD8V
     C*
     C                     Z-ADD0         TIMCDV
     C*
     C                     Z-ADDW#SYMD    CRTD2V
     C                     Z-ADDW#SHMS    CRTT2V
     C                     MOVELS#USR     USID2V
     C                     MOVELS#JOB     JBID2V
     C                     MOVELS#PGID    PGID2V
     C                     WRITERDTR0120
     C                     ENDIF
     C*
     C                     EXSR #TEL4
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #TANKA    BEGSR
     C                     Z-ADD0         WTANKA  90
     C                     SELEC
     C           WDCODE    WHEQ 0
     C                     Z-ADDLSTPCK    WTANKA
     C           WDCODE    WHEQ 1
     C                     Z-ADDUPD01K    WTANKA
     C           WDCODE    WHEQ 2
     C                     Z-ADDUPD02K    WTANKA
     C           WDCODE    WHEQ 3
     C                     Z-ADDUPD03K    WTANKA
     C           WDCODE    WHEQ 4
     C                     Z-ADDUPD04K    WTANKA
     C           WDCODE    WHEQ 5
     C                     Z-ADDUPD05K    WTANKA
     C           WDCODE    WHEQ 6
     C                     Z-ADDUPD06K    WTANKA
     C           WDCODE    WHEQ 7
     C                     Z-ADDUPD07K    WTANKA
     C           WDCODE    WHEQ 8
     C                     Z-ADDUPD08K    WTANKA
     C           WDCODE    WHEQ 9
     C                     Z-ADDUPD09K    WTANKA
     C           WDCODE    WHEQ 10
     C                     Z-ADDUPD10K    WTANKA
     C           WDCODE    WHEQ 11
     C                     Z-ADDUPD11K    WTANKA
     C           WDCODE    WHEQ 12
     C                     Z-ADDUPD12K    WTANKA
     C           WDCODE    WHEQ 13
     C                     Z-ADDUPD13K    WTANKA
     C           WDCODE    WHEQ 14
     C                     Z-ADDUPD14K    WTANKA
     C           WDCODE    WHEQ 15
     C                     Z-ADDUPD15K    WTANKA
     C           WDCODE    WHEQ 16
     C                     Z-ADDUPD16K    WTANKA
     C           WDCODE    WHEQ 17
     C                     Z-ADDUPD17K    WTANKA
     C                     ENDSL
     C*
     C           TPRICA    IFEQ *BLANK
     C                     ELSE
     C                     Z-ADDTANKAA    WTANKA
     C                     ENDIF
     C*
     C                     ENDSR
     C*----------------------------------------------------------
     C           #RTN3     BEGSR
     C                     SETOF                     90
     C*
     C***        A1        IFEQ 'E'
     C*
     C                     MOVEA*BLANK    WK1
     C                     MOVEA*BLANK    WK2
     C                     MOVEL'00000000'L      14
     C                     MOVE '000000'  L
     C***        ITDS14    CHAINDTR5170              90
     C***        WWWITN    CHAINDTR5170              90
     C***        *IN90     IFEQ '0'
     C                     MOVEAWITNB1    WK1
     C                     MOVELDESNOB    L
     C***                  MOVEAITDSEB    WK2
     C                     MOVEAITDSJB    WK2
     C***                  ENDIF
     C*
     C                     Z-ADD1         Y       20
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C                     MOVE WK1,Y     WKITD1  1                    +
     C           WKITD1    IFEQ *BLANK                     *********   +
     C                     Z-ADD1         Z       20                   +
     C           Y         ADD  1         Y                            +
     C*                                                                +
     C                     Z-ADD0         FLAG11  10                   +
     C           FLAG11    DOWEQ0                          +++++++     +
     C           Y         IFLE 30                         ***** +     +
     C                     MOVE WK2,Z     WK1,Y                * +     +
     C           Y         ADD  1         Y                    * +     +
     C           Z         ADD  1         Z                    * +     +
     C                     ELSE                            ----* +     +
     C                     MOVEAWK1       WITDSC               * +     +
     C                     Z-ADD0         Z                    * +     +
     C                     Z-ADD0         Y                    * +     +
     C                     Z-ADD1         FLAG11               * +     +
     C                     Z-ADD1         FLAG10               * +     +
     C                     ENDIF                           ***** +     +
     C*                                                          +     +
     C                     ENDDO                           +++++++     +
     C*                                                            *   +
     C                     ELSE                            --------*   +
     C           Y         ADD  1         Y                        *   +
     C                     ENDIF                           *********   +
     C*                                                                +
     C                     ENDDO                           +++++++++++++
     C*
     C                     ENDSR
     C*------------------------------------------------------------
     C*出荷工場設定
     C           #SHKA     BEGSR
     C*
     C           *LOVAL    SETLLAML0043
     C                     Z-ADD0         FLAG15  10
     C           FLAG15    DOWEQ0
     C                     SETOF                     70
     C                     READ RAML0043                 70
     C           *IN70     IFEQ '1'
     C                     Z-ADD1         FLAG15
     C                     ELSE
     C*
     C           A1A       IFEQ 'X'
     C           W#TRE1    IFGE '1'
     C           W#TRE1    ANDLE'99'
     C*
     C*出荷工場検索
     C                     MOVEL*BLANK    W#POST  1
     C                     Z-ADD1         P#SELE
     C                     MOVELCUSNRA    P#CUSN
     C                     MOVELORDNOA    P#ORDN
     C                     MOVELOFNAMA    P#OFNA
     C                     MOVEL*BLANK    P#POST
     C                     Z-ADD0         P#JUT2
     C                     Z-ADD0         P#SEQ2
     C                     Z-ADD0         P#QUA2
     C                     MOVELTRESAA    P#TRES
     C                     MOVEL*BLANK    P#ITDS
     C                     CALL '@AM0230' PAR090
     C*
     C                     MOVELP#POST    W#POST
     C*トレサ案内データ作成
     C                     Z-ADD2         P#SELE
     C                     MOVELCUSNRA    P#CUSN
     C                     MOVELORDNOA    P#ORDN
     C                     MOVELOFNAMA    P#OFNA
     C                     MOVELP#POST    P#POST
     C                     Z-ADDJUTNOA    P#JUT2
     C                     Z-ADDSEQNOA    P#SEQ2
     C                     Z-ADDORDQUA    P#QUA2
     C                     MOVELTRESAA    P#TRES
     C                     MOVEL*BLANK    P#ITDS
     C                     CALL '@AM0230' PAR090
     C*
     C           W#POST    IFNE *BLANK
     C                     SETOF                     91
     C           JUSENA    CHAINDTR0120              91
     C           *IN91     IFEQ '0'
     C                     MOVELP#POST    SHOCDV
     C                     UPDATRDTR0120
     C                     ENDIF
     C                     ENDIF
     C*
     C*トレサ書類の品名に品名を付与する
     C***        P#ITDS    IFNE *BLANK
     C***                  MOVEL'('       W#ITN1
     C***                  MOVELP#ITDS    W#ITN2
     C*文字列操作（型式結合）
     C***                  MOVEL'2'       P#SKBN
     C***                  Z-ADD42        P#LENG
     C***                  MOVELITNBRA    P#MOJ1
     C***                  MOVEL'('       P#MOJ2
     C***                  MOVEL*BLANK    P#MOJ3
     C***                  MOVEL*BLANK    P#RETN
     C***                  CALL '@SB010R' PAR070
     C***                  MOVELP#MOJ3    ITNBRA
     C*
     C***                  MOVEL*BLANK    P#MOJ1
     C***                  MOVEL*BLANK    P#MOJ2
     C***                  MOVEL*BLANK    P#MOJ3
     C***                  MOVEL'2'       P#SKBN
     C***                  Z-ADD42        P#LENG
     C***                  MOVELITNBRA    P#MOJ1
     C***                  MOVELP#ITDS    P#MOJ2
     C***                  MOVEL*BLANK    P#MOJ3
     C***                  MOVEL*BLANK    P#RETN
     C***                  CALL '@SB010R' PAR070
     C***                  MOVELP#MOJ3    ITNBRA
     C*文字列操作（型式結合）
     C***                  MOVEL*BLANK    P#MOJ1
     C***                  MOVEL*BLANK    P#MOJ2
     C***                  MOVEL*BLANK    P#MOJ3
     C***                  MOVEL'2'       P#SKBN
     C***                  Z-ADD42        P#LENG
     C***                  MOVELITNBRA    P#MOJ1
     C***                  MOVEL')'       P#MOJ2
     C***                  MOVEL*BLANK    P#MOJ3
     C***                  MOVEL*BLANK    P#RETN
     C***                  CALL '@SB010R' PAR070
     C***                  MOVELP#MOJ3    ITNBRA
     C***                  UPDATRAML0043
     C*
     C*
     C***                  MOVEL*BLANK    WKITDS 25
     C***                  MOVELITNBRA    WKITDS
     C***                  SETOF                     91
     C***        D002A     CHAINDTR0020              91
     C***        *IN91     IFEQ '0'
     C******               MOVELWKITDS    ITDSC
     C***                  MOVELITNBRA    ITDSC
     C***                  UPDATRDTR0020
     C***                  ENDIF
     C*
     C***                  ENDIF
     C*
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDDO
     C                     ENDSR
     C*------------------------------------------------------------
     C*DTR0540 同時納入
     C           #DOJ1     BEGSR
     C*
     C                     Z-ADD0         FLAG20  10
     C                     Z-ADD0         MDS2    10
     C                     MOVEL*BLANK    MDS1    1
     C*
     C           *LOVAL    SETLLAML0043
     C                     Z-ADD0         FLAG15  10
     C           FLAG15    DOWEQ0
     C                     SETOF                     70
     C                     READ RAML0043                 70
     C*
     C           *IN70     IFEQ '1'
     C                     Z-ADD1         FLAG15
     C                     ELSE
     C*
     C                     SELEC
     C           W#CUS2    WHEQ '0M'
     C                     MOVELORDN7A    W#ORD3
     C           W#CUS2    WHEQ '0T'
     C                     MOVELORDN8A    W#ORD3
     C                     ENDSL
     C*------------
     C           CUSNRA    IFEQ W#CUSN
     C***        OFNAMA    ANDEQW#OFNA
     C           WKSH12    ANDEQW#SH12
     C           WKBUS2    ANDEQW#BU22
     C                     ELSE
     C                     ENDIF
     C*
     C*明細数確認（２件以上あるか？）
     C                     EXSR #MEIC2
     C*
     C*
     C           W#COUT    IFGE 2
     C*
     C*同時納入かトレサ付きか？
     C           DOJCDA    IFEQ '*'
     C           JUTNOA    ANDNE0
     C*
     C           W#TRE1    ORGE '1'
     C           W#TRE1    ANDLE'99'
     C           JUTNOA    ANDNE0
     C*
     C           MDS1      IFEQ *BLANK
     C                     MOVELCUSNRA    W#CUSN  5
     C                     MOVELORDNOA    W#ORDN 15
     C                     MOVELOFNAMA    W#OFNA 82
     C*-------------
     C*代理店名
     C                     SETOF                     9060
     C           CUSNRA    CHAINDMR0010              90
     C           *IN90     IFEQ '0'
     C                     MOVELSHPNBE    W#SHPM 80
     C*
     C           SHPN2A    IFNE *BLANK
     C                     MOVELSHPN2A    W#SHPN  5
     C                     ELSE
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEL*BLANK    W#SHPM
     C                     ENDIF
     C*
     C                     EXSR #DS120                     出荷先
     C                     EXSR #DOJCK                     同時NO取得
     C                     MOVEL1         MDS1
     C*
     C                     ENDIF
     C*------------
     C*
     C                     EXSR #DR120
     C*
     C*------------
     C           CUSNRA    IFEQ W#CUSN
     C***        OFNAMA    ANDEQW#OFNA
     C           WKSH12    ANDEQW#SH12
     C           WKBUS2    ANDEQW#BU22
     C*
     C*--
     C                     EXSR #D540
     C*--
     C                     ELSE
     C*
     C*切り替わり
     C                     MOVELCUSNRA    W#CUSN
     C                     MOVELORDNOA    W#ORDN
     C                     MOVELOFNAMA    W#OFNA
     C                     MOVELORDN7A    W#ORD3
     C                     Z-ADD0         FLAG20
     C*
     C                     EXSR #DS120
     C*
     C                     EXSR #DOJCK                     同時NO取得
     C*--
     C                     EXSR #D540
     C*--
     C                     ENDIF
     C*
     C                     ELSE
     C                     ENDIF
     C*
     C                     ELSE
     C*トレサ書類のみ ------------------------------------
     C           W#TRE2    IFNE *BLANK
     C           W#TRE1    ANDGE'1'
     C           W#TRE1    ANDLE'99'
     C           W#TRE2    OREQ *BLANK
     C           W#TRE1    ANDGE'1'
     C           W#TRE1    ANDLE'99'
     C           W#TR21    OREQ *BLANK
     C           W#TRE1    ANDGE'1'
     C           W#TRE1    ANDLE'9'
     C*
     C           JUTNOA    ANDNE0
     C                     SETOF                     90
     C           D0541     CHAINDTR0020              90
     C           *IN90     IFEQ '0'
     C                     Z-ADD999999    DELDY
     C                     Z-ADD99999999  DELDY8
     C                     UPDATRDTR0020
     C                     ENDIF
     C*-----------------------------------------------------
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
     C*------------------------------------------------------------
     C           #DOJCK    BEGSR
     C*同時納入NO採番--
     C           FLAG20    IFEQ 0
     C                     SETOF                     93
     C           2         CHAINNPD1910              93
     C           *IN93     IFEQ '1'
     C                     SETON                     H1
     C                     ELSE
     C                     Z-ADDORDNOX    WDOJNO 100
     C           ORDNOX    ADD  1         ORDNOX
     C                     UPDATRNPD1910
     C                     ENDIF
     C*NOチェック
     C           D0540     SETLLDTR0540
     C                     Z-ADD0         FLAG06  10
     C           FLAG06    DOWEQ0
     C                     SETOF                     73
     C                     READ DTR0540                  73
     C           *IN73     IFEQ '1'
     C                     Z-ADD1         FLAG06
     C                     ELSE
     C           DOJNO4    IFEQ WDOJNO
     C                     SETON                     H3
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*
     C                     Z-ADD1         FLAG20
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #D540     BEGSR
     C                     SETOF                     9495
     C           D0540     CHAINDTR0540              94
     C           *IN94     IFEQ '0'
     C                     SETON                     H2
     C                     ELSE
     C*
     C                     MOVEL*BLANK    RECCDX
     C                     MOVEL*BLANK    ACRECX
     C                     Z-ADDWDOJNO    DOJNOX
     C                     Z-ADDJUTNOA    JUTNOX
     C                     Z-ADDSEQNOA    SEQNOX
     C                     MOVELCUSNRA    CUSNRX
     C                     MOVE *DATE     MAKDY4
     C                     MOVE S#USR     W#USR   3
     C                     MOVELW#USR     JOBID4
     C                     MOVEL*BLANK    JOBUP4
     C                     TIME           CRTT14
     C                     MOVELS#PGID    PGID14
     C*
     C                     Z-ADD0         CRTDX4
     C                     Z-ADD0         CRTTX4
     C                     MOVEL*BLANK    USIDX4
     C                     MOVEL*BLANK    JBIDX4
     C                     MOVEL*BLANK    PGIDX4
     C*
     C                     WRITERDTR0540
     C*
     C           D0541     CHAINDTR0020              95
     C           *IN95     IFEQ '0'
     C                     MOVEL'*'       DOJNO
     C*LOG
     C                     Z-ADDW#SYMD    CRTD2
     C                     Z-ADDW#SHMS    CRTT2
     C                     MOVELS#USR     USID2
     C                     MOVELS#JOB     JBID2
     C                     MOVELS#PGID    PGID2
     C*
     C                     UPDATRDTR0020
     C*
     C                     MOVEL'*'       DOJCDA
     C                     UPDATRAML0043
     C*
     C                     ELSE
     C                     SETON                     H9
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #MEICK    BEGSR
     C*
     C                     Z-ADD0         W#COUT  20
     C           W#CUS2    IFNE '0M'
     C           W#CUS2    ANDNE'0T'
     C                     SETOF                     91
     C           A0100     CHAINAML0100              91
     C           *IN91     IFEQ '0'
     C                     Z-ADDCOUNTE    W#COUT
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETOF                     91
     C           A0101     CHAINAML0101              91
     C           *IN91     IFEQ '0'
     C                     Z-ADDCOUNTW    W#COUT
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MEIC2    BEGSR
     C*
     C           MDS1      IFEQ *BLANK
     C*
     C                     MOVEL*BLANK    W#SHN2 60
     C                     MOVEL*BLANK    W#SH12 70
     C                     MOVEL*BLANK    W#SH22 70
     C                     Z-ADD0         W#COUT  20
     C*
     C                     SETOF                     91
     C           A0120     CHAINAML0120              91
     C           *IN91     IFEQ '0'
     C                     Z-ADDCOUNTF    W#COUT
     C                     ELSE
     C*
     C                     EXSR #MEICK
     C*
     C                     ENDIF
     C*
     C                     ELSE
     C*
     C                     EXSR #DR120
     C*
     C                     SETOF                     91
     C           A0121     CHAINAML0120              91
     C           *IN91     IFEQ '0'
     C                     Z-ADDCOUNTF    W#COUT
     C                     ELSE
     C*
     C                     EXSR #MEICK
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #PRT01    BEGSR
     C                     MOVEL*BLANK    W#ORD7 15
     C                     MOVEL*BLANK    WK0RD7 15
     C                     Z-ADD0         MDS     10
     C                     Z-ADD0         FLAG10
     C                     MOVELTBL01,1   WMAIL  86
     C****       *LOVAL    SETLLAML0041
     C*LIST
     C                     Z-ADD0         FLAG98  10
     C                     MOVEL*BLANK    WKSHI1 60
     C                     MOVEL*BLANK    WKBUSY 62
     C           FLAG98    DOWEQ0
     C                     SETOF                     725051
     C                     SETOF                     525354
     C                     SETOF                     555657
     C                     READ RAML0040                 72
     C           *IN72     IFEQ '1'
     C                     Z-ADD1         FLAG98
     C                     ELSE
     C*
     C*受注担当者メールアドレス取得
     C                     MOVEL*BLANK    WKSHCD  1
     C                     MOVEL*BLANK    W#SNSN  3
     C                     MOVELSLSNRA    W#SNSN
     C**
     C                     MOVEL'585'     W#SNSN
     C                     SETOF                     90
     C           W#SNSN    CHAINAGM0060              90
     C           *IN90     IFEQ '0'
     C                     MOVELMAIL6     CCMAIL
     C                     ENDIF
     C*
     C                     EXSR #MAIL
     C*
     C           A1A       IFNE ' '
     C*エラーコード
     C                     SELEC
     C           ERRCDA    WHEQ '01'
     C                     SETON                     50    代理店
     C           ERRCDA    WHEQ '02'
     C                     SETON                     51    型式
     C           ERRCDA    WHEQ '03'
     C                     SETON                     52    数量
     C           ERRCDA    WHEQ '04'
     C                     SETON                     53    単価
     C           ERRCDA    WHEQ '05'
     C                     SETON                     54    トルク値
     C           ERRCDA    WHEQ '06'
     C                     SETON                     55    販売不可
     C           ERRCDA    WHEQ '07'
     C                     SETON                     56    販売単位
     C                     ENDSL
     C*
     C                     MOVELMFROMA    WMFROM 30
     C*
     C           MDS       IFEQ 0
     C                     MOVELCUSNRA    W#CUSN
     C                     MOVELORDNOA    W#ORDN
     C                     MOVELOFNAMA    W#OFNA
     C*
     C*注文番号取得
     C                     EXSR #ORD2
     C*-------------
     C*代理店名
     C                     SETOF                     9060
     C           CUSNRA    CHAINDMR0010              90
     C           *IN90     IFEQ '0'
     C                     MOVELSHPNBE    W#SHPM 80
     C*
     C           SHPN2A    IFNE *BLANK
     C                     MOVELSHPN2A    W#SHPN  5
     C                     ELSE
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEL*BLANK    W#SHPM
     C                     ENDIF
     C*
     C                     EXSR #DS120                     出荷先
     C*代理店メールアドレス取得
     C                     EXSR #DMAIL
     C*
     C                     SETON                     60
     C                     EXCPTMIDASI
     C                     SETOF                     60
     C                     Z-ADD1         MDS
     C                     ENDIF
     C*
     C                     EXSR #DR120                     出荷先
     C*------------
     C*注文番号取得
     C                     EXSR #ORD
     C*
     C           CUSNRA    IFEQ W#CUSN                     代理店
     C           OFNAMA    ANDEQW#OFNA                     ファイル名
     C           WKSH12    ANDEQW#SH12                     住所
     C           WKBUS2    ANDEQW#BU22                     部署１
     C*水戸は７桁・トミタブランク
     C           WKORD7    ANDEQW#ORD7                     注文番号
     C*
     C   OF                EXCPTMIDASI
     C   OF                SETOF                     OF
     C*
     C                     MOVEL*BLANK    W#NBNB  6
     C                     Z-ADD0         WKQTYR  50
     C                     Z-ADD0         WKQTOB  50
     C                     Z-ADD0         WDELDY
     C                     SETOF                     90
     C           D002A     CHAINDTR0020              90
     C           *IN90     IFEQ '0'
     C                     MOVELNBNBR     W#NBNB
     C                     Z-ADDDELDY8    WDELDY
     C                     MOVELITDSC     W#ITDS
     C*
     C                     EXSR #HIKI
     C*
     C                     EXSR #DOJNO
     C*
     C                     EXCPTMEI01
     C                     ELSE
     C*
     C*DTR0020に存在しない
     C                     MOVEL*BLANK    W#NBNB
     C                     Z-ADD0         WDELDY
     C                     MOVELITNBRA    W#ITDS
     C*
     C                     EXCPTMEI01
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVELCUSNRA    W#CUSN
     C***                  MOVELORDNOA    W#ORDN
     C                     MOVELOFNAMA    W#OFNA
     C*
     C                     EXSR #ORD2
     C*
     C                     EXSR #DS120
     C*代理店メールアドレス取得
     C                     EXSR #DMAIL
     C*-------------
     C                     SETOF                     90
     C           CUSNRA    CHAINDMR0010              90
     C           *IN90     IFEQ '0'
     C                     MOVELSHPNBE    W#SHPM
     C*
     C           SHPN2A    IFNE *BLANK
     C                     MOVELSHPN2A    W#SHPN  5
     C                     ELSE
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEL*BLANK    W#SHPM
     C                     ENDIF
     C*-------------
     C                     EXCPTMIDASI
     C*
     C                     MOVEL*BLANK    W#ITDS 30
     C                     MOVEL*BLANK    W#NBNB  6
     C                     Z-ADD0         WKQTYR  50
     C                     Z-ADD0         WKQTOB  50
     C                     Z-ADD0         WDELDY
     C                     SETOF                     90
     C           D002A     CHAINDTR0020              90
     C           *IN90     IFEQ '0'
     C                     MOVELITDSC     W#ITDS
     C                     MOVELNBNBR     W#NBNB
     C                     Z-ADDDELDY8    WDELDY
     C*
     C                     EXSR #HIKI
     C*
     C                     EXSR #DOJNO
     C*
     C                     EXCPTMEI01
     C                     ELSE
     C                     EXCPTMEI01
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*DELETE
     C***        *LOVAL    SETLLAML0041
     C***                  Z-ADD0         FLAG98  10
     C***        FLAG98    DOWEQ0
     C***                  SETOF                     72
     C***                  READ RAML0041                 72
     C***        *IN72     IFEQ '1'
     C***                  Z-ADD1         FLAG98
     C***                  ELSE
     C***                  DELETRAML0041
     C***                  ENDIF
     C***                  ENDDO
     C                     ENDSR
     C*
     C*----------------------------------------------------------
     C           #PRT02    BEGSR
     C                     Z-ADD0         MDS     10
     C                     Z-ADD0         FLAG10
     C                     MOVELTBL01,1   WMAIL
     C****       *LOVAL    SETLLAML0041
     C*LIST
     C                     Z-ADD0         FLAG98  10
     C                     MOVEL*BLANK    WKSHI1 60
     C                     MOVEL*BLANK    WKBUSY 62
     C           FLAG98    DOWEQ0
     C                     SETOF                     725051
     C                     SETOF                     525354
     C                     SETOF                     5556
     C                     READ RAML0040                 72
     C           *IN72     IFEQ '1'
     C                     Z-ADD1         FLAG98
     C                     ELSE
     C*
     C                     MOVEL*BLANK    WKSHCD  1
     C                     MOVEL*BLANK    W#SNSN  3
     C                     MOVELSLSNRA    W#SNSN
     C                     MOVEL'585'     W#SNSN
     C                     SETOF                     90
     C           W#SNSN    CHAINAGM0060              90
     C           *IN90     IFEQ '0'
     C                     MOVELMAIL6     CCMAIL
     C                     ENDIF
     C*
     C                     EXSR #MAIL
     C*
     C           A1A       IFNE ' '
     C*エラーコード
     C                     SELEC
     C           ERRCDA    WHEQ '01'
     C                     SETON                     50    代理店
     C           ERRCDA    WHEQ '02'
     C                     SETON                     51    型式
     C           ERRCDA    WHEQ '03'
     C                     SETON                     52    数量
     C           ERRCDA    WHEQ '04'
     C                     SETON                     53    単価
     C           ERRCDA    WHEQ '05'
     C                     SETON                     54    トルク値
     C           ERRCDA    WHEQ '06'
     C                     SETON                     55    販売不可
     C           ERRCDA    WHEQ '07'
     C                     SETON                     56    販売単位
     C                     ENDSL
     C*
     C                     MOVELMFROMA    WMFROM 30
     C*
     C           MDS       IFEQ 0
     C                     MOVELCUSNRA    W#CUSN
     C                     MOVELORDNOA    W#ORDN
     C*-------------
     C*代理店名
     C                     SETOF                     9060
     C           CUSNRA    CHAINDMR0010              90
     C           *IN90     IFEQ '0'
     C                     MOVELSHPNBE    W#SHPM 80
     C*--------------------------------
     C           SHPN2A    IFNE *BLANK
     C                     MOVELSHPN2A    W#SHPN  5
     C                     ELSE
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*----------------------------------
     C                     ELSE
     C                     MOVEL*BLANK    W#SHPM
     C                     ENDIF
     C*
     C                     EXSR #DS120                     出荷先
     C*
     C*代理店メールアドレス取得
     C                     EXSR #DMAIL
     C*
     C                     SETON                     60
     C                     EXCPTMIDASI
     C                     SETOF                     60
     C                     Z-ADD1         MDS
     C                     ENDIF
     C*
     C                     EXSR #DR120                     出荷先
     C*------------
     C           CUSNRA    IFEQ W#CUSN
     C           ORDNOA    ANDEQW#ORDN
     C*
     C   OF                EXCPTMIDASI
     C   OF                SETOF                     OF
     C*
     C                     MOVEL*BLANK    W#NBNB  6
     C                     Z-ADD0         WKQTYR  50
     C                     Z-ADD0         WKQTOB  50
     C                     Z-ADD0         WDELDY
     C                     SETOF                     90
     C           D002A     CHAINDTR0020              90
     C           *IN90     IFEQ '0'
     C                     MOVELNBNBR     W#NBNB
     C                     Z-ADDDELDY8    WDELDY
     C                     MOVELITDSC     W#ITDS
     C*
     C                     EXSR #HIKI
     C*
     C                     EXSR #DOJNO
     C*
     C                     EXCPTMEI01
     C                     ELSE
     C*
     C*DTR0020に存在しない
     C                     MOVEL*BLANK    W#NBNB
     C                     Z-ADD0         WDELDY
     C                     MOVELITNBRA    W#ITDS
     C*
     C                     EXCPTMEI01
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVELCUSNRA    W#CUSN
     C                     MOVELORDNOA    W#ORDN
     C*
     C*代理店メールアドレス取得
     C                     EXSR #DMAIL
     C*
     C                     EXSR #DS120
     C*-------------
     C                     SETOF                     90
     C           CUSNRA    CHAINDMR0010              90
     C           *IN90     IFEQ '0'
     C                     MOVELSHPNBE    W#SHPM
     C*--------------------------------
     C           SHPN2A    IFNE *BLANK
     C                     MOVELSHPN2A    W#SHPN  5
     C                     ELSE
     C                     MOVELSHPNRE    W#SHPN  5
     C                     ENDIF
     C*----------------------------------
     C                     ELSE
     C                     MOVEL*BLANK    W#SHPM
     C                     ENDIF
     C*-------------
     C                     EXCPTMIDASI
     C*
     C                     MOVEL*BLANK    W#ITDS 30
     C                     MOVEL*BLANK    W#NBNB  6
     C                     Z-ADD0         WKQTYR  50
     C                     Z-ADD0         WKQTOB  50
     C                     Z-ADD0         WDELDY
     C                     SETOF                     90
     C           D002A     CHAINDTR0020              90
     C           *IN90     IFEQ '0'
     C                     MOVELITDSC     W#ITDS
     C                     MOVELNBNBR     W#NBNB
     C                     Z-ADDDELDY8    WDELDY
     C*
     C*
     C                     EXSR #HIKI
     C*
     C                     EXSR #DOJNO
     C*
     C                     EXCPTMEI01
     C                     ELSE
     C                     EXCPTMEI01
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*DELETE
     C***        *LOVAL    SETLLAML0041
     C***                  Z-ADD0         FLAG98  10
     C***        FLAG98    DOWEQ0
     C***                  SETOF                     72
     C***                  READ RAML0041                 72
     C***        *IN72     IFEQ '1'
     C***                  Z-ADD1         FLAG98
     C***                  ELSE
     C***                  DELETRAML0041
     C***                  ENDIF
     C***                  ENDDO
     C                     ENDSR
     C*
     C*-------------------------------------------------------
     C           #ORD      BEGSR
     C*文字列操作（注文番号）
     C                     MOVEL'2'       P#SKBN
     C           W#CUS2    IFEQ '0M'
     C                     Z-ADD7         P#LENG
     C                     ELSE
     C                     Z-ADD8         P#LENG
     C                     ENDIF
     C*
     C                     MOVELORDNOA    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ3    WKORD7 15
     C*
     C***        W#CUS2    IFEQ '0M'
     C***                  ELSE
     C***                  MOVEL*BLANK    WKORD7
     C***                  ENDIF
     C                     ENDSR
     C*-------------------------------------------------------
     C           #ORD2     BEGSR
     C*文字列操作（注文番号）
     C                     MOVEL'2'       P#SKBN
     C           W#CUS2    IFEQ '0M'
     C                     Z-ADD7         P#LENG
     C                     ELSE
     C                     Z-ADD8         P#LENG
     C                     ENDIF
     C*
     C                     MOVELORDNOA    P#MOJ1
     C                     MOVEL*BLANK    P#MOJ2
     C                     MOVEL*BLANK    P#MOJ3
     C                     MOVEL*BLANK    P#RETN
     C                     CALL '@SB010R' PAR070
     C                     MOVELP#MOJ3    W#ORD7
     C                     MOVELP#MOJ3    W#ORD3
     C*
     C***        W#CUS2    IFEQ '0M'
     C***                  ELSE
     C***                  MOVEL*BLANK    W#ORD7
     C***                  ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DMAIL    BEGSR
     C*代理店メールアドレス
     C*メールアドレスつなぎ
     C                     SETOF                     61
     C           '@'       SCAN EMAILA:1  W       10     61
     C           *IN61     IFEQ '1'
     C***                  MOVEL';'       W#X1
     C***                  MOVELEMAILA    WMAIL2
     C                     ELSE
     C***                  MOVEL*BLANK    W#X1
     C***                  MOVEL*BLANK    WMAIL2
     C                     ENDIF
     C*
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DOJNO    BEGSR
     C*同時納入番号抽出
     C                     Z-ADD0         WKDOJN 100
     C                     SETOF                     92
     C           D0541     CHAINDTR0542              92
     C           *IN92     IFEQ '0'
     C           ACRECZ    IFNE 'D'
     C                     Z-ADDDOJNOZ    WKDOJN
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DR120    BEGSR
     C*
     C           W#CUS2    IFNE '0M'
     C           W#CUS2    ANDNE'0T'
     C*
     C                     SETOF                     91
     C           A0100     CHAINAML0100              91
     C           *IN91     IFEQ '0'
     C                     EXSR #DR12X
     C*出荷工場
     C                     EXSR #SHCD
     C                     ELSE
     C                     EXSR #DR12N
     C                     EXSR #SHCD
     C                     ENDIF
     C                     ELSE
     C*
     C                     SETOF                     91
     C           A0101     CHAINAML0101              91
     C           *IN91     IFEQ '0'
     C                     EXSR #DR12W
     C*出荷工場
     C                     EXSR #SHCD
     C                     ELSE
     C                     EXSR #DR12N
     C                     EXSR #SHCD
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DR12X    BEGSR
     C                     MOVELCUSNRE    WKCUSN  5
     C                     MOVELYUBINE    WKYUBI 10
     C                     MOVELSHPNME    WKSHP2 60
     C                     MOVELSHIP1E    WKSH12 70
     C                     MOVELSHIP2E    WKSH22 70
     C                     MOVELBUSYOE    WKBUS2 72
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DR12W    BEGSR
     C                     MOVELCUSNRW    WKCUSN  5
     C                     MOVELYUBINW    WKYUBI 10
     C                     MOVELSHPNMW    WKSHP2 60
     C                     MOVELSHIP1W    WKSH12 70
     C                     MOVELSHIP2W    WKSH22 70
     C                     MOVELBUSYOW    WKBUS2 72
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DR12N    BEGSR
     C                     MOVELCUSNRA    WKCUSN
     C                     MOVELYUBINA    WKYUBI
     C                     MOVELSHPNMA    WKSHP2
     C                     MOVELSHIP1A    W#SH12
     C                     MOVELSHIP2A    W#SH22
     C                     MOVELBUSYOA    W#BU22
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DS120    BEGSR
     C           W#CUS2    IFNE 'OM'
     C           W#CUS2    ANDNE'OT'
     C                     SETOF                     91
     C           A0100     CHAINAML0100              91
     C           *IN91     IFEQ '0'
     C                     EXSR #DS12X
     C*出荷工場
     C                     EXSR #SHCD
     C                     ELSE
     C*
     C                     EXSR #DS12N
     C                     EXSR #SHCD
     C                     ENDIF
     C                     ELSE
     C*
     C                     SETOF                     91
     C           A0101     CHAINAML0101              91
     C           *IN91     IFEQ '0'
     C                     EXSR #DS12W
     C*出荷工場
     C                     EXSR #SHCD
     C                     ELSE
     C                     EXSR #DS12N
     C                     EXSR #SHCD
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DS12X    BEGSR
     C                     MOVELCUSNRE    WKCUSN  5
     C                     MOVELYUBINE    W#YUBI 10
     C                     MOVELSHPNME    W#SHN2 60
     C                     MOVELSHIP1E    W#SH12 70
     C                     MOVELSHIP2E    W#SH22 70
     C                     MOVELBUSYOE    W#BU22 72
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DS12W    BEGSR
     C                     MOVELCUSNRW    WKCUSN  5
     C                     MOVELYUBINW    W#YUBI 10
     C                     MOVELSHPNMW    W#SHN2 60
     C                     MOVELSHIP1W    W#SH12 70
     C                     MOVELSHIP2W    W#SH22 70
     C                     MOVELBUSYOW    W#BU22 72
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DS12N    BEGSR
     C                     MOVELCUSNRA    WKCUSN
     C                     MOVELYUBINA    W#YUBI
     C                     MOVELSHPNMA    W#SHN2
     C                     MOVELSHIP1A    W#SH12
     C                     MOVELSHIP2A    W#SH22
     C                     MOVELBUSYOA    W#BU22
     C                     ENDSR
     C*----------------------------------------------------------
     C           #SHCD     BEGSR
     C                     SETOF                     91
     C           JUSENA    CHAINDTR0120              91
     C           *IN91     IFEQ '0'
     C                     MOVELSHOCDV    WKSHCD
     C                     ELSE
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C           #HIKI     BEGSR
     C*
     C                     SETOF                     91
     C           D004A     CHAINDTR0040              91
     C           *IN91     IFEQ '0'
     C                     Z-ADDQTYRS4    WKQTYR  50
     C                     Z-ADDQTYOB4    WKQTOB  50
     C                     ELSE
     C                     ENDIF
     C*
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DELDY    BEGSR                           納期
     C                     Z-ADD0         WDELDY  80
     C                     Z-ADD0         WRRNNO
     C                     SETOF                     90
     C           *DATE     CHAINDTP1110              90
     C           *IN90     IFEQ '0'
     C                     Z-ADDRRNNO     WRRNNO  40
     C                     ENDIF
     C*
     C                     Z-ADD0         CNT1    40
     C           WRRNNO    SETLLDTP1111
     C                     Z-ADD0         FLAG03  10
     C           FLAG03    DOWEQ0
     C                     SETOF                     70
     C                     READ DTP1111                  70
     C           *IN70     IFEQ '1'
     C                     Z-ADD1         FLAG03
     C                     ELSE
     C           THOLID    IFEQ ' '
     C                     ADD  1         CNT1
     C           CNT1      IFEQ 11
     C                     Z-ADDY2YMD     WDELDY  80
     C                     Z-ADD1         FLAG03
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
     C*----------------------------------------------------------
     C           #DELD2    BEGSR                           納期
     C*
     C                     SETOF                     90
     C           W#SYMD    CHAINDTP1110              90
     C           *IN90     IFEQ '0'
     C*
     C                     TIME           CLOCK   60
     C           CLOCK     IFLE WKTIME
     C*
     C           BIKO1T    IFEQ '*'
     C*---------------------------------------------
     C*翌営業日納期
     C                     Z-ADDW#SYMD    P#DAY1
     C                     Z-ADD1         P#DATE
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR080
     C*
     C                     MOVE P#DAY2    WDELDY
     C*---------------------------------------------
     C                     ELSE
     C*棚卸し日
     C           TANA1T    IFEQ '*'
     C*営業日
     C                     Z-ADDW#SYMD    P#DAY1
     C                     Z-ADD0         P#DATE
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR080
     C*
     C                     MOVE P#DAY2    WDELDY
     C*
     C                     ELSE
     C                     Z-ADD*DATE     WDELDY
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ELSE
     C*---------------------------------------------
     C*翌営業日納期
     C                     Z-ADDW#SYMD    P#DAY1
     C           TANA1T    IFEQ '*'
     C                     Z-ADD0         P#DATE
     C                     ELSE
     C                     Z-ADD1         P#DATE
     C                     ENDIF
     C*
     C                     Z-ADD0         P#DAY2
     C                     CALL '@NP0630' PAR080
     C*
     C                     MOVE P#DAY2    WDELDY
     C*
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDSR
     C*------------------------------------------------------------
     C           #HAIT1    BEGSR
     C*<<排他制御（解除）>>
     C                     MOVEL'L'       P#SYOK           処理区分
     C                     MOVEL'DTR0030' P#OBJF            ﾌｧｲﾙID
     C                     MOVEL'1'       P#OBJ1            KEY1
     C                     MOVEL*BLANK    P#OBJ2            KEY2
     C                     MOVEL*BLANK    P#OBJ3            KEY3
     C                     MOVEL*BLANK    P#OBJ4            KEY4
     C                     MOVEL*BLANK    P#OBJ5            KEY5
     C                     MOVELS#PGID    P#CRTP            ﾌﾟﾛｸﾞﾗﾑID
     C                     MOVELS#USR     P#USID            ﾕｰｻﾞｰID
     C                     MOVELS#JOB     P#JBID            ｼﾞｮﾌﾞID
     C                     MOVEL*BLANK    P#RTN2            ﾘﾀｰﾝｺｰﾄﾞ
     C                     CALL '@SB030R' PAR060
     C                     ENDSR
     C*-----------------------------------------------------
     C           #HAIT2    BEGSR
     C*<<排他制御（解除）>>
     C                     MOVEL'U'       P#SYOK           処理区分
     C                     MOVEL'DTR0030' P#OBJF            ﾌｧｲﾙID
     C                     MOVEL'1'       P#OBJ1            KEY1
     C                     MOVEL*BLANK    P#OBJ2            KEY2
     C                     MOVEL*BLANK    P#OBJ3            KEY3
     C                     MOVEL*BLANK    P#OBJ4            KEY4
     C                     MOVEL*BLANK    P#OBJ5            KEY5
     C                     MOVELS#PGID    P#CRTP            ﾌﾟﾛｸﾞﾗﾑID
     C                     MOVELS#USR     P#USID            ﾕｰｻﾞｰID
     C                     MOVELS#JOB     P#JBID            ｼﾞｮﾌﾞID
     C                     MOVEL*BLANK    P#RTN2            ﾘﾀｰﾝｺｰﾄﾞ
     C                     CALL '@SB030R' PAR060
     C                     ENDSR
     C*-----------------------------------------------------
     C* ﾄﾙｸｾｯﾄ
     C           #RTN4     BEGSR
     C                     MOVELTOKSSA    WTOKSS 11
     C                     MOVELTOTAMA    WTOTAM  1
     C           TOKSSA    IFNE *BLANK
     C                     SETOF                     90
     C*
     C                     MOVEA*BLANK    WK3
     C                     MOVEA*BLANK    WK4
     C                     MOVEATOKSSA    WK3
     C*
     C           WK3,1     IFEQ *BLANK
     C                     MOVEAWK3       WK4
     C                     ELSE
     C*
     C                     Z-ADD1         Y
     C                     Z-ADD1         Z
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C           WK3,Y     IFEQ *BLANK                     *********   +
     C           Y         ORGT 11                         *********   +
     C           Y         SUB  1         Y
     C           12        SUB  Y         Z
     C*
     C           Z         IFEQ 0
     C                     Z-ADD1         Z
     C                     ENDIF
     C*
     C                     MOVEAWK3       WK4,Z
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C           Y         ADD  1         Y
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDIF
     C*
     C                     ELSE
     C                     MOVEA*BLANK    WK3
     C                     MOVEA*BLANK    WK4
     C                     ENDIF
     C                     ENDSR
     C*----------------------------------------------------------
     C* ﾄﾙｸｾｯﾄ
     C           #RTN5     BEGSR
     C                     MOVEL*BLANK    W#TOK1  6
     C                     MOVEL*BLANK    W#TOK2  6
     C                     Z-ADD0         W#TOK3  90
     C                     Z-ADD0         W#TOK4  90
     C                     Z-ADD0         W#TOK5  93
     C                     Z-ADD0         W#TOK6  93
     C           TOKSSA    IFNE *BLANK
     C                     SETOF                     90
     C*
     C                     MOVEA*BLANK    WT1
     C                     MOVEA*BLANK    WT2              整数
     C                     MOVEA*BLANK    WT3
     C                     MOVEA*BLANK    WT4              小数
     C*
     C                     MOVEATOKSSA    WT1
     C*
     C           '.'       SCAN WTOKSS    W       10
     C*
     C           WT1,1     IFEQ *BLANK
     C                     MOVEAWT1       WK4
     C                     ELSE
     C*
     C                     Z-ADD1         Y
     C                     Z-ADD1         Z
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C           WT1,Y     IFEQ *BLANK                     *********   +
     C           WT1,Y     OREQ '.'                        *********   +
     C           Y         ORGT 6                          *********   +
     C           Y         SUB  1         Y
     C           7         SUB  Y         Z
     C*
     C           Z         IFEQ 0
     C                     Z-ADD1         Z
     C                     ENDIF
     C*
     C                     MOVEAWT1       WT2,Z
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C           Y         ADD  1         Y
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDIF
     C*
     C           W         IFNE 0
     C*
     C           W         ADD  1         Y
     C                     Z-ADD1         Z
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C           WT1,Y     IFEQ *BLANK                     *********   +
     C*
     C           Z         IFEQ 0
     C                     Z-ADD1         Z
     C                     ENDIF
     C*
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C                     MOVEAWT1,Y     WT3,Z
     C           Y         ADD  1         Y
     C           Z         ADD  1         Z
     C                     ENDIF
     C                     ENDDO
     C*--------------------------------
     C                     Z-ADD1         Y
     C                     Z-ADD1         Z
     C                     Z-ADD0         FLAG10  10
     C           FLAG10    DOWEQ0                          +++++++++++++
     C*                                                                +
     C           WT3,Y     IFEQ *BLANK                     *********   +
     C           WT1,Y     OREQ '.'                        *********   +
     C           Y         ORGT 6                          *********   +
     C           Y         SUB  1         Y
     C           7         SUB  Y         Z
     C*
     C           Z         IFEQ 0
     C                     Z-ADD1         Z
     C                     ENDIF
     C*
     C                     MOVEAWT3       WT4,Z
     C                     Z-ADD1         FLAG10
     C                     ELSE
     C           Y         ADD  1         Y
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDIF
     C*
     C                     MOVEAWT2       W#TOK1
     C                     MOVEAWT4       W#TOK2
     C                     MOVE W#TOK1    W#TOK3
     C                     MOVE W#TOK2    W#TOK4
     C*
     C                     SELEC
     C           W#TOK4    WHGE 1
     C           W#TOK4    ANDLT10
     C           W#TOK4    DIV  10        W#TOK6
     C           W#TOK4    WHGE 10
     C           W#TOK4    ANDLT100
     C           W#TOK4    DIV  100       W#TOK6
     C           W#TOK4    WHGE 100
     C           W#TOK4    ANDLT1000
     C           W#TOK4    DIV  1000      W#TOK6
     C                     ENDSL
     C*
     C           W#TOK3    ADD  W#TOK6    W#TOK5
     C*
     C                     ELSE
     C                     MOVEA*BLANK    WT1
     C                     MOVEA*BLANK    WT2
     C                     MOVEA*BLANK    WT3
     C                     MOVEA*BLANK    WT4
     C                     ENDIF
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MAIL     BEGSR
     C*
     C                     SELEC
     C           W#CUS2    WHEQ '0W'
     C                     MOVELTBL01,3   WMAIL
     C           W#CUS2    WHEQ '0Q'
     C                     MOVELTBL01,4   WMAIL
     C           W#CUS2    WHEQ '0I'
     C                     MOVELTBL01,5   WMAIL
     C           W#CUS2    WHEQ '0N'
     C                     MOVELTBL01,6   WMAIL
     C           W#CUS2    WHEQ '0F'
     C                     MOVELTBL01,7   WMAIL
     C           W#CUS2    WHEQ '0H'
     C                     MOVELTBL01,8   WMAIL
     C           W#CUS2    WHEQ '0J'
     C           W#CUS2    OREQ '0G'
     C                     MOVELTBL01,9   WMAIL
     C           W#CUS2    WHEQ '01'
     C           W#CUS2    OREQ '02'
     C                     MOVELTBL01,10  WMAIL
     C           W#CUS2    WHEQ '0S'
     C                     MOVELTBL01,11  WMAIL
     C           W#CUS2    WHEQ '0B'
     C                     MOVELTBL01,12  WMAIL
     C           W#CUS2    WHEQ '0U'
     C                     MOVELTBL01,13  WMAIL
     C           W#CUS2    WHEQ '0L'
     C                     MOVELTBL01,14  WMAIL
     C           W#CUS2    WHEQ '0M'
     C                     MOVELTBL01,15  WMAIL
     C           W#CUS2    WHEQ '0E'
     C                     MOVELTBL01,16  WMAIL
     C           W#CUS2    WHEQ '0A'
     C                     MOVELTBL01,17  WMAIL
     C           W#CUS2    WHEQ '0T'
     C                     MOVELTBL01,18  WMAIL
     C           W#CUS2    WHEQ '0K'
     C                     MOVELTBL01,19  WMAIL
     C                     ENDSL
     C                     ENDSR
     C*-----------------------------------------------------
     C           #TEL4     BEGSR                           TELNO下4桁
     C                     Z-ADDWJUTNO    P#JUN8
     C                     CALL '@SS4120' PAR150
     C                     ENDSR
     C*-----------------------------------------------------
     OQSYSPRT E  101           MIDASI
     O                         WMAIL     86
     O***                      WMFROM    71
     O                         UDATE     92
     O                         CLOCK     98
     O***                               133 'エラー表記意味'
     O***                      CCMAIL   193
     O*2
     O        E  1             MIDASI
     O                                   14 'ファイル名：'
     O                         FNAMEA    86
     O*3
     O        E  1             MIDASI
     O                                   14 'ｵﾘｼﾞﾅﾙﾌｧｲﾙ：'
     O                         OFNAMA    82
     O                                   97 '代EMAIL ：'
     O                         EMAILA   159
     O*
     O*4
     O        E  1             MIDASI
     O                         CUSNRA     5
     O                         W#SHPM    85
     O                         UDATE Y   90
     O                         CLOCK    100 '  :  :  '
     O***                               115 'C:顧客'
     O***                               124 'P:型式'
     O***                               133 'Q:数量'
     O***                               142 'K:単価'
     O***                               149 'T:ﾄﾙｸ'
     O***                               162 'H:販売不可'
     O***                               175 'S:数量単位'
     O*5
     O        E  1             MIDASI
     O                         SHPNMA    60
     O                         YUBINA    72
     O                         SHIP1A   144
     O*6
     O        E  1             MIDASI
     O                         SHIP2A    70
     O                         BUSYOA   144
     O                         SHTELA   160
     O*7
     O        E  1             MIDASI
     O                         BIKO1A    72
     O                         BIKO2A   146
     O                         DUEDYA   158 '    /  /  '
     O                         SAGCDA4  164
     O*8
     O        E  1             MIDASI
     O                                    8 '受注'
     O                                   17 '注文NO '
     O                                   31 '型式'
     O                                   63 '数量'
     O                                   72 '単価'
     O                                   82 '金額'
     O                                   89 '引'
     O                                   96 '未'
     O                                  122 'トルク値'
     O                                  129 '単位'
     O                                  138 '営業'
     O                                  145 '同'
     O*9
     O        E  1             MEI01
     O                         JUTNOA     6
     O                         SEQNOA     8
     O                         ORDNOA    24
     O                         W#ITDS    55
     O                         ORDQUA4   63
     O                         TANKAA4   71
     O                         KINGAA4   81
     O                         SLSNRA    86
     O                         A1A       88
     O                         WKQTYR4   88
     O                         WKQTOB4   94
     O                         WDELDYY  106
     O                         WKSHCD   108
     O                 50               113 'Cｴﾗｰ'
     O                 51               113 'Pｴﾗｰ'
     O                 52               113 'Qｴﾗｰ'
     O                 53               113 'Kｴﾗｰ'
     O                 54               113 'Tｴﾗｰ'
     O                 55               113 'Hｴﾗｰ'
     O                 56               113 'Sｴﾗｰ'
     O                         TOKSSA   125
     O                         TOTAMA   127
     O                         W#NBNB   134
     O                         ESLSNA4  138
     O                         TRESAA   141
     O                         DOJCDA   143
     O                         WKDOJN4  154
     O                         W#SHPN   160
** TBL01< ｺﾏﾝﾄﾞｶﾞｲﾀﾞﾝｽ >
ORDER_DONE@TOHNICHI.CO.JP
1ﾌｸﾛ    ｺｲﾘ､    ﾌｸﾛﾃﾊｲ
ORDER_DONEW@TOHNICHI.CO.JP
ORDER_DONEQ@TOHNICHI.CO.JP
ORDER_DONEI@TOHNICHI.CO.JP
ORDER_DONEN@TOHNICHI.CO.JP
ORDER_DONEF@TOHNICHI.CO.JP
ORDER_DONEH@TOHNICHI.CO.JP
ORDER_DONEG@TOHNICHI.CO.JP
ORDER_DONEP@TOHNICHI.CO.JP
ORDER_DONES@TOHNICHI.CO.JP
ORDER_DONEB@TOHNICHI.CO.JP
ORDER_DONEU@TOHNICHI.CO.JP
ORDER_DONEY@TOHNICHI.CO.JP
ORDER_DONEM@TOHNICHI.CO.JP
ORDER_DONEE@TOHNICHI.CO.JP
ORDER_DONEA@TOHNICHI.CO.JP
ORDER_DONET@TOHNICHI.CO.JP
ORDER_DONEK@TOHNICHI.CO.JP
